{
  "course_name": "Geographic Information System (GIS) Tutorial",
  "course_description": "No description found.",
  "topics": [
    "Social Science",
    "Geography",
    "Social Science",
    "Geography"
  ],
  "syllabus_content": "",
  "files": [
    {
      "category": "Resource",
      "title": "GIS Level 1 ArcGIS Pro Take-Home Exercises (PDF)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-str-001-geographic-information-system-gis-tutorial-january-iap-2022/mitres_str001iap22_level1_arcgis_takehome.pdf",
      "content": "Introduction to GIS & Mapping: ArcGIS\nDesktop\nYour task in this exercise is to determine the best place to build a mixed use facility in Hudson County, NJ. In\norder to revitalize the community and take advantage of special loans, you want to build your facility in an area\nwith at least 1.5 times the national unemployment rate (It was 4.4% as of August 2017, which is the year of our\ndata). You will also explore what sort of railroad transit is available in this area.\nOpen ArcGIS Pro\n1. Before you begin, decide where you will be storing the GIS files that you will be downloading and\ncreating in this exercise. You can create a working folder on the desktop or in the Documents folder. The\nexercise data is in the folder you downloaded before the workshop in the folder Data\\Final Exercise.\n2. Open ArcGIS Pro (Start (Windows icon)) > All Programs > ArcGIS > ArcGIS Pro). You will see an open\nscreen where you can create a new map from a blank template. Click on \"Map\" to do so.\n3. You will see a new form where you will name your project and where it will be located:\n4. Uncheck the \"Create a new folder for this project\" checkbox and select the folder where you\ndownloaded the data to (and not the folder that actually contains the data).\nMIT Libraries, GIS Services, Updated 1/6/2022\n\nArcgis Pro is designed like most Windows programs. All of the menus are context sensitive. In the top area (the\ntoolbar), you see a number of tools. Those tools change with the selection of tabs and depending on what data\nlayers you have highlighted.\nAdd a basemap from ArcGIS Online\nNotice that the map you created is not blank, but includes a default basemap. You can change the basemap if\nyou choose:\n1. Click the Map tab and Basemap.\n2. Click on Imagery.\nNote that the layer is served over the web so it may take some time to draw (and you have to be connected to\nthe internet for it to continue drawing). What you see depends on the scale you are working in on your map - as\nyou zoom in closer you will typically find more detailed information. Your scale is displayed below the map and\nautomatically adjusts as you zoom in and out.\nTo navigate your data, you will primarily use these buttons in the Map tab:\nMIT Libraries, GIS Services, Updated 1/6/2022\n\nFrom left to right, top row first, they are used to Zoom to the extent of all layers in the map, zoom to selected\ndata, fixed zoom in, and fixed zoom. You can use the scroll button on your mouse to zoom in and out and you\ncan left click and hold the click to pan around the map.\nFind and add data\nAs you learned, there are many sources for GIS data. We will first find transportation data for New Jersey.\n1. Go to: http://njogis-newjersey.opendata.arcgis.com/datasets?t=Transportation. This shows all the open\ntransportation data for New Jersey. We found this site by doing an internet search for \"new jersey gis\ndata.\"\n2. Search for \"railroad\" in the top search box. Options should drop down from the search box. View the\nPassenger Rail Stations data layer by clicking on its name.\n3. A page opens that previews the data on a map. Click the download icon to the left of the map.\n4. A download pane opens on the left side of the screen. Click Download under Shapefile.\n5. While the file downloads, click the information icon.\nBrief metadata is provided in the sidebar. Click the View Full Details button to see more.\n6. Return to the search box and repeat this process to locate and download the Railroads Network. If you\nwant to explore any other data from this area, feel free to download it.\n7. Move the data to your working folder and unzip each file by right clicking and selecting 7-zip > Extract\nhere (or use whatever data extraction tool you have installed on your computer).\n8. Click the Add Data button on the Map tab and navigate to your working folder where you unzipped the\ndata and add it to the map. One is called Railroads_Network and one has a long code name.\n9. Right click on each layer name and select Properties. In the General tab rename Railroads_Network to\nRailroad_Stations and the long code name to Railroad_Lines.\n10. In addition to the transportation data you just downloaded, add census unemployment data from the\nworkshop materials. It can be found in GIS_Level1_Data\\takehome_exercise.\n11. Right click on Hudson_tracts and select Zoom to Layer.\nThe US Census divides the country into continuous polygons and aggregates census data for these polygons\nbefore releasing the data to the public so that individual responses cannot be identified. Our data is for\ncensus tracts, which contain between 1200 and 8000 people total.\n12. In the Table of Contents of ArcGIS (where all layer names are listed) turn the layers on or off using the\ncheckboxes located to the left of each layer name. Leave the basemap layer unchecked for now so that\nthe next few steps will go more quickly.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\n13. Adjust which layer draws on top by dragging layers above or below one another. You will want your rail\nstations and rail lines on top so they won't be covered by the census tracts polygons. If your layers will\nnot drag, click the List by Drawing Order button at the top of the table of contents.\nExplore the attribute table\n1. Right click on each layer and select Attribute Table.\nEvery point, line, or polygon file has an attribute table. Any data in the attribute table can be used for displaying\nand labeling on the map and making queries. You can also create new columns in the table and add data or\ncalculations. Metadata can be key to understanding attribute tables that use codes and abbreviations.\n2. Leave the attribute table for the tract unemployment data open.\nCan you tell what any of the column headings mean? It's unlikely, so you will need to look at the metadata.\n3. Open the text file (outside of ArcGIS Pro) that is in your Data\\Final_Exercise folder. You now see the\ndefinition for each column. This data was downloaded from a database called Social Explorer, and joined\nto a polygon file from the US Census.\nVariable A17005_003 is the number of unemployed people in the civilian population. Is this what we want to\nmap? Why or why not?\nMapping raw numbers is usually not useful because the total population in one census tract may be more or less\nthan another. One way to \"normalize\" the data is to take into account the total population and calculate a rate.\n4. At the top of the Attribute Table, click the Add field button.\n5. Name the variable Unemp_rate and choose the type as double (you may need to double click on the\nData Type box in order to select it with the cursor). Close the Fields window with the \"X\" and save your\nchanges.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\n6. Right click on the new column that was added and select Calculate Field.\nWe want to divide the number of people unemployed by the total number of people in each tract. Based on the\nmetadata, which columns will you use?\n7. Add fields to the equation by double clicking on them in the list. Make sure your equation matches this\none: A17005_003! / !A17005_001! and click Run. Be patient, it will take a few seconds.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\nWe want to find tracts that are 1.5 times the national unemployment rate. This is equal to .066 or greater.\n8. Click the Table tab at the top of the window, then Select By Attributes. Keep all of the defaults and then\nclick Add (+) New Expression then Create a new expression.\n9. In the Where clause of the expression, you will notice three fields:\na. In the left field, change the column that you want to work with from FID to Unemp_rate in the\ndropdown list.\nb. In the middle field, change \"is equal to\" to \"is greater than or equal to\".\nc. In the last field, enter 0.066. Click Run to select the tracts that have an unemployment rate\ngreater than 0.066.\nAll rows that correspond to a tract with a higher than average unemployment rate are highlighted and the\ncorresponding tracts are highlighted on the map.\n10. Close the Attribute Table.\nExport to a new file\nWe will export the selected tracts to a new data layer so that we can more easily visualize which tracts have high\nunemployment. Exporting a smaller area of data is the easiest way to subset a dataset to only the desired\nrecords or keep your file sizes smaller and more manageable.\n1. Make sure the Hudson_tracts is highlighted in the table of contents.\n2. Click the Data tab and Layer from Selection. Note that this layer is temporary until we export it.\n3. Right click on the new layer created from the selection and select Data > Export Features.\n4. Click on the folder icon to view and edit the save location. Select the folder where you want to save the\nfile (you'll name the layer in the next step).\n5. In the Output Feature Class box name the layer unemp_high.\nNote that file names and locations can be very important when working on projects. GIS software tends to\ngenerate many files, so you want to make sure to use file names that are descriptive and easy to remember in\nthe future.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\n6. Click Run.\n7. Clear the selected features by selecting the Clear button in the Map tab.\n8. Save your map document.\nSymbolize data\nChange a single symbol\nRather than completely covering the unemployment polygon layer with the one for high unemployment, we can\nchange the symbology of the high unemployment layer so that we can still see the tracts for the entire county\nunderneath.\n1. In the table of contents, double click the colored rectangle below the high unemployment layer\n(unemp_high) and change the fill to a pattern, such as 10% simple hatch (you will have to scroll down to\nfind it). That way we can still see the unemployment tract data layer underneath.\n2. Close the Symbology box.\nExplore data distribution\nBefore we make a choropleth map of the unemployment rate, we need to examine our data in order to create\nthe most appropriate map. A quick way to explore the distribution of our data in ArcMap is to make a graph. For\nfuture projects, you will likely want to explore your data outside of ArcGIS in statistical or data visualization\nsoftware in order to better understand it.\n1. Click on the Hudson_tracts_unemp_2017 layer in the Table of Contents.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\n2. At the top of the window under Feature Layer, select the Data tab.\n3. Click Create Chart, choose Histogram.\n4. Choose Unemp_rate as the Number. Feel free to change the number of bins and see how the histogram\nchanges.\nThis histogram is showing the number of tracts (y axis) that fall into each unemployment range (x axis). Not all\nranges are shown because of size constraints on the axis, but this still gives you an idea of the general shape of\nyour data. We see that unemployment rate is relatively low, but that there are some outlying tracts with a high\nemployment rate.\n5. Close the Chart Properties box and the chart itself.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\nMake a choropleth map\n1. Make sure the Hudson_tracts_unemp_2017 layer is highlighted in the table of contents. At the top of\nwindow, click the Appearance tab. Click on the dropdown triangle below Symbology and select\nGraduated Colors. This will open the Layer Properties window.\n2. Select \"Unemp_rate\" as the Field.\n3. Symbolize the data in whatever way you think is best. Map symbology can be used to alter the way\npeople view and understand information, just like statistics. It is important to understand what you want\nto express in your map and how to best symbolize your data.\na. Chose a classification method and number of classes. In order to help you choose a classification\nmethod. Here is more information about each method: https://pro.arcgis.com/en/pro\napp/help/mapping/layer-properties/data-classification-methods.htm\nb. Pick a color scheme from the drop down menu.\nc. You can adjust the number of decimals shown by clicking the Advanced symbol options button\nand adjusting the Rounding options.\n4. Close the window when you are finished.\n5. Save your map document.\nDo you have an idea about where you might build based on the unemployment rate? Obviously many factors go\ninto selecting a building site. We will examine one more: train access.\nFind tracts that have railroad stations\nYou will use the Select by Location tool to select all tracts that contain a railroad station.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\n1. Click on the Map tab. In the Selection menu at the top, click \"Select By Location\".\na. For the Input Features, choose Hudson_tracts_unemp_2017.\nb. Change Relationship to Contains.\nc. For the Selecting Features, choose Railroad_Stations_in_NJ.\n2. Click Run. Now all tracts that contain a railroad station are highlighted in blue. This is temporary until\nyou clear the selection.\n3. Make these into a temporary layer again in the Data tab using the Layer from Selection button. We don't\nhave to export them to a permanent layer this time.\nChoose a tract for building\n1. With the Hudson_tracts_unemp_2017 layer selected in the Table of Contents click the Map tab and the\nClear button.\n2. Now choose the Select button in the tab. Click on the tract that you want to build in, based on the\nvisualization you have made. You can select more than one tract by holding the Shift key as you make\nyour selection.\n3. Again, create a layer from the selected data. Export the data using the method in the Export to\nA New File section of the exercise.\n4. Clear the selection once you have exported the layer and change the symbology of the layer to show it is\nthe one you selected for building.\n5. Wondering what area was actually chosen for this building? Add Bay_street_building from\nData\\Final_Exercise. You may need to double click on the point symbol and adjust the size to see it.\nRead the article here.\n6. Make final changes to the color of any of the data layers and zoom and center your map to prepare for\ncreating a layout.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\nCreate a layout of your map\n1. At the top of the window, in the Insert tab select New Layout.\n2. Select 8.5\" x 11\" Letter under ANSI Landscape.\n3. You should have an empty page. Click the Insert tab and Map Frame. Select the image of your map.\nDraw a box where you would like the map placed. Drag the corner of the map to fill most of the page\nbut leave room for a title, scale bar etc. If you need to adjust the scale once the map frame has been\ninserted, select or type in a value in the scale bar at the bottom of the screen (the smaller the number,\nthe more zoomed in the map).\n4. Click on the Insert tab and Legend. You need to drag the box big enough to see all of the entries. Only\nthe visible layers in your map will be included in the legend.\n5. Using the same procedure, insert a North arrow.\n6. From the Text dropdown (it will say rectangle now), choose Text and place it on your map. Write a title.\nExport your map\n1. Click on the Share tab.\n2. Click Export Layout from the Output section.\n3. Choose PDF in File Type and select the location to save to.\n4. Click on the Export button.\nNote that if you save as an AI (Adobe Illustrator), the layers will remain as separate, editable layers in\nIllustrator. If you save as JPEG or TIFF, you can adjust the resolution of the exported file.\n5. Open your map in Adobe Acrobat to see what it looks like.\nSave your ArcMap document\n1. Click Save button.\nNote that when you save an ArcGIS Pro document, you are only saving a link to the layers in your project. If you\nmove your project to a new location, you will need to move all the files linked to your project with\nit. Each shapefile has multiple files associated together, and they need to stay together to work properly! It is\nbest to save all files in the project folder so they are more transportable with the project.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nRES.STR-001 Geographic Information System (GIS) Tutorial\nIAP 2022\nFor information about citing these materials or our Terms of Use, visit:\nhttps://ocw.mit.edu/terms\nMIT Libraries, GIS Services, Updated 1/6/2022"
    },
    {
      "category": "Resource",
      "title": "GIS Level 1 ArcGIS Pro Workshop Exercises (PDF)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-str-001-geographic-information-system-gis-tutorial-january-iap-2022/mitres_str001iap22_level1_arcgispro.pdf",
      "content": "GIS Level 1: ArcGIS Pro Workshop Exercises\nExercise 1\nOpen software\n1.\nOpen ArcGIS Pro on your computer. Select Map from the Blank Templates area.\n2.\nName your Project GIS_Level1 and select a location for saving it. A blank map will now open.\nAdd data\n1.\nClick the Map tab and the Add Data button.\n2.\nNavigate to the workshop folder and select GIS_Level1_Data\\workshop_exercises.\n3.\nAdd all the data layers:\na.\nMBTA_NODE\nb.\nMBTA_ARC\nc.\ncambridge_demographics\nd.\ncambridge_DEM\ne.\ncambridge_restaurants\nIt may take a minute for the data to load.\nReview interface & organize data\n-\nThe center of the screen contains a basemap that has been automatically loaded. It is there to\nprovide context for the data that we added.\n-\nYou can move around the map using the pan and zoom buttons in the Map tab of the top menu\nbar.\n-\nData layer names are shown in the Contents pane on the left. You can right click on any layer\nand select Zoom to Layer to center it on the screen.\n1.\nDrag the layers up or down so that they do not cover each other.\n2.\nYou can turn layers on and off by checking/unchecking the box next to each name. Uncheck the\ncambridge_DEM for now so it is easier to see the other data layers (we will change its\nappearance later in the exercise).\n\nClicking the menus at the top of the screen will show various tools you can use to edit, visualize and\nanalyze your data. The toolbox in the Analysis tab will open the full list of analysis tools, which we will\nexplore more in GIS Level 2.\nIdentify types of data & explore attributes\n1. Look at the data layers in the Contents pane. Are they vector or raster data? If they are vector,\nare they point, line or polygon?\n2. To see the underlying data of each layer, right click on it and select Attribute Table.\na. What columns are included with the MBTA_ARC data?\nb. What about the cambridge_DEM? Why are they different?\n3. The cambridge_restaurants data layer is currently not in a shapefile format so it is not displaying\non the map, however we can convert it to point data by plotting the coordinates included in the\ntable.\na. Right click on the cambridge_restaurants table in the Contents pane and select Display\nXY Data.\nb. Click the folder next to Output Feature Class to select a location to save the data and\nchoose a file name.\nc. The X Field should already be filled in with Longitude and the Y field with Latitude. Keep\nthe Coordinate System as GCS_WGS_1984.\nd. Click OK.\n4. Save your map project and keep your map open.\n\nExercise 2\nData can be symbolized in a variety of ways, depending on the data format and available attributes.\nChange a single symbol\n1. Double click on the point symbol below the Cambridge_restaurants layer in the Contents pane.\n2. Choose a symbol to represent the restaurants. You can make additional modifications to the\nsymbol in the Properties tab.\n3. Close the Symbol window when you are finished.\nSymbolize categories\nYou want to change the color of the mbta lines (MBTA_ARC) so they correspond to the correct color.\n1. Right click on MBTA_ARC and select Symbology.\n2. Choose Unique Values under Primary symbology, which means that each value will be assigned\na unique color, pattern, etc.\n3. Look at the metadata (https://www.mass.gov/info-details/massgis-data-mbta-rapid-transit) to\ndetermine which column contains information about the name of the rapid transit line. Choose\nthe appropriate column from the dropdown menu in Field 1.\n4. Click the Add all Values button to add all unique values found in the LINE column.\n5. Click on the line symbol in the Symbol column to select an appropriate color. Click Apply and the\nback arrow after selecting each color.\n6. Close the Symbology window when you are finished.\nMake a choropleth map\n1. Select the Cambridge_demographics layer in the Contents pane by clicking on it so it is\nhighlighted.\n2. Click the Appearances menu and Symbology.\n3. Select Graduated Colors from the Primary symbology dropdown menu to create a choropleth\nmap.\n4. Open the metadata for this layer outside of ArcGIS Pro. It is in the workshop_exercise data\nfolder and called Cambridge_demographics_variable_names.txt. Choose which data you would\nlike to symbolize and choose the corresponding column from the Field dropdown menu.\n5. Experiment with different break methods, classes, and color schemes from the dropdown\nmenus until you are happy with your map.\n6. Click the Advanced symbology options tab and expand Format labels.\n7. Click the Category dropdown to select the appropriate numeric display for your data and alter\nthe number of decimal places if needed.\n8. Close the symbology window when you are finished.\n\nSymbolize a raster\n1. Right click on Cambridge_DEM and select Symbology.\n2. There are different options for symbolizing raster data versus vector data. The DEM is currently\nsymbolized as Unique values which are most appropriate for values that each represent a\ndifferent data category, such as land use so you should choose a different symbology. Feel free\nto experiment with other options from the dropdown menu:\na. Stretch: assigns a continuous color scheme from the minimum to the maximum value of\neach raster cell\nb. Discrete: you choose a specific number of colors to use when symbolizing data\nc. Classify: data value are grouped into classes, similar to when creating a choropleth map.\n3. When you are happy with your raster symbolization, close the Symbology window.\nSee the take home exercise for information on how to create a layout for printing or exporting your\nmap.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nRES.STR-001 Geographic Information System (GIS) Tutorial\nIAP 2022\nFor information about citing these materials or our Terms of Use, visit:\nhttps://ocw.mit.edu/terms"
    },
    {
      "category": "Resource",
      "title": "GIS Level 1 GIS Workshop Exercises (PDF)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-str-001-geographic-information-system-gis-tutorial-january-iap-2022/mitres_str001iap22_level1_qgis.pdf",
      "content": "GIS Level 1: QGIS Workshop Exercises\nExercise 1\nOpen software\n1. Open QGIS on your computer. Select the new Project icon.\n2. A blank map will now open. Click the Save icon to name and save your project.\nAdd data\n1. Click the top Layer Tab > Data Source Manager button.\n2. Click the Vector icon on the left.\n3. To the right of the 'Vector Dataset(s)' box, click the ... icon. Navigate to the workshop folder and\nGIS_Level1_Data/workshop_exercises.\n4. Hold Ctrl and select the .shp files for each of the following layers:\na. cambridge_demographics.shp\nb. MBTA_ARC.shp\nc. MBTA_NODE.shp\nWhen done selecting > click Open > and then click Add > and follow the instructions below.\n5. A coordinate reference system window may appear because our project has a different\ncoordinate system than our data layers. This tool will change the project coordinate reference\nsystem to that of the data layers so they appear less distorted on screen. We will discuss map\nprojections more in GIS Level 2. You can select OK to close this window for now.\n6. Now we will add raster data. Click the raster icon on the far left-hand side of the Data Source\nManager window.\na. Click the ... icon to the right of the Raster dataset(s) box and select cambridge_dem.tif\nfrom the data folder.\nb. Click Add and then close the window.\nNote: if you accidentally added duplicate layers you can right click them and select to remove.\n\n7. Make sure the Quick map plugin is installed by clicking Plugins > Manage and Install Plugins >\nand searching for QuickMapServices. Click the Install Plugin button. (This button will only be\nvisible if the plugin is not installed.) Close the plugin window.\n8. Add a basemap by clicking Web > QuickMapServices > OSM > OSM Standard.\nReview the interface & organize data\n-\nThe center of the screen displays any data that we added.\n-\nThe names of data layers are shown in the Layers pane on the left.\n-\nMove around the map using the pan and zoom buttons in the top menu bar.\n-\nRight click on any layer and select Zoom to Layer to center it on the screen\n-\nTurn layers on and off by checking/unchecking the box next to each name.\n1. Drag the layers up or down in the Layers box so that they do not cover each other.\nThe menus at the top of the screen show various tools you can use to analyze vector or raster data. New\nmenus may appear when you load additional plugins using the Plugins menu.\nIdentify types of data & explore attributes\n1. Look at the data layers in the Layers pane. Are they vector or raster data? If they are vector, are\nthey point, line or polygon?\n2. To see the underlying data table for a layer, right click and select Open Attribute Table.\na. What columns are included with the MBTA_ARC data?\nb. Is there an attribute table for cambridge_dem? Why might that be?\nCreating geographic data from tabular data\nThe cambridge_restaurants data layer is currently not in a shapefile format so it was not added to the\nmap, however we can convert it from a .csv to point data by plotting the coordinates included in the\ntable.\n1. Open the Layer > Data Source Manager again and select the Delimited Text tab.\n2. Next to File Name > click the ... menu and navigate to the .csv in the data folder.\n3. In the Geometry Definition section (click the arrow to extend the dropdown) select Point\ncoordinates with the X Field as Longitude and the Y field as Latitude.\n4. In the same section, for Geometry CRS, select EPSG:4326 - WGS 84 from the dropdown menu. If you\ndon't see it listed, click the Select CRS button next to the dropdown menu to search for it.\n5. Click Add and Close. Now see where the cambridge_restaurants show up as points.\n6. Save your project and keep it open.\n\nExercise 2\nData can be symbolized in a variety of ways, depending on the data format and available attributes.\nChange a single symbol\n1. Double click on the cambridge_restaurants layer in the Layers pane.\n2. Click the Symbology tab.\n3. Click on the text, Simple marker. Down below, choose a symbol to represent the restaurants.\nYou can make additional modifications to the symbol using the various dropdown menus.\n4. Click Ok and close the Properties window when you are finished.\nSymbolize categories\nNow change the color of the mbta lines (MBTA_ARC) so they correspond to the correct color.\n1. Right click on MBTA_ARC and select Properties. Select the Symbology tab.\n2. From the dropdown menu at the top, choose the styling to be Categorized, which means that\neach value will be assigned a unique color, pattern, etc.\n3. Look at the metadata (https://www.mass.gov/info-details/massgis-data-mbta-rapid-transit) to\ndetermine which column contains information about the name of the rapid transit line. Choose\nthe appropriate column from the dropdown menu in the Value box.\n4. Click the Classify button, at the bottom, to add all unique values found in the LINE column.\n5. Double click on the line symbol in the Symbol column to select an appropriate color.\n6. Click OK when you are finished.\nMake a choropleth map\n1. Double click the cambridge_demographics layer and select the Symbology menu.\n2. Select Graduated from the dropdown menu at the top to create a choropleth map.\n3. Open the metadata for this layer outside of QGIS. It is in workshop_exercise data folder and\ncalled cambridge_demographics_variable_names.txt.\n4. Choose which data you would like to symbolize and choose the corresponding column from the\nValue dropdown menu.\n5. Click the Classify button at the bottom of the window. Experiment with different break\nmethods, classes, and color schemes from the dropdown menus until you are happy with your\nmap.\n6. Use the precision dropdown menu to alter the number of decimal places if needed.\nClick Ok when you are finished.\n\nSymbolize a raster\n1. Double click on cambridge_dem and select the Symbology tab.\n2. Notice that there are different options for symbolizing raster data versus vector data.\na. The data are currently symbolized as Singleband gray, which assigns a continuous color\nscheme from the minimum to the maximum value of each raster cell.\nb. Another option that could be appropriate for this data is Singleband pseudocolor, in\nwhich data value are grouped into classes, similar to when creating a choropleth map.\nChoose a color ramp to see the options for this rendering. Note: Paletted/Unique values\nwould be the most appropriate for values that each represent a different data category,\nsuch as land use.\nc. Experiment with the symbolization. When you are happy with your raster click OK.\nSee the take home exercise to learn how to create a layout for printing or how to export your map.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nRES.STR-001 Geographic Information System (GIS) Tutorial\nIAP 2022\nFor information about citing these materials or our Terms of Use, visit:\nhttps://ocw.mit.edu/terms"
    },
    {
      "category": "Resource",
      "title": "GIS Level 1 Instructions (PDF)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-str-001-geographic-information-system-gis-tutorial-january-iap-2022/mitres_str001iap22_level1_instructions.pdf",
      "content": "GIS Level 1 Setup Instructions\nNote: This activity uses online resources that may not be freely available to OCW users.\nThank you for registering for GIS Level 1. Before the workshop, please do the following:\n1.\nDownload and install either ArcGIS Pro or QGIS\n2.\nInstall 7-zip if necessary\n3.\nDownload all workshop materials\n4.\nUpdate and setup Zoom\nDownload and install ArcGIS Pro or QGIS\nQGIS is a free, open source software program that will work on any operating system and doesn't take\nup much space on your computer. While it has many of the same capabilities as ArcGIS Pro, there are\nsome analyses you can't do in QGIS and it tends to have more bugs.\nArcGIS Pro is a commercial software from ESRI that we have a subscription for at MIT. It only runs on\nWindows and requires an account or a connection to the MIT license server to run. It includes a full\nsuite of GIS tools, but may not run well if you have a slower computer.\nIf you are not sure which software to use, this website has a lot of additional information:\nhttps://gisgeography.com/qgis-arcgis-differences/\nNote: This workshop will NOT use ArcGIS Desktop/ArcMap, only ArcGIS Pro, the newest GIS software\nfrom ESRI.\nArcGIS Pro installation\n1. Create an ArcGIS Online (AGOL) account: https://libguides.mit.edu/gis/webmap#s-lg-box-wrapper\n2. If you have not already downloaded Pro, log into your AGOL account. From your account page, click\nyour name in the upper right and select My settings > Licenses and click download next to ArcGIS Pro.\n3. After installing Pro, choose the Named User License type and select ArcGIS Online. You'll then see the\nsame login screen that you used to create your account.\nQGIS Installation\nFull instructions and links for installing QGIS for a number of different operating systems can be found\nhere: http://qgis.org/en/site/forusers/download.html\nWindows users should download QGIS Standalone Installer. (Mac users only have one option.)\nDownload QGIS 3.16 or higher. If you already have QGIS installed, we have tested the workshop\nexercises with versions 3.16 and higher so we recommend upgrading if you are using an older version.\n\n7-zip installation\nWorkshop files (and most GIS data) are in zipped folders. Most Windows computers have the option to\nextract data by right clicking and most Macs will automatically extract data. Occasionally your computer\nmay not have a built-in data extraction tool. In this case we recommend installing 7-zip:\nhttps://www.7-zip.org/\nWorkshop materials\nDownload all workshop materials.\nMaterials include the presentation, workshop exercises, take-home exercise, and all required data.\nZoom setup\n1.\nMake sure your Zoom app is up-to-date using these instructions. You may have difficulty\ncompleting exercises in breakout rooms if your Zoom is not updated:\nhttps://support.zoom.us/hc/en-us/articles/201362233-Upgrade-update-to-the-latest-version\n2.\nIf you have access to a second monitor (or a second \"smart\" device that can connect to a Zoom\nsession) it may greatly improve your workshop experience and make it easier to follow the\ninstructor and complete the exercises simultaneously. If not, it is still doable, for example, by\norganizing your screen in this way:\nhttps://raw.githubusercontent.com/hbctraining/bioinformatics_online/master/guidelines/img/S\ncreenshot%202020-03-23%2015.21.10.png\n3.\nWe encourage participation during the session and kindly ask you to use your video, if possible.\n4.\nMute audio except when talking (Tip: you can temporarily unmute yourself by pressing and\nholding a space bar. When it is released, Zoom goes back to the mute mode).\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nRES.STR-001 Geographic Information System (GIS) Tutorial\nIAP 2022\nFor information about citing these materials or our Terms of Use, visit:\nhttps://ocw.mit.edu/terms"
    },
    {
      "category": "Resource",
      "title": "GIS Level 1 QGIS Take-Home Exercises (PDF)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-str-001-geographic-information-system-gis-tutorial-january-iap-2022/mitres_str001iap22_level1_qgis_takehome.pdf",
      "content": "Introduction to GIS & Mapping: QGIS Desktop\nYour task in this exercise is to determine the best place to build a mixed use facility in Hudson County, NJ.\nIn order to revitalize the community and take advantage of special loans, you want to build your facility in an\narea with at least 1.5 times the national unemployment rate (4.4% as of August 2017, the year of our data). You\nwill also explore what sort of railroad transit is available in this area.\nOpen QGIS Desktop\nThis exercise has been tested with QGIS versions 3.16 and higher, though previous releases will likely work as\nwell.\n1. Decide what folder you will use to store your map and data. We recommend using the folder where you\ndownloaded the workshop materials.\n2. Open QGIS (Start (Windows icon)) > All Programs > QGIS > QGIS Desktop 3.X). Note: if this is the\ncomputer's first time opening the new version it may present window with a welcome message; click\n\"Let's get started!\" Now, open a new map by clicking on the Project tab in the top menu and then the\n'New' project icon in the upper left corner of the QGIS Desktop window.\na. If you do not see this icon it may be due to what toolbars are turned on. Go to the View tab in\nthe top menu > Toolbars (at bottom) > and make sure the following toolbars are checked:\nAttributes, Map Navigation, and Project. You can also access the panel and toolbar menu by\nright clicking anywhere in the grey of the top menu.\nNote: the QGIS Project file is a record of the layers that have been added to a map display, along with\nthe map display itself. This allows users to recover a map display including the layers in the map,\nsymbolization, visibility, units of measurement, and other display settings (similar to other software).\n3. Click Project > 'Save As...' to save your project in the folder you set up. We recommend saving frequently\nwith any GIS software as there can be crashes when running tools.\nAdd a basemap\nAdding a basemap is a quick and easy way to provide context to spatial data you are displaying or analyzing.\n1. Look for the Web menu at the top of the screen and QuickMapServices. If you do not see it, follow the\ninstructions below. If it is there, continue to step 2.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\na.\nIf you cannot see the QuickMapServices plugin, click 'Plugins' in the top menu > 'Manage and\nInstall Plugins...'\nb.\nSelect 'QuickMapServices' from the list of plugins.\nc.\nClick 'Install Plugin' > and 'Close' the window.\n2.\nClick the Web tab in the top menu, and hover over the QuickMapServices Plugin until the dropdown\nmenu shows. Click on OSM Standard.\n3.\nNote that the layer is served over the web so it may take some time to \"draw\" (you must be connected\nto the internet to use this plugin). What you see depends on the scale you are working in on your map\nas you zoom in closer (see methods below) you will typically find more detailed information. Your scale\nis displayed in the Standard toolbar and automatically adjusts as you zoom in and out.\n4.\nTo navigate your data you will primarily use these buttons:\nFrom left to right, they are used to pan, pan to selection, zoom in, zoom out, and zoom to the full extent\nof all visible data. Take a moment to explore these options as you will use them often. Note that the\nicons may vary slightly depending on the version of QGIS that you have. You can hover over an icon to\nsee its name.\n5.\nThe coordinate of your mouse pointer and zoom scale are shown along the bottom right of the map:\nFind and add data\nAs you learned, there are many sources for GIS data. We will first find transportation data for New Jersey.\n1.\nGo to: http://njogis-newjersey.opendata.arcgis.com/datasets?t=Transportation. This shows all the open\ntransportation data for New Jersey. We found this site by doing an internet search for \"new jersey gis\ndata.\"\n2.\nSearch for \"railroad\" in the top search box. Options should drop down from the search box. View the\nPassenger Rail Stations data layer by clicking on its name.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\n3. A page opens that previews the data on a map. Click the download icon on the left side of the map.\n4. A download pane opens on the left side of the screen. Click Download under Shapefile.\n5. While the file downloads, click the information icon. Brief metadata is provided in the sidebar. Click the\nView Full Details button to see more.\n6. Return to the search box and repeat this process to locate and download Railroads Network. If you\nwant to explore any other data from this area, feel free to download it.\n7. Move the files to your folder and unzip the files by right clicking on file and selecting 7-Zip > Extract Here\n(or use the data extraction software installed on your computer).\n8. Go back to QGIS. In the top menu select Layer > Add Layer > Add Vector Layer...\n9. Navigate to your working folder by clicking on ... to the right of the Source box.\na. Select the two shapefiles by selecting the file with the .shp extension. Hold ctrl to select multiple\nfiles. One is called Railroads_Network and one has a long code name.\nb. Click Open > Add (if a projection warning comes up, hit OK for now) > close window when done.\nc. Note that even though you selected the .shp files, QGIS is using all the files that make up the\nshapefile in order to place the data in the proper position on the map.\nd. If the box appears for converting coordinate reference systems, click Ok and Ok again if\nprompted. We will work with coordinate reference systems in GIS Level 2.\ne. Right click on the layer name and select, \"Zoom to layer.\" Note depending on the random color\nassigned to the railroad lines they may be hard to see.\nf.\nRight click on each layer name and select Rename Layer. Rename Railroads_Network to\nRailroad_Stations and the long code name to Railroad_Lines.\n10. In addition to the transportation data you just downloaded, add census unemployment data to the map.\nThis data can be found in the folder Data\\Final_Exercise. Repeat the process of adding a vector layer:\n\"Hudson_tracts_unemp_2017.shp\". Close the Add Vector data box and Zoom to this layer to hone in on\nthe project site.\nThe US Census divides the country into continuous polygons and aggregates census data for these polygons\nbefore releasing the data to the public so that individual responses cannot be identified. Our data is for\ncensus tracts, which contain between 1200 and 8000 people.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\n11. In the Table of Contents of QGIS (where all layer names are listed) turn the layers on or off using the\ncheckboxes located to the left of each layer name. Leave the basemap layer unchecked for now so that\nthe next few steps will go more quickly (basemaps can slow down the drawing of other layers).\n12. Adjust which layer draws on top by dragging layers above or below one another. Note: You will want to\nend up with your rail stations and rail lines on top so they won't be covered by census tract polygons.\nExplore the attribute table\n1. Right click on each layer's name > select Open Attribute Table... This is the data associated with each\nlayer, and what that layer's symbolization will be based upon.\nEvery point, line, or polygon file has an attribute table. Any data in the attribute table can be used for displaying\nand labeling that layer as well as make queries from. You can also create new columns in the table and add data\nor calculations. Note: metadata can be key to understanding attribute tables that use codes and abbreviations.\n2. Leave the attribute table for the tract unemployment data open.\nCan you tell what any of the column headings mean? It's unlikely, so you will need to look at the metadata.\nOpen the text file (outside of QGIS) in Data\\Final Exercise. You now see the definition for each column. Note:\nthis data was downloaded from a web based GIS, Social Explorer, and joined to a polygon file from the US\nCensus.\nQ: Variable A17005_003 is the number of unemployed people in the civilian population. Is this what we want to\nmap? Why or why not?\nA: Mapping raw numbers is not often useful because the total population in one census tract may be more\nor less than another, and so the counts are not meaningful to compare between geometries. One way to\n\"normalize\" data is to divide the counts by the total population to calculate a rate.\n3. Click the Open Field Calculator icon\na. Note, in some versions of QGIS this may be greyed out until you click the Toggle edit icon\n4. Make the Output field name Unemp_rate and make the Output field type Decimal number.\na. In some versions of QGIS, you may need to specify the field length (if these options are greyed\nout, ignore this step). In this case, make Output field length 11 (number of characters) and\nprecision (number of decimal places) 11.\nQ: Since we want to divide the number of people unemployed by the total number of people in each tract. What\ncolumns would you use to do this, (remember you can look at metadata to know what each column is)?\nA: To create the expression that will calculate the unemployment rate:\n-\nClick in the Expression box\n-\nOpen the Fields and Values menu in the box to the right (under the search line)\n-\nDouble click on the fields to add them to the expression box (you can also type them in directly)\n-\nUse the divide by function button between fields to create the expression shown.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\n5. Click OK.\n6. If you turned on editing, click the Save edits icon in the table's menu\nAnd click the Toggle edit ( ) to stop editing.\nIf you did not turn on editing, proceed to the next step.\nNext, based on the original problem statement we know that we want to find tracts that are 1.5 times the\nnational unemployment rate. This is equal to .066 or greater. Click the Select features using an expression\nbutton at the top of the table's menu window.\n7. Open the Fields and Values menu. Double click on Unemp_rate in the list. This will add it to the\nexpression box on the left. Finish the expression by setting it greater than or equal to .066\n(\"Unemp_rate\" >= .066). You will find >= in the Operators menu (below the Fields and Values menu).\nClick Select Features and close the Select by expression window, to see the rows that were selected.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\nAll rows that correspond to a tract with a higher than average unemployment rate are highlighted and the\ncorresponding tracts are highlighted on the map.\n8. Without clicking anywhere within the table or map (will alter the selection), close the Attribute Table.\nExport to a new file\nWe will now export the selected tracts to a new data layer so that we can more easily visualize which tracts have\nhigh unemployment. Exporting a smaller area of data is the easiest way to subset a dataset to only the desired\nrecords or keep your file sizes smaller and more manageable.\n1. Right click the unemployment layer in the table of contents > Export > Save Selected Features As...\n2. Make the Format ESRI Shapefile. Click the ... next to the File name box and navigate to your folder.\nName the file \"Unemp_ratehigh\" in your folder. Keep the CRS (EPSG,4269, NAD83). Click OK.\nNote: file names and locations can be very important when working on projects. GIS software tends to generate\nmany files, so you want to make sure to use file names that are descriptive and easy to remember.\n3. Clear the selected features by clicking the \"Deselect features from all layers\" icon in the top menu.\n4. Now try turning on/off this new layer and the original unemployment data. What do you notice?\n5. Save your map document to your working folder on your local drive using the Save icon.\nSo far you have learned how to open and navigate the software, use plugins to add a basemap, find, download,\nand add data, explore and select from the attribute table based on information in the metadata, perform a\nselection, and export your new dataset. You have completed many parts of getting started in a GIS and are half\nway through the exercise. Feel free to take a short break before continuing on to symbolization, decision\nmaking, and creating and exporting your final map.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\nSymbolize data\nChange a single symbol\nRather than completely covering the unemployment polygon layer with the one for high unemployment, we can\nchange the symbology of the high unemployment layer so that we can still see the tracts for the entire county\nunderneath.\n1. In the table of contents, double click the high unemployment layer (Unemp_ratehigh) name.\n2. Click on the Symbology tab\n3. Click on the words, \"Simple fill\" to bring up the options.\n4. In Fill Style, change the Simple fill style to a pattern, such as Diagonal X. That way we can still see the\nunemployment tract data layer underneath.\n5. Adjust the color (using the drop down menu in the 'Fill' box) and click OK when done.\nNote: Your help screen may look slightly different depending your version of QGIS.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\nExplore data distribution\nBefore we make a choropleth map of the unemployment rate, we need to examine our data in order to create\nthe most appropriate map. A quick way to explore the distribution of our data in QGIS is to make a graph.\n1. Double Click hudson_tracts_unemp_2017 in the Layers Panel.\n2. Choose Symbology from the left column.\n3. Select Graduated from the top dropdown menu.\n4. Choose Unemp_rate as your Value/Column.\n5. Select a color ramp of your choosing.\n6. Click Classify to load that field's values.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\n7. Now select the Histogram tab (next to Classes). Click on Load values and see how the frequency of\ndifferent values are being symbolized based on the method, number of classes, & color ramp.\nWe see that unemployment rate is relatively low, but that there are some outliers with a high employment rate.\nMake a choropleth map\n1. Symbolize the data in whatever way you think is best. Map symbology can be used to alter the way\npeople view and understand information, just like statistics. It is important to understand what you want\nto express in your map and think carefully about how best to symbolize your data. Note: you can click\napply when finished instead of OK to test options, without leaving the Layer Properties window.\na. Pick a color ramp from the drop down menu.\nb. Choose the mode and number of classes (options below the classes box)\nc. Here is brief information about some of the available classification methods. For a more in\ndepth analysis check out our mini-tutorial on choropleth mapping.\ni. Equal Interval: classes are all the same size.\nii. Quantile - number of values in each class is the same. If there are 100 values and we\nwant 4 classes, quantile method will make it such that each class will have 25 values.\niii. Natural Breaks (Jenks) - algorithm finds natural groupings of data to create classes. It\nmaximizes the variance between individual classes and min. variance within each class.\niv. Standard Deviation - creates classes based on standard deviations from the mean.\nv. Pretty Breaks - This is based on the statistical package R's pretty algorithm. It is a bit\ncomplex, but the pretty in the name means it creates classes with round numbers.\nd.\nTo reduce the number of decimals shown in the legend, use the Precision options in the upper\nright part of the Symbology window.\n2. Click Ok when you are finished.\n3. Save your map document.\nDo you have an idea about where you might build based on the unemployment rate?\nObviously many factors go into selecting a building site. We will examine one more: train access.\nFind tracts that have railroad stations\nYou will use the Spatial Query tool to select all tracts that contain a railroad station.\n1. From the top menu, click Vector > Research Tools > Select by Location.\n2. Select features from the hudson_tracts_unemp_2017 data layer, where the features \"contain\" features\nfrom the Railroad_Stations_in_NJ.\n3. Click Run > then Close.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\nNow all tracts that contain a railroad station are highlighted. Based where there is high unemployment (1.5\ntimes the national unemployment rate, use 'Unemp_ratehigh' layer) and access to transportation, where might\nyou want to build?\nRemember you can repeat the process of exporting your selection to its own layer, which you can symbolize in\nsuch a way (e.g. hollow with dots) that it can be seen alongside other layers. You may also want to turn off\nrailroad lines and stations once you have performed the prior steps.\nOnce you have finished this step, clear the selection.\nChoose a tract for building\n1. Click the selection button at the top of the screen and click on the tract that you want to build in, based\non the visualization you have made. You can select more than one tract by holding down the Ctrl button.\n2. Save the selected feature(s) using the same method you used above so that you know which location(s)\nyou selected to build on.\n3. Clear the selection once you have exported the layer.\n4. Wondering what area was actually chosen for this building? Add Bay_street_building from\nData\\Final_Exercise. You may need to double click on the point symbol and adjust the size to see it.\nRead the article here.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\n5. Make final changes to the color of any of the data layers.\nLayout and export your map\n1. In QGIS, you can create a map to export and print in the Map Layout.\na. On the main toolbar menu at the top of QGIS click Project > Layout Manager.\nb. In the Layout manager window, click Create... and name your new layout something like \"New\nJersey Building Tract\".\nc. Click OK.\n2. A new window will open where you can work on the layout your map. If you close the new layout, you\ncan re-open it by clicking Project > Layouts, and choosing your layout from the list.\nThe menus on the left of the layout window are tools that help you move around and add things to your\nmap. The menus across the top are tools that allow you to save and export, zoom in and out and more.\nHover over the symbols to read what they do.\n3. On the left-hand menu, click on the Add Map icon.\n4. Click and drag a box on the blank page. Your map will appear in the box you've drawn. You can click and\ndrag the map around and resize it to make the margins work the way you want.\n5. Use the select/move item icon to select and move your map around on the page.\n6. Use the move item content icon to adjust the placement of your map.\n7. Right click the map itself > Page Properties to test switching between portrait or landscape orientation.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\n8. Use the Add Label button and click on the page to add a title box.\n9. On the right side of the Layout window, click on the Item properties tab and type your title in the Main\nProperties box. Change font (click right dropdown arrow), margins, position, size and background the\nway you think it should be.\n10. Insert a legend using the Insert legend button, then click and drag a box for the legend placement. Use\nthe Item properties tab to modify your legend.\n11. Insert a scale bar and/or North arrow (click once to start line, again to end it, & right click to finish).\nNote these are the least important features you need to add so do not pick distracting formats.\n12. Use again the Add New Label icon to create a text box for your name, date, and sources for your data. If\nyou do not like the default settings for any item, use the item properties to edit its display.\n13. Save your layout.\nExport your map\n1. In the top menu go to Layout > and look at the different export options:\nExport as Image, Export as SVG..., Export as PDF... You can also use the icons to save your map in any of\nthese ways. Note: if you save as a JPEG or TIFF, you can adjust the resolution of the file.\nIf you receive a \"Project Contains WMS Layers\" warning, this means that the owner of the basemap\nwon't allow large areas to be exported. Our area is small enough to ignore this warning so feel free to\nhave your basemap on when exporting (you can move layout view to the side to edit what layers are on\nin original data view window).\n2. Save your exported map.\n3. Click close (if needed after export).\n4. Open your map to see what it looks like.\n5. Close the Layout window & then the Layout Manager window\nSave your QGIS document\n1. Click the Save icon.\nNote that when you save a QGIS document, you are only saving the links to the layers in your project and how\nyou have symbolized them, not the actual datasets. If you move your project to a new location, you will need to\nMIT Libraries, GIS Services, Updated 1/6/2022\n\nmove all the files linked to your project. Note: also keep in mind that each shapefile has multiple files associated\nwith it, and they need to stay together to work properly.\nBy default, QGIS stores the full path name to each layer in the QGIS document. This means that if you move your\nfiles around, your path name will change and you will need to redirect QGIS to the new file location for each\nfolder of data. If you will be moving files around, it is recommended that you save a relative path to the data\nfiles in your project. QGIS does this by default.\n2. To be sure the default is set that way, go to Project > Properties.\n3. Click on the General tab.\n4. Check that the dropdown menu next to Save paths is set to relative, not absolute. Click OK to close the\nwindow.\nCongratulations!\n1. You should now be familiar with the following:\n2. Opening a QGIS Desktop Project\n3. Adding basemaps & data\n4. Exploring attribute tables\n5. Selecting & exporting data\n6. Symbolizing data\n7. Performing selections & analyses\n8. Exporting & Saving a map\nFor more information, check out the QGIS Documentation.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nRES.STR-001 Geographic Information System (GIS) Tutorial\nIAP 2022\nFor information about citing these materials or our Terms of Use, visit:\nhttps://ocw.mit.edu/terms\nMIT Libraries, GIS Services, Updated 1/6/2022"
    },
    {
      "category": "Resource",
      "title": "GIS Level 2 ArcGIS Pro Take-Home Exercises (PDF)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-str-001-geographic-information-system-gis-tutorial-january-iap-2022/mitres_str001iap22_level2_arcgispro_takehome2.pdf",
      "content": "GIS Level 2\nIn the Introduction to GIS workshop we filtered data and visually examined it to determine where to\npotentially build a new mixed-use facility. In order to get a low interest loan, the building needs to be\nlocated in an area with high unemployment. You also want to consider access to public transportation\n(for people who may be living at the building and commuting to the city or commuting to the building\nfor work) and the terrain of the area.\nIn this exercise we will learn how to use the analysis tools in ArcGIS Pro with vector and raster data to\nfurther examine potential building sites.\nUse Spatial Autocorrelation to Determine Areas of High Unemployment\nChange a projection\nBecause spatial autocorrelation uses distance among features as part of the calculation, we will first\nconvert the census data from a geographic coordinate system to one that is projected.\n1. Open ArcGIS Pro and select the Map option and create a new project.\n2. Click the Map tab and use the Add Data button to add Hudson_tracts_unemp_2017 (the\nunemployment rate by census tract) from the folder Data\\Final Exercise.\n3. Right click on the name of the data layer and select Properties > Source > Spatial Reference. We\ncan see that the coordinate system is NAD 1983 and the unit is a Degree so we'll want to change\nthis to a projected coordinate system that uses a linear unit like meters.\n4. Open the Geoprocessing pane if it is not already open (View > Geoprocessing).\n5. Search for the project tool. Click the Project tool that is part of the Data Management Tools.\n6. Complete the information specified below.\na. Input: Hudson_tracts_unemp_2017\nb. Output: Save the output dataset to your working folder.\nc. Output Coordinate System: Click the button to the right of the text box and search for\n'new jersey' as shown.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\nd. We could choose from any number of map projections. Expand the folders: Projected\nCoordinate Systems > State Plane > NAD 1983 (US Feet). Select the NAD 1983\nStatePlane New Jersey FIPS 2900 (US Feet) projection. Since it is specific for New Jersey,\ndistance will be fairly accurate in this area.\n7. Click OK to close the Coordinate System box and then Run. The new data layer should be\nautomatically added to your map. It will look identical to the old layer but have a different\ninternal projection. ArcMap automatically aligns data with different projections.\n8. Remove the original data layer.\nSpatial Autocorrelation\nSpatial Autocorrelation is a statistical technique that identifies clusters of low or high values by\ncomparing the value of each feature to that of its neighbors.\n1. Click the back arrow to return to the Geoprocessing search box. Search for the Cluster and\nOutlier Analysis tool. Open it.\n2. Fill in the information as below:\na. Input: projected unemployment data layer\nb. Input Field: Unemp_rate\nc. Output: working folder\nd. Conceptualization: Inverse Distance (assumes that closer features are more influential\nthan ones further away)\ne. Distance method: Euclidean\nf.\nStandardization: Row\n3. Click Run.\n4. After you run the tool you should see results similar to these. You may also see a warning that\ntells you the distance used to define neighborhoods. To make the map look less distorted, right\nclick on Map in the Contents pane and select Properties > Coordinate Systems. Scroll up and\nexpand Layers and select the NJ state plane coordinate system. Click Ok.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\n_____________________________________________________________________________________\n_____________________________________________________________________________________\n_____________________________________________________________________________________\n5. Look at the legend in the Contents pane.\na. Where is there statistically significant clustering of high unemployment? Low\nunemployment?\nb. Is this what you expect based on the original data? You can change the symbology in the\nProperties menu of this layer to visualize the unemployment rate.\n6. Save your project using the save icon in the upper left.\nBased on this information, where might you build?\nExamine proximity to transportation\nMake a Multiple Ring Buffer\nIn this part of the exercise, you will be looking at proximity to the PATH station on the line that runs to\nthe World Trade Center in Manhattan.\n1. Turn off all the data layers.\n2. Add the following data layers from Data\\Final Exercise:\na. PathStation\nb. Streets\n3. Notice the point that shows where the PATH station is. Feel free to change the color or make it\nlarger so it is easier to see. The street network is also on the map.\n4. Search for and open the Multiple Ring Buffer tool in the Geoprocessing pane.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\n5. Enter the information specified below. Notice the 5280, 10560, 15840, and 21120 values are 1,\n2, 3, and 4 miles as the path station is projected in a New Jersey State Plane projection in feet.\nClick Run.\n6. Click on the new layer to highlight it in the Contents pane once it is added to the map. Click the\nAppearance tab at the top of the screen and move the transparency slider in the Effects group\nto about 50%.\nApproximately how much of Jersey City are within 1 miles of the station? 3 miles? Is this an accurate\nrepresentation of distance from the Path Station?\n7. Turn off the street data to better see what is within each of the distance rings.\nYou can use the Network Analyst tools in ArcGIS Pro to create buffers (called service areas) based on a\nroad or other networks to increase the accuracy of your estimates. This tools will take into account the\nroads you will need to travel on to get from one place to another. To save time we won't do that as part\nof this exercise, but you can learn more here:\nMIT Libraries, GIS Services, Updated 1/6/2022\n\n_____________________________________________________________________________________\n_____________________________________________________________________________________\nhttps://pro.arcgis.com/en/pro-app/tool-reference/ready-to-use/itemdesc-generate-service-areas.htm\nhttps://pro.arcgis.com/en/pro-app/help/analysis/networks/service-area-tutorial.htm\n8. We previously created a service are for you. Add the network_buffer data layer to your map.\n9. To show the different service area distances, we'll change the symbology. Right click on the\nnetwork_buffer layer name and select Symbology.\n10. Choose Unique Values from the dropdown menu.\n11. In the Field 1 drop down menu, select ToBreak, which indicates the furthest distance covered by\nthe service area.\n12. Click the Color scheme drop down menu and select a color scheme.\nHow do the buffer and service area differ? If you wanted this new building to be close to the train\nstation, where might you choose to build?\nExamine Terrain\nAdd Raster Data\nYou have now explored some of the tools available for analysis of vector data. Now let's explore what\ncan be done with different types of the raster data.\nThis section will use elevation data which is developed from satellite imagery. If you are interested in\nlearning more about satellite imagery and image processing see the Introduction to Satellite Remote\nSensing Workshop.\nProject Raster\nBefore performing analyses it's always a good idea to make sure the data is in a projected coordinate\nsystem if it may be necessary to use the tools.\n1. Add Elevation from the Final Exercise folder. It may take a minute to load. Elevation represents\nelevation from the ASTER sensor aboard the Terra satellite. Turn off any data layers that you do\nnot need.\n2. Go back to the Geoprocessing search pane and find the tool \"Project Raster\".\n3. Use the Elevation layer as your Input Raster.\n4. Save the output raster to your working folder using an intuitive name. In many cases rasters\nneed names that are 13 characters or less when working in Pro.\n5. From the Output Coordinate System dropdown menu, select the projected unemployment data\nto convert the raster to the same projection. Click Run.\n6. Remove the old elevation data from the map.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\nExtract by Mask (aka clip raster)\nBackground Information:\nWhoever named this tool, decided against \"clip for raster\" which arguably would have been more\nintuitive to the majority of people. Alas, the name \"extract by mask\" while less intuitive, draws upon\nimage processing terminology and also hints at an interesting underlying process taking place. As you\nwould have learned in Introduction to GIS, vectors and rasters have some key differences. Vectors have\ndefined coordinate boundaries, while rasters use cell values in a grid of rows and columns. When you\nclip a vector, you are in a way moving the coordinates to new locations. However, when you try to clip a\nraster it must remain as a rectangular grid. To have it appear as though you have \"clipped\" out certain\nsections, \"extract by mask\" replaces pixels/cells that fall outside the boundary used (aka \"mask\") with\nNoData values, visualized using NoColor and therefore making the raster appear clipped. To check that\nthis is the case after running the tool, click on a pixel and see its values.\n1. Right click the projected elevation raster and select Zoom to Layer to see its full extent. As you\ncan see, satellite imagery is often provided at large scales, which can be reduced to be easier to\nwork with.\n2. Search for and open the \"Extract by Mask\" tool.\n3. We will use the tracts as the mask, so input the following:\na. Input raster: projected elevation raster\nb. Input raster or feature mask data: projected Hudson unemployment tracts\nc. Output raster: Save your output raster to your folder using an intuitive name.\n4. Click Run. The resulting layer has been masked so that all pixels outside the tracts have no value\nand those inside are symbolized with a black and white color ramp stretched from the min to\nmax values.\nCreate Contour Lines\nContour abstracts a digital elevation surface into lines representing different elevations. Lines can be\neasier to overlay on top of other datasets without covering them up as a raster surface would. They can\nalso help clarify visual trends in a way that a surface can be difficult to observe.\n1. Search for and open the Contour (Spatial Analyst) tool.\n2. Use the following inputs:\na. Input raster: the clipped/masked elevation\nb. Output feature class: Save with an appropriate name. (e.g. elev_contours_15ft)\nc. Contour interval: Start with 15ft (the unit is based on the projection of the layer).\n3. Click Run.\n4. If you want, try a few other values for your contours, remembering to save names appropriately.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\n_____________________________________________________________________________________\n_____________________________________________________________________________________\n_____________________________________________________________________________________\nWhile you can build in any location, flatter areas may be easier to access for people who are walking.\nAlso keep in mind that areas of low elevation that are close to water may be more prone to flooding.\nLooking at the original elevation data and contour lines, what areas may you want to build in?\nSelect an area in which to build and add a point\nUsing all the information you gathered with the processing tools, select an area (or areas) that could be\npotential building sites. You will add a point (or points) to represent these areas.\n1. Open the ArcCatalog pane (View > Catalog Pane).\n2. Navigate to your working folder in the Folders menu of ArcCatalog. If you don't see the folder,\nright click on Folders and select Add Folder Connection. Navigate to the main folder containing\nyour output data.\n3. Right click on your work folder > New > Shapefile.\na. Feature Class Name: Choose a name for your new shapefile.\nb. Geometry type: point.\nc. Coordinate System: From the dropdown choose the projected unemployment layer so\nthat the coordinate system will be the same as the other layers in our map\nd. Click Run.\nThere are currently no features in the layer. Accordingly, the attribute table of your point layer is blank,\nwith the exception of a few fields that ArcGIS adds by default and generates automatically for features.\nWe're going to create features for this layer.\n1. Click on the new building layer in the Contents pane so it is selected.\n2. In the Edit tab at the top of the screen, select the Create tool in the Features group.\n3. Click the building layer and select the Point tool.\nEach time you click on a location on the map, it will add a point.\n4. Add your point(s).\nMIT Libraries, GIS Services, Updated 1/6/2022\n\n5. When you are finished, click the Finish button at the bottom of the map.\n6. Close the Create Features pane.\nAn actual building was built at 65 Bay Street. Add the data layer, \"Bay_street_building\" from the Final\nExercise folder. Is there where you chose to build?\nThere are a lot of factors we did not consider, such as available lots, cost of building, etc., which went\ninto choosing the Bay street building site. However, it was also deemed an area of high unemployment\nby selectively showing data from nearby census tracts. You can read more here.\nResources for learning more\nSpatial Statistics: https://pro.arcgis.com/en/pro-app/tool-reference/spatial-statistics/an-overview-of\nthe-spatial-statistics-toolbox.htm\nNetwork Analyst: https://pro.arcgis.com/en/pro-app/tool-reference/network-analyst/an-overview-of\nthe-network-analyst-toolbox.htm\nSpatial Analyst: https://pro.arcgis.com/en/pro-app/tool-reference/spatial-analyst/an-overview-of-the\nspatial-analyst-toolbox.htm\nMIT Libraries, GIS Services, Updated 1/6/2022\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nRES.STR-001 Geographic Information System (GIS) Tutorial\nIAP 2022\nFor information about citing these materials or our Terms of Use, visit:\nhttps://ocw.mit.edu/terms\nMIT Libraries, GIS Services, Updated 1/6/2022"
    },
    {
      "category": "Resource",
      "title": "GIS Level 2 ArcGIS Pro Workshop Exercises (PDF)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-str-001-geographic-information-system-gis-tutorial-january-iap-2022/mitres_str001iap22_level2_arcgispro.pdf",
      "content": "GIS Level 2: ArcGIS Pro Workshop Exercises\nExercise 1: Map projections\nMap projections, also called Coordinate Reference Systems (CRS) can be viewed or changed using GIS\nsoftware.\n1. Examine the data in GIS_Level2_Data\\workshop_exercise. Is there a projection file for each\ndataset?\nNote that cambridge_dem is a raster dataset and uses a .tfw file (known as a \"world\" file), which\ncontains the information needed to transform image coordinates to real-world coordinates.\nShapefiles use a .prj file, which includes the coordinate system information.\n2. Open ArcPro. Click the Map option under Blank Templates and save it to your working folder.\n3. Add the following two data layers from GIS_Level2_Data\\workshop_exercise\na. MBTAbusroutes\nb. CambridgePlaygrounds\n4. Right click on CambridgePlaygrounds and select Zoom to Layer.\nDo the playgrounds and bus routes seem to be in the correct locations?\nThey should be since both layers had a defined projection (.prj) file.\n5. Right click on CambridgePlaygrounds and select Properties.\n6. Select the Source tab and expand Spatial Reference.\nWhat is the coordinate reference system?\nThere are two, a projected coordinate system of NAD83 / Massachusetts Mainland (ftUS) and a\ngeographic coordinate system of NAD 1983.\n7. Do the same for the MBTAbusroutes data layer. What is the coordinate reference system?\n8. Close the Properties box and select the Analysis tab and Tools.\n9. Search for Project and open Project (Data Management Tools).\nWe will use the Project tool to change the projection of the playgrounds so that it is the same as\nthat of the bus routes. There is also a tool called Define Projection that is used to assign a\nprojection to a data layer that does not already have one or has one that is incorrect. Our map\nprojections appear to be correct so we do not need to use this tool.\nAlthough not always required, your analysis results may be more accurate if your data layers are\nin the same projection. If you want to calculate the proximity of playgrounds to bus routes, you\nwould first want to make sure the projections of both data layers are the same.\n10. Choose playgrounds as the Input Dataset.\na. Save your output dataset in your working folder.\n\nb. Click the Output Coordinate System dropdown menu and select MBTAbusroutes. ArcGIS\nPro will automatically fill in the coordinate system of\nNAD_1983_StatePlane_Massachusetts_Mainland_FIPS_2001.\nc. Click Run.\n11. Add the data layer to your map if it was not added automatically.\nExercise 2: Access basic analysis tools\nTools can be accessed in a variety of ways in ArcGIS Pro:\n-\nA subset of tools are located on the Analysis tab.\n-\nSome tools are available by right clicking a layer.\n-\nClick (Analysis > Toolbox) or (View > Geoprocessing) to see all available tools. You can search for\na tool by name or click the Toolboxes tab and open a specific toolbox. This is a good way to see\nthe different types of tools available to you.\n1. Add MBTA_NODE to the map from GIS_Level2_Data\\workshop_exercise.\n2. Click View > Geoprocessing and search for the buffer tool.\n3. Open Buffer (Analysis Tools).\nHow do you know what each input and parameter should be or if you need it? Try clicking the question\nmark to learn more about this tool and its parameters.\n4. Select the MBTA_NODE as your Input Features from the dropdown menu. Choose a location to\nsave your buffers in the Output Feature Class box.\n5. Enter a Distance of 1000 meters and Run the tool.\n6. Turn off your buffers after you have looked at the layer.\nThe interface for all tools looks similar in ArcGIS Pro, with most requiring input data, an output location,\nrequired parameters, and optional parameters.\nExercise 3: Use raster tools\nDifferent tools can be used with raster data versus vector data, although the output could be a vector,\nraster, or table, depending on the tools. There are also tools that allow you to convert from one data\ntype to another.\n1. Add the cambridge_dem.tif to your map. It may take a minute to load.\n2. We will start by changing the symbology so it is easier to see, which you may remember from\nGIS Level 1.\na. Right click on the cambridge_dem and select Symbology.\nb. Change the Primary Symbology dropdown to Stretch.\n\nc. Close the Symbology window when you are finished.\n3. Open the Geoprocessing window if it is not already. Search for contour. Open Contour (Spatial\nAnalyst Tools).\n4. Select the dem as your Input raster and choose an output location.\n5. Type 5 for the Contour interval. What are the units of this interval? How might you figure it out?\n6. Click Run.\nYou will notice that the output is a vector line layer, which could then be exported to other\nprograms or used as input for vector analysis tools.\nExercise 4: Use the spatial statistics toolbox\nAs mentioned above, toolboxes can be a good way to learn about the variety of tools available to you\nand to also find tools that are similar to others.\n1. Add the file median_income_suffolk_ma to the map.\n2. Click View > Geoprocessing to open the Geoprocessing window.\n3. Click the Toolboxes tab and expand Spatial Statistics Tools > Mapping Clusters. Open Cluster and\nOutlier Analysis (Anselin Local Moran's I).\n4. Choose median_income as the Input Feature Class. Use VALUE0 as the Input Field, which is the\nmedian income value. See the text file in the workshop_exercise folder for the attribute field\ninformation.\n5. Choose an output name and location.\n6. Leave the default values for now. In the future you have the option of changing the parameters\nto define neighborhoods in different ways. Run the tool.\n7. At the bottom of the tool window, a box indicates that the tool ran with warning. Click the View\nDetails link to read more about this. The warning indicates that the tool used a value of 2266\nmeters to define the neighborhood, which is determined to be optimal for our data based on\nthe inverse distance relationship. Close the Detail window.\n8. Where are there clusters of high and low income? The tool has also output a histogram and\nscatterplot that you can examine by double clicking on them. Turn off the income data layers\nwhen you are finished examining them.\nThe Moran scatter plot provides a classification of spatial association into four categories, corresponding\nto the location of the points in the four quadrants of the plot. These categories are referred to as High-\nHigh, Low-Low, Low-High and High-Low, relative to the mean, which is the center of the graph.\nYou can learn more about the statistics used in the Moran's I calculation here:\nhttps://pro.arcgis.com/en/pro-app/tool-reference/spatial-statistics/h-how-cluster-and-outlier-analysis\nanselin-local-m.htm\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nRES.STR-001 Geographic Information System (GIS) Tutorial\nIAP 2022\nFor information about citing these materials or our Terms of Use, visit:\nhttps://ocw.mit.edu/terms"
    },
    {
      "category": "Resource",
      "title": "GIS Level 2 Instructions (PDF)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-str-001-geographic-information-system-gis-tutorial-january-iap-2022/mitres_str001iap22_level2_instructions.pdf",
      "content": "GIS Level 2 Setup Instructions\nThank you for registering for GIS Level 2. Before the workshop, please do the following:\n1. Download and install either ArcGIS Pro or QGIS & Geoda\n2. Install 7-zip if necessary.\n3. Download all workshop materials.\n4. Update and setup Zoom. (Your version of Zoom MUST be up-to-date in order to use the\nbreakout rooms effectively.)\nDownload and install ArcGIS Pro or QGIS & Geoda\nQGIS is a free, open source software program that will work on any operating system and doesn't take\nup much space on your computer. While it has many of the same capabilities as ArcGIS Pro, there are\nsome analyses you can't do in QGIS and it tends to have more bugs. QGIS has limited tools for spatial\nstatistical analysis, so you can use another free, open source program, Geoda, along with it.\nArcGIS Pro is a commercial software from ESRI that we have a subscription for at MIT. It only runs on\nWindows and requires an account or a connection to the MIT license server to run. It includes a full\nsuite of GIS tools, but may not run well if you have a slower computer.\nIf you are not sure which software to use, this website has a lot of additional information:\nhttps://gisgeography.com/qgis-arcgis-differences/\nNote: This workshop will NOT use ArcGIS Desktop/ArcMap, only ArcGIS Pro, the newest GIS software\nfrom ESRI.\nArcGIS Pro installation\n1. Create an ArcGIS Online (AGOL) account: https://libguides.mit.edu/gis/webmap#s-lg-box-wrapper\n2. If you have not already downloaded Pro, log into your AGOL account. From your account page, click\nyour name in the upper right and select My settings > Licenses and click download next to ArcGIS Pro.\n3. After installing Pro, choose the Named User License type and select ArcGIS Online. You'll then see the\nsame login screen that you used to create your account.\nQGIS Installation\nFull instructions and links for installing QGIS for a number of different operating systems can be found\nhere: http://qgis.org/en/site/forusers/download.html\nDownload the most recent version of the software. Windows users should download the Standalone\noption. If you already have QGIS installed, we have tested the workshop exercises with versions 3.16\nand higher so we recommend upgrading if you are using an older version.\nGeoda Installation (install if using QGIS for the workshop)\n\nDownload links for a variety of operating systems are listed here:\nhttps://geodacenter.github.io/download.html\n7-zip installation\nWorkshop files (and most GIS data) are in zipped folders. Most Windows computers have the option to\nextract data by right clicking and most Macs will automatically extract data. Occasionally your computer\nmay not have a built-in data extraction tool. In this case we recommend installing 7-zip: https://www.7\nzip.org/\nWorkshop materials\nDownload all workshop materials.\nMaterials include the presentation, workshop exercises, take-home exercise, and all required data.\nZoom setup\n1. Make sure your Zoom app is up-to-date using these instructions:\nhttps://support.zoom.us/hc/en-us/articles/201362233-Upgrade-update-to-the-latest-version\n2. If you have access to a second monitor (or a second \"smart\" device that can connect to a Zoom\nsession) it may greatly improve your workshop experience and make it easier to follow the\ninstructor and complete the exercises simultaneously. If not, it is still doable, for example, by\norganizing your screen in this way:\nhttps://raw.githubusercontent.com/hbctraining/bioinformatics_online/master/guidelines/img/S\ncreenshot%202020-03-23%2015.21.10.png\n3. We encourage participation during the session and kindly ask you to use your video, if possible.\n4. Mute audio except when talking (Tip: you can temporarily unmute yourself by pressing and\nholding a space bar. When it is released, Zoom goes back to the mute mode).\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nRES.STR-001 Geographic Information System (GIS) Tutorial\nIAP 2022\nFor information about citing these materials or our Terms of Use, visit:\nhttps://ocw.mit.edu/terms"
    },
    {
      "category": "Resource",
      "title": "GIS Level 2 QGIS Take-Home Exercises (PDF)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-str-001-geographic-information-system-gis-tutorial-january-iap-2022/mitres_str001iap22_level2_qgis_takehome.pdf",
      "content": "GIS Level 2\nIn the Introduction to GIS workshop we filtered data and visually examined it to determine where to\npotentially build a new mixed use facility. In order to get a low interest loan, the building needs to be\nlocated in an area with high unemployment. You also want to consider access to public transportation\n(for people who may be living at the building and commuting to the city or commuting to the building\nfor work) and the terrain of the area.\nIn this exercise we will learn how to use the analysis tools in QGIS & Geoda with vector and raster data\nto further examine potential building sites.\nUse Spatial Autocorrelation to Determine Areas of High Unemployment\nChange a projection\nBecause spatial autocorrelation uses distance among features as part of the calculation, we will first\nconvert the census data from a geographic coordinate system to one that is projected.\n1. Open QGIS.\n2. Click the Data Source Manager button.\n3. Select the Vector tab.\n4. Click the ... next to the Vector Dataset(s) box and select Hudson_tracts_unemp_2017.shp (the\nunemployment rate by census tract) from the folder Data\\Final Exercise.\n5. Click Add. Press OK when the Select Transformation box appears. This will change the map\nprojection of our project so that data look less distorted, but will not change the projection of\nour data.\n6. Right click on the name of the data layer and select Properties > Information. We can see that\nthe coordinate reference system is NAD83 which uses Lat/Long as units so we'll want to change\nthis to a projected coordinate system that uses a linear unit like meters. Close the Properties\nbox.\n7. Right click on the name of the data layer and select Export > Save Features As.\na. Select ESRI Shapefile as the Format.\nb. Click the coordinate reference system button next to the CRS dropdown menu.\nc. Search for 3424 in the Filter box, which is the code given to the coordinate system we\nwant to use. Results will appear in the Projected Coordinate Reference Systems box.\nSelect NAD83/New Jersey (ftUS) EPSG:3424. Click Ok.\nd. Click ... next to the File name box and select a location in which to save the data and\nname the file. Click Ok.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\ne. Depending on your version of QGIS, a box may appear in which you can choose from\nvarious mathematical methods for transforming the data. Keep the first method\nselected and click OK. Ignore this step if you do not see this box.\n8. The transformed data will now be added to your map. It will look identical to the old layer but\nhave a different internal projection. QGIS automatically aligns data with different projections.\n9. Remove the original data layer and save your QGIS project (Project > Save).\nMIT Libraries, GIS Services, Updated 1/6/2022\n\nSpatial Autocorrelation\nSpatial Autocorrelation is a statistical technique that identifies clusters of low or high values by\ncomparing the value of each feature to that of its neighbors. QGIS does not extensive spatial statistics\ntools so we will use the free program, Geoda. You can learn more about Geoda here:\nhttps://geodacenter.github.io/documentation.html\n1. Open Geoda.\n2. In the Input file box, click the folder icon and select ESRI shapefile. Select the projected\nunemployment file that you just saved in QGIS. Your file will open in the map viewer.\n3. You first need to specify how you will define neighbors. Click the W icon in the toolbar (Weights\nManager) and Create.\n4. Specify the following:\na. Weights File ID Variable: GEOID (this is any ID that uniquely identifies each polygon)\nb. Rook contiguity (rook shares borders, queen shares borders and vertices/corners)\nc. Keep the defaults for the other options.\nd. Click Create and save your weights file in your project folder. Close the Weights File\nCreation box and the Weights Manager. The file you just created is automatically\nloaded.\n5. Select Space > Univariate Local Moran's I.\n6. Choose Unemp_rate as the variable. The weights file you just created should be chosen in the\nWeighs dropdown box. Click OK.\n7. Check off the significance map and cluster map and click Ok. The maps show the different types\nof clusters and their significance.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\n8. Right click on the cluster map image and select Save Results. Click OK. This will save the cluster\ninformation to the attribute table.\n9. At the top of the screen, click File > Save As. Click the folder icon and select ESRI Shapefile. Save\nthe file to your project folder so we can load it in QGIS. Click OK.\n10. Close Geoda.\nVisualize the Clusters in QGIS\n1. In QGIS add the cluster shapefile to your map.\n2. Right click on this file and select Open Attribute Table.\n3. Scroll to the right and see the new columns that were added by Geoda. LISA_CL can be used to\nvisualize clusters. See the Geoda website for information about what each code means:\nhttps://geodacenter.github.io/workbook/6a_local_auto/lab6a.html#saving-the-local-moran\nstatistics\n4. Close the Attribute Table. Right click on the layer and select Properties > Symbology.\n5. Select Categorized from the dropdown menu at the top of the window.\n6. Choose LISA_CL from the Value dropdown menu.\n7. Click the Classify button and all the values from the table will appear.\n8. Double click on each number in the Legend column to name it based on the codes from the\nGeoda website (0 for non-significant, 1 for high-high, 2 for low-low, 3 for low-high, and 4 for\nhigh-low).\n9. Double click on the color in the symbol column to choose colors for each category that make\nsense to you. Click OK when you are finished.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\n_____________________________________________________________________________________\n_____________________________________________________________________________________\n_____________________________________________________________________________________\n10. Look at the legend in the Contents pane. Where is there statistically significant clustering of high\nunemployment? Low unemployment?\nBased on this information, where might you build?\nExamine proximity to transportation\nMake a Multiple Ring Buffer\nIn this part of the exercise, you will be looking at proximity to the PATH station on the line that runs to\nthe World Trade Center in Manhattan.\n1. Turn off all the data layers.\n2. Add the following data layers from Data\\Final Exercise:\na. PathStation\nb. Streets\n3. Notice the point that shows where the PATH station is. Feel free to change the color or make it\nlarger so it is easier to see. The street network is also on the map.\n4. Add the multi ring buffer tool by clicking Plugins > Manage and Install Plugins and searching for\nMulti Ring Buffer. Select it and click Install Plugin. Close the window. Because QGIS is an open\nsource program, various people create tools, which can be added from this plugin menu.\n5. Click Vector > Multi Ring Buffer to open the tool.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\n6. Enter the information specified below. Notice the 5280 is equal to 1 mile in feet as the path\nstation is projected in a New Jersey State Plane projection in feet. Click OK.\n7. Note that the resulting layer is temporary until you right click and select Make Permanent. If you\nare continuing with this exercise you can leave it as temporary, but will want to save it if you\nplan to close QGIS and continue later.\n8. If your buffer looks a bit distorted you can change the coordinate reference system of the QGIS\nproject to that of the data layers.\na. Click Project > Properties and select the CRS tab.\nb. Select NAD83/New Jersey (ftUS) from the Recently Used Coordinate Reference Systems\nbox and click Ok.\nc. Close the Project Properties.\nThe project CRS changes how data look on the screen but does not change the coordinate\nsystem of the data itself.\n9. Right click on the new buffer layer and select Properties > Symbology. Expand Layer Renderings\nat the bottom of the box and move the Opacity slider to about 50%. Click OK.\n10. Add a basemap by clicking Web > QuickMapServices > OSM > OSM Standard. If you do not see\nthe Web menu, add the QuickMapServices plugin.\nApproximately how much of Jersey City are within 1 miles of the station? 3 miles? Is this an accurate\nrepresentation of distance from the Path Station?\n11. Turn off the street data to better see what is within each of the distance rings.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\n_____________________________________________________________________________________\n_____________________________________________________________________________________\nQGIS includes some basic network analysis tools. For more extensive options, we recommend using\nArcGIS Pro. You can create buffers (called service areas) based on a road or other network to increase\nthe accuracy of your estimates. That is, the service areas take into account the roads that you need to\ntravel on to get from one location to another. To save time we won't do that as part of this exercise, but\nyou can learn more here:\nhttps://docs.qgis.org/3.16/en/docs/training_manual/vector_analysis/network_analysis.html\nhttps://pro.arcgis.com/en/pro-app/tool-reference/ready-to-use/itemdesc-generate-service-areas.htm\nhttps://pro.arcgis.com/en/pro-app/help/analysis/networks/service-area-tutorial.htm\n12. We previously created a service are for you using ArcGIS Pro. Add the network_buffer data layer\nto your map from the Final Exercise folder.\n13. To show the different service area distances, we'll change the symbology. Right click on the\nnetwork_buffer layer name and select Properties > Symbology.\n14. Choose Categorized from the dropdown menu at the top of the box.\n15. In the Value drop down menu, select ToBreak, which indicates the furthest distance covered by\nthe service area.\n16. Click the Classify button at the bottom of the box to show the values.\n17. Click the Color ramp drop down menu and select a color scheme. Click Ok.\nHow do the buffer and service area differ? If you wanted this new building to be close to the train\nstation, where might you chose to build?\nExamine Terrain\nAdd Raster Data\nYou have explored some of the tools available for analysis of vector data. Now let's explore what can be\ndone with different types of the raster data.\nThis section will use elevation data which is developed from satellite imagery. If you are interested in\nlearning more about satellite imagery and image processing see the Introduction to Satellite Remote\nSensing Workshop.\nProject Raster\nBefore performing analyses it's always a good idea to make sure the data is in a projected coordinate\nsystems if it may be necessary to use the tools.\n1. Add Elevation.tif from the Final Exercise folder. Make sure to choose the Raster option in the\nData Source Manager. It may take a minute to load. Elevation represents elevation from the\nASTER sensor aboard the Terra satellite. Turn off any data layers that you do not need.\n2. Right click on the name of the data layer and select Export > Save As.\na. The CRS dropdown menu shows coordinate systems that we are currently using in our\nproject. Select one of the options for EPSG: 3424.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\nb. Click ... next to the File name box and select a location in which to save the data and a\nfile name.\nc. Keep the Format as GeoTIFF.\n3. Click OK.\n4. Remove the old elevation data from the map.\nClip Raster by Mask\nBackground Information:\nThe term Mask draws upon image processing terminology and also hints at an interesting underlying\nprocess taking place. As you learned in Introduction to GIS, vectors and rasters have some key\ndifferences. Vectors have defined coordinate boundaries, while rasters use cell values in a grid of rows\nand columns. When you clip a vector you are in a way moving the coordinates to new locations.\nHowever, when you try to clip a raster it must remain as a rectangular grid. To have it appear as though\nyou have \"clipped\" out certain sections, \"clip raster by mask\" replaces pixels/cells that fall outside the\nboundary used (aka \"mask\") with NoData values, visualized using NoColor and therefore making the\nraster appear clipped. To check that this is the case after running the tool, click on a pixel and see its\nvalues.\n1. Right click the projected elevation raster and select Zoom to Layer to see its full extent. As you\ncan see, satellite imagery is often provided at large scales, which can be reduced to be easier to\nwork with.\n2. Select Raster > Extraction > Clip Raster by Mask Layer.\n3. We will use the tracts as the mask, so input the following:\na. Input layer: projected elevation raster\nb. Mask layer: projected Hudson unemployment tracts\nc. Advanced parameters > Clipped (mask): Click the ... > Save to file and save your output\nraster to your folder using an intuitive name. (If you don't see these, scroll down.)\nd. Leave the defaults for all other options.\n4. Click Run. The resulting layer has been masked so that all pixels outside the tracts have no value\nand those inside are symbolized with a black and white color ramp stretched from the min to\nmax values (you will need to turn off the original layer to see this). Close the tool window.\nCreate Contour Lines\nContour abstracts a digital elevation surface into lines representing different elevations. Lines can be\neasier to overlay on top of other datasets without covering them up as a raster surface would. They can\nalso help clarify visual trends in a way that a surface can be difficult to observe.\n1. Select Raster > Extraction > Contour.\n2. Use the following inputs:\na. Input layer: the clipped/masked elevation\nb. Interval between contour lines: Start with 15ft (as mentioned previously, the unit is\nbased on the measurement setting for the project).\nc. Advanced parameters > Contours: Click ... > Save to file and save your output vector to\nyour folder. Choose SHP files as the type.\nMIT Libraries, GIS Services, Updated 1/6/2022\n\n_____________________________________________________________________________________\n_____________________________________________________________________________________\n_____________________________________________________________________________________\nd. Leave the defaults for everything else. Click Run. Close the tool window.\n3. If you want, try a few other values for your contours, remembering to save names appropriately.\nWhile you can build in any location, flatter areas may be easier to access for people who are walking.\nAlso keep in mind that areas of low elevation that are close to water may be more prone to flooding.\nLooking at the original elevation data and contour lines, in what areas may you want to build?\nSelect an area in which to build and add a point\nUsing all the information you gathered with the processing tools, select an area (or areas) that could be\npotential building sites. You will add a point (or points) to represent these areas.\n1. Click the New Shapefile Layer button.\na. Click the ... next to File Name and navigate to your working folder and choose a file\nname. Click Save.\nb. Geometry type: point.\nc. Additional dimensions: From the dropdown make sure a coordinate system with EPSG:\n3424 is selected.\nd. You have the options of adding fields/columns to your attribute table, but we won't do\nthis now. Click OK.\nThere are currently no features in the layer. Accordingly, the attribute table of your point layer is blank.\nWe're going to create features for this layer.\n1. Click on the empty building layer so it is selected in the Layers pane.\n2. Click the Toggle Editing icon (pencil).\n3. Click the Add Point Feature button.\n4. Click a location or locations on the map to add points. You will be asked to assign an ID number\nto each point as you add it. This can be any unique number.\n5. When you are finished, click the Save Layer Edits button.\n6. Turn off editing by clicking the Toggle Editing icon (pencil) again.\nAn actual building was built at 65 Bay Street. Add the data layer, \"Bay_street_building\" from the Final\nExercise folder. Is there where you chose to build?\nMIT Libraries, GIS Services, Updated 1/6/2022\n\nThere are a lot of factors we did not consider, such as available lots, cost of building, etc., which went\ninto choosing the Bay street building site. However, it was also deemed an area of high unemployment\nby selectively showing data from nearby census tracts. You can read more here.\nResources for learning more\nSpatial statistics:\nhttps://geodacenter.github.io/documentation.html\nNetwork analysis:\nhttps://docs.qgis.org/3.16/en/docs/training_manual/vector_analysis/network_analysis.html\nhttps://pro.arcgis.com/en/pro-app/tool-reference/network-analyst/an-overview-of-the-network\nanalyst-toolbox.htm\nWorking with raster data:\nhttps://docs.qgis.org/3.16/en/docs/user_manual/working_with_raster/index.html\nMIT Libraries, GIS Services, Updated 1/6/2022\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nRES.STR-001 Geographic Information System (GIS) Tutorial\nIAP 2022\nFor information about citing these materials or our Terms of Use, visit:\nhttps://ocw.mit.edu/terms\nMIT Libraries, GIS Services, Updated 1/6/2022"
    },
    {
      "category": "Resource",
      "title": "GIS Level 2 QGIS Workshop Exercises (PDF)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-str-001-geographic-information-system-gis-tutorial-january-iap-2022/mitres_str001iap22_level2_qgis.pdf",
      "content": "GIS Level 2: QGIS Workshop Exercises\nExercise 1: Map projections\nMap projections, also called Coordinate Reference Systems (CRS) can be viewed or changed using GIS\nsoftware.\n1. Examine the data in GIS_Level2_Data\\workshop_exercise. Is there a projection file for each\ndataset?\nNote that cambridge_dem is a raster dataset and uses a .tfw file (known as a \"world\" file), which\ncontains the information needed to transform image coordinates to real-world coordinates.\nShapefiles use a .prj file, which includes the coordinate system information.\n2. Open QGIS. Click Project > Save As and save the new project to your working folder.\n3. Add the following two data layers from GIS_Level2_Data\\workshop_exercise\na. MBTAbusroutes\nb. CambridgePlaygrounds\n4. Click Ok when you are asked to select a transformation. Close the Data Source Manager\nwindow.\nThe transformation box changes the coordinate reference system of your map project (not the\ndata layers). This changes how the data look on the screen and can help minimize distortion.\n5. To add a basemap click Web > QuickMapServices > OSM > OSM Standard.\n6. Right click on CambridgePlaygrounds and select Zoom to Layer.\nDo the playgrounds and bus routes seem to be in the correct locations?\nThey should be since both layers had a defined projection (.prj) file.\n7. Right click on CambridgePlaygrounds and select Properties.\n8. Select the Information tab.\nWhat is the coordinate reference system?\nDepending on your version of QGIS, you will either see the name NAD83 / Massachusetts\nMainland (ftUS) or a generic name, such as SOURCECRS. QGIS sometimes has trouble identifying\nthe names of projections even though the .prj file is being read correctly by the software.\nRegardless of the name we can tell it is projected because the Units are in feet.\n9. Do the same for the MBTAbusroutes data layer. What is the coordinate reference system? Is it\nthe same or different from the playgrounds?\n10. Close the Properties box and select Vector > Data Management Tools > Reproject Layer.\nWe will use this tool to change the projection of the playgrounds so that it is the same as that of\nthe bus routes. Note that when right clicking on a layer there is the option to Set Layer CRS. This\nshould only be used to assign a projection to a data layer that does not already have one or to\n\nchange one that is incorrect. Our map projections appear to be correct so we do not need to use\nthis tool.\nAlthough not always required, your analysis results may be quicker and more accurate if your\ndata layers are in the same projection. If you want to calculate the proximity of playgrounds to\nbus routes, you would first want to make sure the projections of both data layers are the same.\n11. Choose playgrounds as the Input layer.\na. In Target CRS, from the dropdown menu select EPSG 26986 -NAD83 / Massachusetts\nMainland_FIPS, the coordinate system of the MBTA bus routes. EPSG numbers are\nunique ID numbers assigned to every CRS.\nb. Click the ... icon next to the [create temporary layer] box and select Save to File. Save\nyour output dataset in your working folder.\nc. Click Run.\nExercise 2: Access basic analysis tools\nTools can be accessed via the menus at the top of the screen in QGIS.\n-\nA number of \"core\" tools come with QGIS and most can be found under the Vector or Raster\nmenus. You will also find tools by opening the Processing Toolbox (Processing > Toolbox).\n-\nSince QGIS is an open source GIS software, additional tools have been developed by individuals.\nThese can be added by clicking Plugins > Manage and Install Plugins and searching for the tool\nyou want.\n-\nGoogling is a good way to find tools that have been created for QGIS. Note that when there is a\nmajor upgrade, some tools may not work immediately.\n1. Add MBTA_NODE to the map from GIS_Level2_Data\\workshop_exercise.\n2. Click Ok if you see a coordinate system message.\n3. Click Vector > Geoprocessing Tools > Buffer.\nHow do you know what inputs and parameters to use? A short description of the tool appears on the\nright side of the tool window. Click the help button to learn more about this tool and its parameters.\n4. Select the MBTA_NODE as your Input layer from the dropdown menu.\n5. Enter a distance of 1000 meters.\n6. Most QGIS tools will create a temporary layer unless you specify otherwise. Do this by clicking\nthe ... button next to the box at the bottom of the window that says [Create temporary layer].\nSelect the Save to File option and choose an output location. Choose .shp as the file type.\n7. Run the tool. Turn off your buffers after you have looked at the layer.\nThe interface for all tools looks similar in QGIS, with most requiring input data, required parameters, and\noptional parameters.\n\nExercise 3: Use raster tools\nDifferent tools can be used with raster data versus vector data, although the output could be a vector,\nraster, or table, depending on the tools. There are also tools that allow you to convert from one data\ntype to another.\n1. Add the cambridge_dem.tif to your map. Click Ok if you see a coordinate system window. Close\nthe Data Source Manager window.\n2. Click Raster > Extraction > Contour.\n3. Select the dem as your Input layer and scroll down to choose an output location in the Contours\nbox. It's useful to choose an output name that indicates the contour interval so you can use this\nfor future reference.\n4. In the Interval between contour lines box, type 5. What are the units of this interval? While\nsome tools default to the unit of the coordinate reference system, QGIS also uses the\nmeasurement unit specified in the project properties. You can find this under Project >\nProperties > General. It's a good idea to set the unit the same as the CRS of your data layers.\n5. Click Run. Close the Contour window when the tools is finished running.\nYou will notice that the output is a vector line layer, which could then be exported to other\nprograms or used as input for vector analysis tools.\nExercise 4: Use Geoda to access spatial statistics tools\nWhile QGIS includes a wide variety of tools, there are some tools that are not currently included in QGIS,\nincluding those for spatial statistics. We will use another open-source software called Geoda, which was\nspecifically developed for exploratory analysis and spatial statistics.\n1. Open Geoda.\n2. Next to the Input file box, click the folder icon and select ESRI shapefile. Select\nmedian_income_suffolk_ma from the workshop data folder.\n3. Click the W icon in the toolbar (Weights Manager) and Create. Specify the following:\na) Weights File ID Variable: spatial_id (this is any ID that uniquely identifies each polygon)\nb) Rook contiguity (rook shares borders, queen shares borders and vertices/corners)\nThese parameters tell Geoda how to define a neighborhood for analysis. Feel free to experiment\nwith other parameters in the future.\n4. Click Create and save your weights file.\n5. Close the Weighs File Creation window and Weights Manager window.\n6. Select Space > Univariate Local Moran's I.\n7. Choose VALUE0 as the variable, which is the median household income in each tract, and verify\nthat your weights file is listed in the Weights box. See the text file in the workshop exercise data\nfolder for the attribute field information. Click OK.\n\n8. Check off the cluster map and Moran Scatter Plot and click OK.\n9. Where are there clusters of high and low income? The tool has also output a scatterplot that\nyou can examine. Close Geoda when you are finished.\nThe Moran scatter plot provides a classification of spatial association into four categories,\ncorresponding to the location of the points in the four quadrants of the plot. These categories are\nreferred to as High-High, Low-Low, Low-High and High-Low, relative to the mean, which is the center\nof the graph. It is important to keep in mind that there is a difference between a location being in a\ngiven quadrant of the plot, and that location being a significant local cluster or spatial outlier.\nIn the take-home exercise you will learn how to output these results so they can be added to QGIS.\nYou can learn more about the statistics used in Geoda here:\nhttps://geodacenter.github.io/documentation.html\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nRES.STR-001 Geographic Information System (GIS) Tutorial\nIAP 2022\nFor information about citing these materials or our Terms of Use, visit:\nhttps://ocw.mit.edu/terms"
    },
    {
      "category": "Resource",
      "title": "GIS Level 1 ArcGIS Pro Take-Home Exercises (DOCX)",
      "type": "DOCX",
      "source_url": "https://ocw.mit.edu/courses/res-str-001-geographic-information-system-gis-tutorial-january-iap-2022/mitres_str001iap22_level1_arcgis_takehome.docx",
      "content": "Introduction to GIS & Mapping: ArcGIS Desktop\nYour task in this exercise is to determine the best place to build a mixed use facility in Hudson County, NJ. In order to revitalize the community and take advantage of special loans, you want to build your facility in an area with at least 1.5 times the national unemployment rate (It was 4.4% as of August 2017, which is the year of our data). You will also explore what sort of railroad transit is available in this area.\nOpen ArcGIS Pro\nBefore you begin, decide where you will be storing the GIS files that you will be downloading and creating in this exercise. You can create a working folder on the desktop or in the Documents folder. The exercise data is in the folder you downloaded before the workshop in the folder Data\\Final Exercise.\nOpen ArcGIS Pro (Start (Windows icon)) > All Programs > ArcGIS > ArcGIS Pro). You will see an open screen where you can create a new map from a blank template. Click on \"Map\" to do so.\n\nYou will see a new form where you will name your project and where it will be located:\n\nUncheck the \"Create a new folder for this project\" checkbox and select the folder where you downloaded the data to (and not the folder that actually contains the data).\nArcgis Pro is designed like most Windows programs. All of the menus are context sensitive. In the top area (the toolbar), you see a number of tools. Those tools change with the selection of tabs and depending on what data layers you have highlighted.\nAdd a basemap from ArcGIS Online\n\nNotice that the map you created is not blank, but includes a default basemap. You can change the basemap if you choose:\n\nClick the Map tab and Basemap.\nClick on Imagery.\n\nNote that the layer is served over the web so it may take some time to draw (and you have to be connected to the internet for it to continue drawing). What you see depends on the scale you are working in on your map - as you zoom in closer you will typically find more detailed information. Your scale is displayed below the map and automatically adjusts as you zoom in and out.\n\nTo navigate your data, you will primarily use these buttons in the Map tab:\n\nFrom left to right, top row first, they are used to Zoom to the extent of all layers in the map, zoom to selected data, fixed zoom in, and fixed zoom. You can use the scroll button on your mouse to zoom in and out and you can left click and hold the click to pan around the map.\nFind and add data\nAs you learned, there are many sources for GIS data. We will first find transportation data for New Jersey.\nGo to: http://njogis-newjersey.opendata.arcgis.com/datasets?t=Transportation. This shows all the open transportation data for New Jersey. We found this site by doing an internet search for \"new jersey gis data.\"\nSearch for \"railroad\" in the top search box. Options should drop down from the search box. View the Passenger Rail Stations data layer by clicking on its name.\nA page opens that previews the data on a map. Click the download icon to the left of the map.\n\nA download pane opens on the left side of the screen. Click Download under Shapefile.\nWhile the file downloads, click the information icon.\n\nBrief metadata is provided in the sidebar. Click the View Full Details button to see more.\nReturn to the search box and repeat this process to locate and download the Railroads Network. If you want to explore any other data from this area, feel free to download it.\nMove the data to your working folder and unzip each file by right clicking and selecting 7-zip > Extract here (or use whatever data extraction tool you have installed on your computer).\nClick the Add Data button on the Map tab and navigate to your working folder where you unzipped the data and add it to the map. One is called Railroads_Network and one has a long code name.\nRight click on each layer name and select Properties. In the General tab rename Railroads_Network to Railroad_Stations and the long code name to Railroad_Lines.\nIn addition to the transportation data you just downloaded, add census unemployment data from the workshop materials. It can be found in GIS_Level1_Data\\takehome_exercise.\nRight click on Hudson_tracts and select Zoom to Layer.\nThe US Census divides the country into continuous polygons and aggregates census data for these polygons before releasing the data to the public so that individual responses cannot be identified. Our data is for census tracts, which contain between 1200 and 8000 people total.\nIn the Table of Contents of ArcGIS (where all layer names are listed) turn the layers on or off using the checkboxes located to the left of each layer name. Leave the basemap layer unchecked for now so that the next few steps will go more quickly.\n\nAdjust which layer draws on top by dragging layers above or below one another. You will want your rail stations and rail lines on top so they won't be covered by the census tracts polygons. If your layers will not drag, click the List by Drawing Order button at the top of the table of contents.\n\nExplore the attribute table\nRight click on each layer and select Attribute Table.\nEvery point, line, or polygon file has an attribute table. Any data in the attribute table can be used for displaying and labeling on the map and making queries. You can also create new columns in the table and add data or calculations. Metadata can be key to understanding attribute tables that use codes and abbreviations.\nLeave the attribute table for the tract unemployment data open.\nCan you tell what any of the column headings mean? It's unlikely, so you will need to look at the metadata.\nOpen the text file (outside of ArcGIS Pro) that is in your Data\\Final_Exercise folder. You now see the definition for each column. This data was downloaded from a database called Social Explorer, and joined to a polygon file from the US Census.\nVariable A17005_003 is the number of unemployed people in the civilian population. Is this what we want to map? Why or why not?\nMapping raw numbers is usually not useful because the total population in one census tract may be more or less than another. One way to \"normalize\" the data is to take into account the total population and calculate a rate.\nAt the top of the Attribute Table, click the Add field button.\n\nName the variable Unemp_rate and choose the type as double (you may need to double click on the Data Type box in order to select it with the cursor). Close the Fields window with the \"X\" and save your changes.\n\nRight click on the new column that was added and select Calculate Field.\nWe want to divide the number of people unemployed by the total number of people in each tract. Based on the metadata, which columns will you use?\nAdd fields to the equation by double clicking on them in the list. Make sure your equation matches this one: A17005_003! / !A17005_001! and click Run. Be patient, it will take a few seconds.\n\nWe want to find tracts that are 1.5 times the national unemployment rate. This is equal to .066 or greater.\nClick the Table tab at the top of the window, then Select By Attributes. Keep all of the defaults and then click Add (+) New Expression then Create a new expression.\nIn the Where clause of the expression, you will notice three fields:\nIn the left field, change the column that you want to work with from FID to Unemp_rate in the dropdown list.\nIn the middle field, change \"is equal to\" to \"is greater than or equal to\".\nIn the last field, enter 0.066. Click Run to select the tracts that have an unemployment rate greater than 0.066.\n\nAll rows that correspond to a tract with a higher than average unemployment rate are highlighted and the corresponding tracts are highlighted on the map.\nClose the Attribute Table.\nExport to a new file\nWe will export the selected tracts to a new data layer so that we can more easily visualize which tracts have high unemployment. Exporting a smaller area of data is the easiest way to subset a dataset to only the desired records or keep your file sizes smaller and more manageable.\nMake sure the Hudson_tracts is highlighted in the table of contents.\nClick the Data tab and Layer from Selection. Note that this layer is temporary until we export it.\nRight click on the new layer created from the selection and select Data > Export Features.\nClick on the folder icon to view and edit the save location. Select the folder where you want to save the file (you'll name the layer in the next step).\nIn the Output Feature Class box name the layer unemp_high.\n\nNote that file names and locations can be very important when working on projects. GIS software tends to generate many files, so you want to make sure to use file names that are descriptive and easy to remember in the future.\n\nClick Run.\nClear the selected features by selecting the Clear button in the Map tab.\n\nSave your map document.\n\nSymbolize data\nChange a single symbol\nRather than completely covering the unemployment polygon layer with the one for high unemployment, we can change the symbology of the high unemployment layer so that we can still see the tracts for the entire county underneath.\nIn the table of contents, double click the colored rectangle below the high unemployment layer (unemp_high) and change the fill to a pattern, such as 10% simple hatch (you will have to scroll down to find it). That way we can still see the unemployment tract data layer underneath.\nClose the Symbology box.\n\nExplore data distribution\nBefore we make a choropleth map of the unemployment rate, we need to examine our data in order to create the most appropriate map. A quick way to explore the distribution of our data in ArcMap is to make a graph. For future projects, you will likely want to explore your data outside of ArcGIS in statistical or data visualization software in order to better understand it.\nClick on the Hudson_tracts_unemp_2017 layer in the Table of Contents.\nAt the top of the window under Feature Layer, select the Data tab.\nClick Create Chart, choose Histogram.\nChoose Unemp_rate as the Number. Feel free to change the number of bins and see how the histogram changes.\n\nThis histogram is showing the number of tracts (y axis) that fall into each unemployment range (x axis). Not all ranges are shown because of size constraints on the axis, but this still gives you an idea of the general shape of your data. We see that unemployment rate is relatively low, but that there are some outlying tracts with a high employment rate.\nClose the Chart Properties box and the chart itself.\n\nMake a choropleth map\nMake sure the Hudson_tracts_unemp_2017 layer is highlighted in the table of contents. At the top of window, click the Appearance tab. Click on the dropdown triangle below Symbology and select Graduated Colors. This will open the Layer Properties window.\n\nSelect \"Unemp_rate\" as the Field.\nSymbolize the data in whatever way you think is best. Map symbology can be used to alter the way people view and understand information, just like statistics. It is important to understand what you want to express in your map and how to best symbolize your data.\nChose a classification method and number of classes. In order to help you choose a classification method. Here is more information about each method: https://pro.arcgis.com/en/pro-app/help/mapping/layer-properties/data-classification-methods.htm\nPick a color scheme from the drop down menu.\nYou can adjust the number of decimals shown by clicking the Advanced symbol options button and adjusting the Rounding options.\n\nClose the window when you are finished.\nSave your map document.\nDo you have an idea about where you might build based on the unemployment rate? Obviously many factors go into selecting a building site. We will examine one more: train access.\nFind tracts that have railroad stations\nYou will use the Select by Location tool to select all tracts that contain a railroad station.\nClick on the Map tab. In the Selection menu at the top, click \"Select By Location\".\nFor the Input Features, choose Hudson_tracts_unemp_2017.\nChange Relationship to Contains.\nFor the Selecting Features, choose Railroad_Stations_in_NJ.\n\nClick Run. Now all tracts that contain a railroad station are highlighted in blue. This is temporary until you clear the selection.\nMake these into a temporary layer again in the Data tab using the Layer from Selection button. We don't have to export them to a permanent layer this time.\nChoose a tract for building\nWith the Hudson_tracts_unemp_2017 layer selected in the Table of Contents click the Map tab and the Clear button.\nNow choose the Select button in the tab. Click on the tract that you want to build in, based on the visualization you have made. You can select more than one tract by holding the Shift key as you make your selection.\nAgain, create a layer from the selected data. Export the data using the method in the Export to\nA New File section of the exercise.\nClear the selection once you have exported the layer and change the symbology of the layer to show it is the one you selected for building.\n\nWondering what area was actually chosen for this building? Add Bay_street_building from Data\\Final_Exercise. You may need to double click on the point symbol and adjust the size to see it. Read the article here.\nMake final changes to the color of any of the data layers and zoom and center your map to prepare for creating a layout.\nCreate a layout of your map\nAt the top of the window, in the Insert tab select New Layout.\nSelect 8.5\" x 11\" Letter under ANSI Landscape.\nYou should have an empty page. Click the Insert tab and Map Frame. Select the image of your map. Draw a box where you would like the map placed. Drag the corner of the map to fill most of the page but leave room for a title, scale bar etc. If you need to adjust the scale once the map frame has been inserted, select or type in a value in the scale bar at the bottom of the screen (the smaller the number, the more zoomed in the map).\nClick on the Insert tab and Legend. You need to drag the box big enough to see all of the entries. Only the visible layers in your map will be included in the legend.\nUsing the same procedure, insert a North arrow.\nFrom the Text dropdown (it will say rectangle now), choose Text and place it on your map. Write a title.\nExport your map\nClick on the Share tab.\nClick Export Layout from the Output section.\nChoose PDF in File Type and select the location to save to.\nClick on the Export button.\nNote that if you save as an AI (Adobe Illustrator), the layers will remain as separate, editable layers in Illustrator. If you save as JPEG or TIFF, you can adjust the resolution of the exported file.\nOpen your map in Adobe Acrobat to see what it looks like.\nSave your ArcMap document\nClick Save button.\nNote that when you save an ArcGIS Pro document, you are only saving a link to the layers in your project. If you move your project to a new location, you will need to move all the files linked to your project with it. Each shapefile has multiple files associated together, and they need to stay together to work properly! It is best to save all files in the project folder so they are more transportable with the project.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nRES.STR-001 Geographic Information System (GIS) Tutorial\nIAP 2022\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms"
    },
    {
      "category": "Resource",
      "title": "GIS Level 1 ArcGIS Pro Workshop Exercises (DOCX)",
      "type": "DOCX",
      "source_url": "https://ocw.mit.edu/courses/res-str-001-geographic-information-system-gis-tutorial-january-iap-2022/mitres_str001iap22_level1_arcgispro.docx",
      "content": "GIS Level 1: ArcGIS Pro Workshop Exercises\n\nExercise 1\nOpen software\nOpen ArcGIS Pro on your computer. Select Map from the Blank Templates area.\nName your Project GIS_Level1 and select a location for saving it. A blank map will now open.\nAdd data\nClick the Map tab and the Add Data button.\n\nNavigate to the workshop folder and select GIS_Level1_Data\\workshop_exercises.\nAdd all the data layers:\nMBTA_NODE\nMBTA_ARC\ncambridge_demographics\ncambridge_DEM\ncambridge_restaurants\nIt may take a minute for the data to load.\nReview interface & organize data\nThe center of the screen contains a basemap that has been automatically loaded. It is there to provide context for the data that we added.\nYou can move around the map using the pan and zoom buttons in the Map tab of the top menu bar.\n\nData layer names are shown in the Contents pane on the left. You can right click on any layer and select Zoom to Layer to center it on the screen.\n\nDrag the layers up or down so that they do not cover each other.\nYou can turn layers on and off by checking/unchecking the box next to each name. Uncheck the cambridge_DEM for now so it is easier to see the other data layers (we will change its appearance later in the exercise).\nClicking the menus at the top of the screen will show various tools you can use to edit, visualize and analyze your data. The toolbox in the Analysis tab will open the full list of analysis tools, which we will explore more in GIS Level 2.\n\nIdentify types of data & explore attributes\nLook at the data layers in the Contents pane. Are they vector or raster data? If they are vector, are they point, line or polygon?\nTo see the underlying data of each layer, right click on it and select Attribute Table.\nWhat columns are included with the MBTA_ARC data?\nWhat about the cambridge_DEM? Why are they different?\nThe cambridge_restaurants data layer is currently not in a shapefile format so it is not displaying on the map, however we can convert it to point data by plotting the coordinates included in the table.\nRight click on the cambridge_restaurants table in the Contents pane and select Display XY Data.\nClick the folder next to Output Feature Class to select a location to save the data and choose a file name.\nThe X Field should already be filled in with Longitude and the Y field with Latitude. Keep the Coordinate System as GCS_WGS_1984.\nClick OK.\nSave your map project and keep your map open.\n\nExercise 2\nData can be symbolized in a variety of ways, depending on the data format and available attributes.\nChange a single symbol\nDouble click on the point symbol below the Cambridge_restaurants layer in the Contents pane.\nChoose a symbol to represent the restaurants. You can make additional modifications to the symbol in the Properties tab.\nClose the Symbol window when you are finished.\nSymbolize categories\nYou want to change the color of the mbta lines (MBTA_ARC) so they correspond to the correct color.\nRight click on MBTA_ARC and select Symbology.\nChoose Unique Values under Primary symbology, which means that each value will be assigned a unique color, pattern, etc.\nLook at the metadata (https://www.mass.gov/info-details/massgis-data-mbta-rapid-transit) to determine which column contains information about the name of the rapid transit line. Choose the appropriate column from the dropdown menu in Field 1.\nClick the Add all Values button to add all unique values found in the LINE column.\n\nClick on the line symbol in the Symbol column to select an appropriate color. Click Apply and the back arrow after selecting each color.\nClose the Symbology window when you are finished.\nMake a choropleth map\nSelect the Cambridge_demographics layer in the Contents pane by clicking on it so it is highlighted.\nClick the Appearances menu and Symbology.\nSelect Graduated Colors from the Primary symbology dropdown menu to create a choropleth map.\nOpen the metadata for this layer outside of ArcGIS Pro. It is in the workshop_exercise data folder and called Cambridge_demographics_variable_names.txt. Choose which data you would like to symbolize and choose the corresponding column from the Field dropdown menu.\nExperiment with different break methods, classes, and color schemes from the dropdown menus until you are happy with your map.\nClick the Advanced symbology options tab and expand Format labels.\n\nClick the Category dropdown to select the appropriate numeric display for your data and alter the number of decimal places if needed.\nClose the symbology window when you are finished.\nSymbolize a raster\nRight click on Cambridge_DEM and select Symbology.\nThere are different options for symbolizing raster data versus vector data. The DEM is currently symbolized as Unique values which are most appropriate for values that each represent a different data category, such as land use so you should choose a different symbology. Feel free to experiment with other options from the dropdown menu:\nStretch: assigns a continuous color scheme from the minimum to the maximum value of each raster cell\nDiscrete: you choose a specific number of colors to use when symbolizing data\nClassify: data value are grouped into classes, similar to when creating a choropleth map.\nWhen you are happy with your raster symbolization, close the Symbology window.\nSee the take home exercise for information on how to create a layout for printing or exporting your map.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nRES.STR-001 Geographic Information System (GIS) Tutorial\nIAP 2022\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms"
    },
    {
      "category": "Resource",
      "title": "GIS Level 1 Instructions (DOCX)",
      "type": "DOCX",
      "source_url": "https://ocw.mit.edu/courses/res-str-001-geographic-information-system-gis-tutorial-january-iap-2022/mitres_str001iap22_level1_instructions.docx",
      "content": "GIS Level 1 Setup Instructions\n\nNote: This activity uses online resources that may not be freely available to OCW users.\nThank you for registering for GIS Level 1. Before the workshop, please do the following:\nDownload and install either ArcGIS Pro or QGIS\nInstall 7-zip if necessary\nDownload all workshop materials\nUpdate and setup Zoom\nDownload and install ArcGIS Pro or QGIS\nQGIS is a free, open source software program that will work on any operating system and doesn't take up much space on your computer. While it has many of the same capabilities as ArcGIS Pro, there are some analyses you can't do in QGIS and it tends to have more bugs.\nArcGIS Pro is a commercial software from ESRI that we have a subscription for at MIT. It only runs on Windows and requires an account or a connection to the MIT license server to run. It includes a full suite of GIS tools, but may not run well if you have a slower computer.\nIf you are not sure which software to use, this website has a lot of additional information: https://gisgeography.com/qgis-arcgis-differences/\nNote: This workshop will NOT use ArcGIS Desktop/ArcMap, only ArcGIS Pro, the newest GIS software from ESRI.\nArcGIS Pro installation\n1. Create an ArcGIS Online (AGOL) account: https://libguides.mit.edu/gis/webmap#s-lg-box-wrapper-5115587\n2. If you have not already downloaded Pro, log into your AGOL account. From your account page, click your name in the upper right and select My settings > Licenses and click download next to ArcGIS Pro.\n3. After installing Pro, choose the Named User License type and select ArcGIS Online. You'll then see the same login screen that you used to create your account.\nQGIS Installation\nFull instructions and links for installing QGIS for a number of different operating systems can be found here: http://qgis.org/en/site/forusers/download.html\nWindows users should download QGIS Standalone Installer. (Mac users only have one option.)\nDownload QGIS 3.16 or higher. If you already have QGIS installed, we have tested the workshop exercises with versions 3.16 and higher so we recommend upgrading if you are using an older version.\n7-zip installation\nWorkshop files (and most GIS data) are in zipped folders. Most Windows computers have the option to extract data by right clicking and most Macs will automatically extract data. Occasionally your computer may not have a built-in data extraction tool. In this case we recommend installing 7-zip:\nhttps://www.7-zip.org/\nWorkshop materials\nDownload all workshop.\nMaterials include the presentation, workshop exercises, take-home exercise, and all required data.\nZoom setup\nMake sure your Zoom app is up-to-date using these instructions. You may have difficulty completing exercises in breakout rooms if your Zoom is not updated: https://support.zoom.us/hc/en-us/articles/201362233-Upgrade-update-to-the-latest-version\nIf you have access to a second monitor (or a second \"smart\" device that can connect to a Zoom session) it may greatly improve your workshop experience and make it easier to follow the instructor and complete the exercises simultaneously. If not, it is still doable, for example, by organizing your screen in this way: https://raw.githubusercontent.com/hbctraining/bioinformatics_online/master/guidelines/img/Screenshot%202020-03-23%2015.21.10.png\nWe encourage participation during the session and kindly ask you to use your video, if possible.\nMute audio except when talking (Tip: you can temporarily unmute yourself by pressing and holding a space bar. When it is released, Zoom goes back to the mute mode).\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nRES.STR-001 Geographic Information System (GIS) Tutorial\nIAP 2022\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms"
    },
    {
      "category": "Resource",
      "title": "GIS Level 1 QGIS Take-Home Exercises (DOCX)",
      "type": "DOCX",
      "source_url": "https://ocw.mit.edu/courses/res-str-001-geographic-information-system-gis-tutorial-january-iap-2022/mitres_str001iap22_level1_qgis_takehome.docx",
      "content": "Introduction to GIS & Mapping: QGIS Desktop\nYour task in this exercise is to determine the best place to build a mixed use facility in Hudson County, NJ. In order to revitalize the community and take advantage of special loans, you want to build your facility in an area with at least 1.5 times the national unemployment rate (4.4% as of August 2017, the year of our data). You will also explore what sort of railroad transit is available in this area.\nOpen QGIS Desktop\nThis exercise has been tested with QGIS versions 3.16 and higher, though previous releases will likely work as well.\nDecide what folder you will use to store your map and data. We recommend using the folder where you downloaded the workshop materials.\nOpen QGIS (Start (Windows icon)) > All Programs > QGIS > QGIS Desktop 3.X). Note: if this is the computer's first time opening the new version it may present window with a welcome message; click \"Let's get started!\" Now, open a new map by clicking on the Project tab in the top menu and then the 'New' project icon in the upper left corner of the QGIS Desktop window.\nIf you do not see this icon it may be due to what toolbars are turned on. Go to the View tab in the top menu > Toolbars (at bottom) > and make sure the following toolbars are checked: Attributes, Map Navigation, and Project. You can also access the panel and toolbar menu by right clicking anywhere in the grey of the top menu.\n\nNote: the QGIS Project file is a record of the layers that have been added to a map display, along with the map display itself. This allows users to recover a map display including the layers in the map, symbolization, visibility, units of measurement, and other display settings (similar to other software).\n\nClick Project > 'Save As...' to save your project in the folder you set up. We recommend saving frequently with any GIS software as there can be crashes when running tools.\nAdd a basemap\nAdding a basemap is a quick and easy way to provide context to spatial data you are displaying or analyzing.\n\nLook for the Web menu at the top of the screen and QuickMapServices. If you do not see it, follow the instructions below. If it is there, continue to step 2.\nIf you cannot see the QuickMapServices plugin, click 'Plugins' in the top menu > 'Manage and Install Plugins...'\nSelect 'QuickMapServices' from the list of plugins.\nClick 'Install Plugin' > and 'Close' the window.\nClick the Web tab in the top menu, and hover over the QuickMapServices Plugin until the dropdown menu shows. Click on OSM Standard.\n\nNote that the layer is served over the web so it may take some time to \"draw\" (you must be connected to the internet to use this plugin). What you see depends on the scale you are working in on your map - as you zoom in closer (see methods below) you will typically find more detailed information. Your scale is displayed in the Standard toolbar and automatically adjusts as you zoom in and out.\nTo navigate your data you will primarily use these buttons:\n\nFrom left to right, they are used to pan, pan to selection, zoom in, zoom out, and zoom to the full extent of all visible data. Take a moment to explore these options as you will use them often. Note that the icons may vary slightly depending on the version of QGIS that you have. You can hover over an icon to see its name.\nThe coordinate of your mouse pointer and zoom scale are shown along the bottom right of the map:\n\nFind and add data\nAs you learned, there are many sources for GIS data. We will first find transportation data for New Jersey.\nGo to: http://njogis-newjersey.opendata.arcgis.com/datasets?t=Transportation. This shows all the open transportation data for New Jersey. We found this site by doing an internet search for \"new jersey gis data.\"\nSearch for \"railroad\" in the top search box. Options should drop down from the search box. View the Passenger Rail Stations data layer by clicking on its name.\n\nA page opens that previews the data on a map. Click the download icon on the left side of the map.\n\nA download pane opens on the left side of the screen. Click Download under Shapefile.\nWhile the file downloads, click the information icon. Brief metadata is provided in the sidebar. Click the View Full Details button to see more.\n\nReturn to the search box and repeat this process to locate and download Railroads Network. If you want to explore any other data from this area, feel free to download it.\nMove the files to your folder and unzip the files by right clicking on file and selecting 7-Zip > Extract Here (or use the data extraction software installed on your computer).\nGo back to QGIS. In the top menu select Layer > Add Layer > Add Vector Layer...\nNavigate to your working folder by clicking on ... to the right of the Source box.\nSelect the two shapefiles by selecting the file with the .shp extension. Hold ctrl to select multiple files. One is called Railroads_Network and one has a long code name.\nClick Open > Add (if a projection warning comes up, hit OK for now) > close window when done.\nNote that even though you selected the .shp files, QGIS is using all the files that make up the shapefile in order to place the data in the proper position on the map.\nIf the box appears for converting coordinate reference systems, click Ok and Ok again if prompted. We will work with coordinate reference systems in GIS Level 2.\nRight click on the layer name and select, \"Zoom to layer.\" Note depending on the random color assigned to the railroad lines they may be hard to see.\nRight click on each layer name and select Rename Layer. Rename Railroads_Network to Railroad_Stations and the long code name to Railroad_Lines.\n\nIn addition to the transportation data you just downloaded, add census unemployment data to the map. This data can be found in the folder Data\\Final_Exercise. Repeat the process of adding a vector layer: \"Hudson_tracts_unemp_2017.shp\". Close the Add Vector data box and Zoom to this layer to hone in on the project site.\nThe US Census divides the country into continuous polygons and aggregates census data for these polygons before releasing the data to the public so that individual responses cannot be identified. Our data is for census tracts, which contain between 1200 and 8000 people.\nIn the Table of Contents of QGIS (where all layer names are listed) turn the layers on or off using the checkboxes located to the left of each layer name. Leave the basemap layer unchecked for now so that the next few steps will go more quickly (basemaps can slow down the drawing of other layers).\nAdjust which layer draws on top by dragging layers above or below one another. Note: You will want to end up with your rail stations and rail lines on top so they won't be covered by census tract polygons.\nExplore the attribute table\nRight click on each layer's name > select Open Attribute Table... This is the data associated with each layer, and what that layer's symbolization will be based upon.\nEvery point, line, or polygon file has an attribute table. Any data in the attribute table can be used for displaying and labeling that layer as well as make queries from. You can also create new columns in the table and add data or calculations. Note: metadata can be key to understanding attribute tables that use codes and abbreviations.\nLeave the attribute table for the tract unemployment data open.\nCan you tell what any of the column headings mean? It's unlikely, so you will need to look at the metadata. Open the text file (outside of QGIS) in Data\\Final Exercise. You now see the definition for each column. Note: this data was downloaded from a web based GIS, Social Explorer, and joined to a polygon file from the US Census.\nQ: Variable A17005_003 is the number of unemployed people in the civilian population. Is this what we want to map? Why or why not?\nA: Mapping raw numbers is not often useful because the total population in one census tract may be more or less than another, and so the counts are not meaningful to compare between geometries. One way to \"normalize\" data is to divide the counts by the total population to calculate a rate.\nClick the Open Field Calculator icon\n\nNote, in some versions of QGIS this may be greyed out until you click the Toggle edit icon\n\nMake the Output field name Unemp_rate and make the Output field type Decimal number.\nIn some versions of QGIS, you may need to specify the field length (if these options are greyed out, ignore this step). In this case, make Output field length 11 (number of characters) and precision (number of decimal places) 11.\nQ: Since we want to divide the number of people unemployed by the total number of people in each tract. What columns would you use to do this, (remember you can look at metadata to know what each column is)?\nA: To create the expression that will calculate the unemployment rate:\nClick in the Expression box\nOpen the Fields and Values menu in the box to the right (under the search line)\nDouble click on the fields to add them to the expression box (you can also type them in directly)\nUse the divide by function button between fields to create the expression shown.\n\nClick OK.\nIf you turned on editing, click the Save edits icon in the table's menu\n\nAnd click the Toggle edit ( ) to stop editing.\n\nIf you did not turn on editing, proceed to the next step.\nNext, based on the original problem statement we know that we want to find tracts that are 1.5 times the national unemployment rate. This is equal to .066 or greater. Click the Select features using an expression button at the top of the table's menu window.\n\nOpen the Fields and Values menu. Double click on Unemp_rate in the list. This will add it to the expression box on the left. Finish the expression by setting it greater than or equal to .066 (\"Unemp_rate\" >= .066). You will find >= in the Operators menu (below the Fields and Values menu). Click Select Features and close the Select by expression window, to see the rows that were selected.\n\nAll rows that correspond to a tract with a higher than average unemployment rate are highlighted and the corresponding tracts are highlighted on the map.\nWithout clicking anywhere within the table or map (will alter the selection), close the Attribute Table.\nExport to a new file\nWe will now export the selected tracts to a new data layer so that we can more easily visualize which tracts have high unemployment. Exporting a smaller area of data is the easiest way to subset a dataset to only the desired records or keep your file sizes smaller and more manageable.\nRight click the unemployment layer in the table of contents > Export > Save Selected Features As...\n\nMake the Format ESRI Shapefile. Click the ... next to the File name box and navigate to your folder. Name the file \"Unemp_ratehigh\" in your folder. Keep the CRS (EPSG,4269, NAD83). Click OK.\n\nNote: file names and locations can be very important when working on projects. GIS software tends to generate many files, so you want to make sure to use file names that are descriptive and easy to remember.\n\nClear the selected features by clicking the \"Deselect features from all layers\" icon in the top menu.\n\nNow try turning on/off this new layer and the original unemployment data. What do you notice?\nSave your map document to your working folder on your local drive using the Save icon.\nSo far you have learned how to open and navigate the software, use plugins to add a basemap, find, download, and add data, explore and select from the attribute table based on information in the metadata, perform a selection, and export your new dataset. You have completed many parts of getting started in a GIS and are half way through the exercise. Feel free to take a short break before continuing on to symbolization, decision making, and creating and exporting your final map.\nSymbolize data\nChange a single symbol\nRather than completely covering the unemployment polygon layer with the one for high unemployment, we can change the symbology of the high unemployment layer so that we can still see the tracts for the entire county underneath.\nIn the table of contents, double click the high unemployment layer (Unemp_ratehigh) name.\nClick on the Symbology tab\nClick on the words, \"Simple fill\" to bring up the options.\nIn Fill Style, change the Simple fill style to a pattern, such as Diagonal X. That way we can still see the unemployment tract data layer underneath.\nAdjust the color (using the drop down menu in the 'Fill' box) and click OK when done.\n\nNote: Your help screen may look slightly different depending your version of QGIS.\nExplore data distribution\nBefore we make a choropleth map of the unemployment rate, we need to examine our data in order to create the most appropriate map. A quick way to explore the distribution of our data in QGIS is to make a graph.\nDouble Click hudson_tracts_unemp_2017 in the Layers Panel.\nChoose Symbology from the left column.\nSelect Graduated from the top dropdown menu.\nChoose Unemp_rate as your Value/Column.\nSelect a color ramp of your choosing.\nClick Classify to load that field's values.\n\nNow select the Histogram tab (next to Classes). Click on Load values and see how the frequency of different values are being symbolized based on the method, number of classes, & color ramp.\nWe see that unemployment rate is relatively low, but that there are some outliers with a high employment rate.\nMake a choropleth map\nSymbolize the data in whatever way you think is best. Map symbology can be used to alter the way people view and understand information, just like statistics. It is important to understand what you want to express in your map and think carefully about how best to symbolize your data. Note: you can click apply when finished instead of OK to test options, without leaving the Layer Properties window.\nPick a color ramp from the drop down menu.\nChoose the mode and number of classes (options below the classes box)\nHere is brief information about some of the available classification methods. For a more in depth analysis check out our mini-tutorial on choropleth mapping.\nEqual Interval: classes are all the same size.\nQuantile - number of values in each class is the same. If there are 100 values and we want 4 classes, quantile method will make it such that each class will have 25 values.\nNatural Breaks (Jenks) - algorithm finds natural groupings of data to create classes. It maximizes the variance between individual classes and min. variance within each class.\nStandard Deviation - creates classes based on standard deviations from the mean.\nPretty Breaks - This is based on the statistical package R's pretty algorithm. It is a bit complex, but the pretty in the name means it creates classes with round numbers.\nTo reduce the number of decimals shown in the legend, use the Precision options in the upper right part of the Symbology window.\nClick Ok when you are finished.\nSave your map document.\nDo you have an idea about where you might build based on the unemployment rate? Obviously many factors go into selecting a building site. We will examine one more: train access.\nFind tracts that have railroad stations\nYou will use the Spatial Query tool to select all tracts that contain a railroad station.\nFrom the top menu, click Vector > Research Tools > Select by Location.\nSelect features from the hudson_tracts_unemp_2017 data layer, where the features \"contain\" features from the Railroad_Stations_in_NJ.\nClick Run > then Close.\n\nNow all tracts that contain a railroad station are highlighted. Based where there is high unemployment (1.5 times the national unemployment rate, use 'Unemp_ratehigh' layer) and access to transportation, where might you want to build?\n\nRemember you can repeat the process of exporting your selection to its own layer, which you can symbolize in such a way (e.g. hollow with dots) that it can be seen alongside other layers. You may also want to turn off railroad lines and stations once you have performed the prior steps.\n\nOnce you have finished this step, clear the selection.\n\nChoose a tract for building\nClick the selection button at the top of the screen and click on the tract that you want to build in, based on the visualization you have made. You can select more than one tract by holding down the Ctrl button.\n\nSave the selected feature(s) using the same method you used above so that you know which location(s) you selected to build on.\nClear the selection once you have exported the layer.\n\nWondering what area was actually chosen for this building? Add Bay_street_building from Data\\Final_Exercise. You may need to double click on the point symbol and adjust the size to see it. Read the article here.\nMake final changes to the color of any of the data layers.\nLayout and export your map\nIn QGIS, you can create a map to export and print in the Map Layout.\nOn the main toolbar menu at the top of QGIS click Project > Layout Manager.\nIn the Layout manager window, click Create... and name your new layout something like \"New Jersey Building Tract\".\nClick OK.\n\nA new window will open where you can work on the layout your map. If you close the new layout, you can re-open it by clicking Project > Layouts, and choosing your layout from the list.\n\nThe menus on the left of the layout window are tools that help you move around and add things to your map. The menus across the top are tools that allow you to save and export, zoom in and out and more. Hover over the symbols to read what they do.\nOn the left-hand menu, click on the Add Map icon.\n\nClick and drag a box on the blank page. Your map will appear in the box you've drawn. You can click and drag the map around and resize it to make the margins work the way you want.\nUse the select/move item icon to select and move your map around on the page.\n\nUse the move item content icon to adjust the placement of your map.\n\nRight click the map itself > Page Properties to test switching between portrait or landscape orientation.\n\nUse the Add Label button and click on the page to add a title box.\n\nOn the right side of the Layout window, click on the Item properties tab and type your title in the Main Properties box. Change font (click right dropdown arrow), margins, position, size and background the way you think it should be.\nInsert a legend using the Insert legend button, then click and drag a box for the legend placement. Use the Item properties tab to modify your legend.\n\nInsert a scale bar and/or North arrow (click once to start line, again to end it, & right click to finish). Note these are the least important features you need to add so do not pick distracting formats.\n\nUse again the Add New Label icon to create a text box for your name, date, and sources for your data. If you do not like the default settings for any item, use the item properties to edit its display.\nSave your layout.\nExport your map\nIn the top menu go to Layout > and look at the different export options: Export as Image, Export as SVG..., Export as PDF... You can also use the icons to save your map in any of these ways. Note: if you save as a JPEG or TIFF, you can adjust the resolution of the file.\nIf you receive a \"Project Contains WMS Layers\" warning, this means that the owner of the basemap won't allow large areas to be exported. Our area is small enough to ignore this warning so feel free to have your basemap on when exporting (you can move layout view to the side to edit what layers are on in original data view window).\n\nSave your exported map.\nClick close (if needed after export).\nOpen your map to see what it looks like.\nClose the Layout window & then the Layout Manager window\nSave your QGIS document\nClick the Save icon.\nNote that when you save a QGIS document, you are only saving the links to the layers in your project and how you have symbolized them, not the actual datasets. If you move your project to a new location, you will need to move all the files linked to your project. Note: also keep in mind that each shapefile has multiple files associated with it, and they need to stay together to work properly.\nBy default, QGIS stores the full path name to each layer in the QGIS document. This means that if you move your files around, your path name will change and you will need to redirect QGIS to the new file location for each folder of data. If you will be moving files around, it is recommended that you save a relative path to the data files in your project. QGIS does this by default.\nTo be sure the default is set that way, go to Project > Properties.\nClick on the General tab.\nCheck that the dropdown menu next to Save paths is set to relative, not absolute. Click OK to close the window.\n\nCongratulations!\nYou should now be familiar with the following:\nOpening a QGIS Desktop Project\nAdding basemaps & data\nExploring attribute tables\nSelecting & exporting data\nSymbolizing data\nPerforming selections & analyses\nExporting & Saving a map\nFor more information, check out the QGIS Documentation.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nRES.STR-001 Geographic Information System (GIS) Tutorial\nIAP 2022\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms"
    },
    {
      "category": "Resource",
      "title": "GIS Level 1 QGIS Workshop Exercises (DOCX)",
      "type": "DOCX",
      "source_url": "https://ocw.mit.edu/courses/res-str-001-geographic-information-system-gis-tutorial-january-iap-2022/mitres_str001iap22_level1_qgis.docx",
      "content": "GIS Level 1: QGIS Workshop Exercises\n\nExercise 1\nOpen software\nOpen QGIS on your computer. Select the new Project icon.\n\nA blank map will now open. Click the Save icon to name and save your project.\nAdd data\nClick the top Layer Tab > Data Source Manager button.\n\nClick the Vector icon on the left.\n\nTo the right of the 'Vector Dataset(s)' box, click the ... icon. Navigate to the workshop folder and GIS_Level1_Data/workshop_exercises.\nHold Ctrl and select the .shp files for each of the following layers:\ncambridge_demographics.shp\nMBTA_ARC.shp\nMBTA_NODE.shp\nWhen done selecting > click Open > and then click Add > and follow the instructions below.\nA coordinate reference system window may appear because our project has a different coordinate system than our data layers. This tool will change the project coordinate reference system to that of the data layers so they appear less distorted on screen. We will discuss map projections more in GIS Level 2. You can select OK to close this window for now.\nNow we will add raster data. Click the raster icon on the far left-hand side of the Data Source Manager window.\n\nClick the ... icon to the right of the Raster dataset(s) box and select cambridge_dem.tif from the data folder.\nClick Add and then close the window.\nNote: if you accidentally added duplicate layers you can right click them and select to remove.\nMake sure the Quick map plugin is installed by clicking Plugins > Manage and Install Plugins > and searching for QuickMapServices. Click the Install Plugin button. (This button will only be visible if the plugin is not installed.) Close the plugin window.\nAdd a basemap by clicking Web > QuickMapServices > OSM > OSM Standard.\nReview the interface & organize data\nThe center of the screen displays any data that we added.\nThe names of data layers are shown in the Layers pane on the left.\nMove around the map using the pan and zoom buttons in the top menu bar.\nRight click on any layer and select Zoom to Layer to center it on the screen\nTurn layers on and off by checking/unchecking the box next to each name.\n\nDrag the layers up or down in the Layers box so that they do not cover each other.\nThe menus at the top of the screen show various tools you can use to analyze vector or raster data. New menus may appear when you load additional plugins using the Plugins menu.\nIdentify types of data & explore attributes\nLook at the data layers in the Layers pane. Are they vector or raster data? If they are vector, are they point, line or polygon?\nTo see the underlying data table for a layer, right click and select Open Attribute Table.\nWhat columns are included with the MBTA_ARC data?\nIs there an attribute table for cambridge_dem? Why might that be?\nCreating geographic data from tabular data\nThe cambridge_restaurants data layer is currently not in a shapefile format so it was not added to the map, however we can convert it from a .csv to point data by plotting the coordinates included in the table.\nOpen the Layer > Data Source Manager again and select the Delimited Text tab.\n\nNext to File Name > click the ... menu and navigate to the .csv in the data folder.\nIn the Geometry Definition section (click the arrow to extend the dropdown) select Point coordinates with the X Field as Longitude and the Y field as Latitude.\nIn the same section, for Geometry CRS, select EPSG:4326 - WGS 84 from the dropdown menu. If you don't see it listed, click the Select CRS button next to the dropdown menu to search for it.\nClick Add and Close. Now see where the cambridge_restaurants show up as points.\nSave your project and keep it open.\n\nExercise 2\nData can be symbolized in a variety of ways, depending on the data format and available attributes.\nChange a single symbol\nDouble click on the cambridge_restaurants layer in the Layers pane.\nClick the Symbology tab.\nClick on the text, Simple marker. Down below, choose a symbol to represent the restaurants. You can make additional modifications to the symbol using the various dropdown menus.\nClick Ok and close the Properties window when you are finished.\nSymbolize categories\nNow change the color of the mbta lines (MBTA_ARC) so they correspond to the correct color.\nRight click on MBTA_ARC and select Properties. Select the Symbology tab.\nFrom the dropdown menu at the top, choose the styling to be Categorized, which means that each value will be assigned a unique color, pattern, etc.\nLook at the metadata (https://www.mass.gov/info-details/massgis-data-mbta-rapid-transit) to determine which column contains information about the name of the rapid transit line. Choose the appropriate column from the dropdown menu in the Value box.\nClick the Classify button, at the bottom, to add all unique values found in the LINE column.\nDouble click on the line symbol in the Symbol column to select an appropriate color.\nClick OK when you are finished.\nMake a choropleth map\nDouble click the cambridge_demographics layer and select the Symbology menu.\nSelect Graduated from the dropdown menu at the top to create a choropleth map.\nOpen the metadata for this layer outside of QGIS. It is in workshop_exercise data folder and called cambridge_demographics_variable_names.txt.\nChoose which data you would like to symbolize and choose the corresponding column from the Value dropdown menu.\nClick the Classify button at the bottom of the window. Experiment with different break methods, classes, and color schemes from the dropdown menus until you are happy with your map.\nUse the precision dropdown menu to alter the number of decimal places if needed. Click Ok when you are finished.\n\nSymbolize a raster\nDouble click on cambridge_dem and select the Symbology tab.\nNotice that there are different options for symbolizing raster data versus vector data.\nThe data are currently symbolized as Singleband gray, which assigns a continuous color scheme from the minimum to the maximum value of each raster cell.\nAnother option that could be appropriate for this data is Singleband pseudocolor, in which data value are grouped into classes, similar to when creating a choropleth map. Choose a color ramp to see the options for this rendering. Note: Paletted/Unique values would be the most appropriate for values that each represent a different data category, such as land use.\nExperiment with the symbolization. When you are happy with your raster click OK.\nSee the take home exercise to learn how to create a layout for printing or how to export your map.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nRES.STR-001 Geographic Information System (GIS) Tutorial\nIAP 2022\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms"
    },
    {
      "category": "Resource",
      "title": "GIS Level 2 ArcGIS Pro Take-Home Exercises (DOCX)",
      "type": "DOCX",
      "source_url": "https://ocw.mit.edu/courses/res-str-001-geographic-information-system-gis-tutorial-january-iap-2022/mitres_str001iap22_level2_arcgispro_takehome.docx",
      "content": "GIS Level 2\nIn the Introduction to GIS workshop we filtered data and visually examined it to determine where to potentially build a new mixed-use facility. In order to get a low interest loan, the building needs to be located in an area with high unemployment. You also want to consider access to public transportation (for people who may be living at the building and commuting to the city or commuting to the building for work) and the terrain of the area.\nIn this exercise we will learn how to use the analysis tools in ArcGIS Pro with vector and raster data to further examine potential building sites.\nUse Spatial Autocorrelation to Determine Areas of High Unemployment\nChange a projection\nBecause spatial autocorrelation uses distance among features as part of the calculation, we will first convert the census data from a geographic coordinate system to one that is projected.\nOpen ArcGIS Pro and select the Map option and create a new project.\nClick the Map tab and use the Add Data button to add Hudson_tracts_unemp_2017 (the unemployment rate by census tract) from the folder Data\\Final Exercise.\n\nRight click on the name of the data layer and select Properties > Source > Spatial Reference. We can see that the coordinate system is NAD 1983 and the unit is a Degree so we'll want to change this to a projected coordinate system that uses a linear unit like meters.\nOpen the Geoprocessing pane if it is not already open (View > Geoprocessing).\nSearch for the project tool. Click the Project tool that is part of the Data Management Tools.\nComplete the information specified below.\nInput: Hudson_tracts_unemp_2017\nOutput: Save the output dataset to your working folder.\nOutput Coordinate System: Click the button to the right of the text box and search for 'new jersey' as shown.\n\nWe could choose from any number of map projections. Expand the folders: Projected Coordinate Systems > State Plane > NAD 1983 (US Feet). Select the NAD 1983 StatePlane New Jersey FIPS 2900 (US Feet) projection. Since it is specific for New Jersey, distance will be fairly accurate in this area.\nClick OK to close the Coordinate System box and then Run. The new data layer should be automatically added to your map. It will look identical to the old layer but have a different internal projection. ArcMap automatically aligns data with different projections.\nRemove the original data layer.\nSpatial Autocorrelation\nSpatial Autocorrelation is a statistical technique that identifies clusters of low or high values by comparing the value of each feature to that of its neighbors.\nClick the back arrow to return to the Geoprocessing search box. Search for the Cluster and Outlier Analysis tool. Open it.\nFill in the information as below:\nInput: projected unemployment data layer\nInput Field: Unemp_rate\nOutput: working folder\nConceptualization: Inverse Distance (assumes that closer features are more influential than ones further away)\nDistance method: Euclidean\nStandardization: Row\nClick Run.\nAfter you run the tool you should see results similar to these. You may also see a warning that tells you the distance used to define neighborhoods. To make the map look less distorted, right click on Map in the Contents pane and select Properties > Coordinate Systems. Scroll up and expand Layers and select the NJ state plane coordinate system. Click Ok.\n\nLook at the legend in the Contents pane.\nWhere is there statistically significant clustering of high unemployment? Low unemployment?\nIs this what you expect based on the original data? You can change the symbology in the Properties menu of this layer to visualize the unemployment rate.\nSave your project using the save icon in the upper left.\nBased on this information, where might you build?\n_______________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nExamine proximity to transportation\n\nMake a Multiple Ring Buffer\nIn this part of the exercise, you will be looking at proximity to the PATH station on the line that runs to the World Trade Center in Manhattan.\nTurn off all the data layers.\nAdd the following data layers from Data\\Final Exercise:\nPathStation\nStreets\nNotice the point that shows where the PATH station is. Feel free to change the color or make it larger so it is easier to see. The street network is also on the map.\nSearch for and open the Multiple Ring Buffer tool in the Geoprocessing pane.\nEnter the information specified below. Notice the 5280, 10560, 15840, and 21120 values are 1, 2, 3, and 4 miles as the path station is projected in a New Jersey State Plane projection in feet. Click Run.\n\nClick on the new layer to highlight it in the Contents pane once it is added to the map. Click the Appearance tab at the top of the screen and move the transparency slider in the Effects group to about 50%.\nApproximately how much of Jersey City are within 1 miles of the station? 3 miles? Is this an accurate representation of distance from the Path Station?\nTurn off the street data to better see what is within each of the distance rings.\nYou can use the Network Analyst tools in ArcGIS Pro to create buffers (called service areas) based on a road or other networks to increase the accuracy of your estimates. This tools will take into account the roads you will need to travel on to get from one place to another. To save time we won't do that as part of this exercise, but you can learn more here:\nhttps://pro.arcgis.com/en/pro-app/tool-reference/ready-to-use/itemdesc-generate-service-areas.htm\nhttps://pro.arcgis.com/en/pro-app/help/analysis/networks/service-area-tutorial.htm\nWe previously created a service are for you. Add the network_buffer data layer to your map.\nTo show the different service area distances, we'll change the symbology. Right click on the network_buffer layer name and select Symbology.\nChoose Unique Values from the dropdown menu.\nIn the Field 1 drop down menu, select ToBreak, which indicates the furthest distance covered by the service area.\nClick the Color scheme drop down menu and select a color scheme.\nHow do the buffer and service area differ? If you wanted this new building to be close to the train station, where might you choose to build?\n__________________________________________________________________________________________________________________________________________________________________________\nExamine Terrain\nAdd Raster Data\nYou have now explored some of the tools available for analysis of vector data. Now let's explore what can be done with different types of the raster data.\n\nThis section will use elevation data which is developed from satellite imagery. If you are interested in learning more about satellite imagery and image processing see the Introduction to Satellite Remote Sensing Workshop.\n\nProject Raster\nBefore performing analyses it's always a good idea to make sure the data is in a projected coordinate system if it may be necessary to use the tools.\nAdd Elevation from the Final Exercise folder. It may take a minute to load. Elevation represents elevation from the ASTER sensor aboard the Terra satellite. Turn off any data layers that you do not need.\nGo back to the Geoprocessing search pane and find the tool \"Project Raster\".\nUse the Elevation layer as your Input Raster.\nSave the output raster to your working folder using an intuitive name. In many cases rasters need names that are 13 characters or less when working in Pro.\nFrom the Output Coordinate System dropdown menu, select the projected unemployment data to convert the raster to the same projection. Click Run.\nRemove the old elevation data from the map.\n\nExtract by Mask (aka clip raster)\nBackground Information:\nWhoever named this tool, decided against \"clip for raster\" which arguably would have been more intuitive to the majority of people. Alas, the name \"extract by mask\" while less intuitive, draws upon image processing terminology and also hints at an interesting underlying process taking place. As you would have learned in Introduction to GIS, vectors and rasters have some key differences. Vectors have defined coordinate boundaries, while rasters use cell values in a grid of rows and columns. When you clip a vector, you are in a way moving the coordinates to new locations. However, when you try to clip a raster it must remain as a rectangular grid. To have it appear as though you have \"clipped\" out certain sections, \"extract by mask\" replaces pixels/cells that fall outside the boundary used (aka \"mask\") with NoData values, visualized using NoColor and therefore making the raster appear clipped. To check that this is the case after running the tool, click on a pixel and see its values.\nRight click the projected elevation raster and select Zoom to Layer to see its full extent. As you can see, satellite imagery is often provided at large scales, which can be reduced to be easier to work with.\nSearch for and open the \"Extract by Mask\" tool.\nWe will use the tracts as the mask, so input the following:\nInput raster: projected elevation raster\nInput raster or feature mask data: projected Hudson unemployment tracts\nOutput raster: Save your output raster to your folder using an intuitive name.\nClick Run. The resulting layer has been masked so that all pixels outside the tracts have no value and those inside are symbolized with a black and white color ramp stretched from the min to max values.\nCreate Contour Lines\nContour abstracts a digital elevation surface into lines representing different elevations. Lines can be easier to overlay on top of other datasets without covering them up as a raster surface would. They can also help clarify visual trends in a way that a surface can be difficult to observe.\nSearch for and open the Contour (Spatial Analyst) tool.\nUse the following inputs:\nInput raster: the clipped/masked elevation\nOutput feature class: Save with an appropriate name. (e.g. elev_contours_15ft)\nContour interval: Start with 15ft (the unit is based on the projection of the layer).\nClick Run.\nIf you want, try a few other values for your contours, remembering to save names appropriately.\n\nWhile you can build in any location, flatter areas may be easier to access for people who are walking. Also keep in mind that areas of low elevation that are close to water may be more prone to flooding. Looking at the original elevation data and contour lines, what areas may you want to build in?\n_______________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nSelect an area in which to build and add a point\n\nUsing all the information you gathered with the processing tools, select an area (or areas) that could be potential building sites. You will add a point (or points) to represent these areas.\nOpen the ArcCatalog pane (View > Catalog Pane).\nNavigate to your working folder in the Folders menu of ArcCatalog. If you don't see the folder, right click on Folders and select Add Folder Connection. Navigate to the main folder containing your output data.\nRight click on your work folder > New > Shapefile.\n\nFeature Class Name: Choose a name for your new shapefile.\nGeometry type: point.\nCoordinate System: From the dropdown choose the projected unemployment layer so that the coordinate system will be the same as the other layers in our map\nClick Run.\n\nThere are currently no features in the layer. Accordingly, the attribute table of your point layer is blank, with the exception of a few fields that ArcGIS adds by default and generates automatically for features. We're going to create features for this layer.\nClick on the new building layer in the Contents pane so it is selected.\nIn the Edit tab at the top of the screen, select the Create tool in the Features group.\nClick the building layer and select the Point tool.\n\nEach time you click on a location on the map, it will add a point.\nAdd your point(s).\n\nWhen you are finished, click the Finish button at the bottom of the map.\n\nClose the Create Features pane.\n\nAn actual building was built at 65 Bay Street. Add the data layer, \"Bay_street_building\" from the Final Exercise folder. Is there where you chose to build?\nThere are a lot of factors we did not consider, such as available lots, cost of building, etc., which went into choosing the Bay street building site. However, it was also deemed an area of high unemployment by selectively showing data from nearby census tracts. You can read more here.\nResources for learning more\nSpatial Statistics: https://pro.arcgis.com/en/pro-app/tool-reference/spatial-statistics/an-overview-of-the-spatial-statistics-toolbox.htm\nNetwork Analyst: https://pro.arcgis.com/en/pro-app/tool-reference/network-analyst/an-overview-of-the-network-analyst-toolbox.htm\nSpatial Analyst: https://pro.arcgis.com/en/pro-app/tool-reference/spatial-analyst/an-overview-of-the-spatial-analyst-toolbox.htm\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n\nRES.STR-001 Geographic Information System (GIS) Tutorial\nIAP 2022\n\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms"
    },
    {
      "category": "Resource",
      "title": "GIS Level 2 ArcGIS Pro Workshop Exercises (DOCX)",
      "type": "DOCX",
      "source_url": "https://ocw.mit.edu/courses/res-str-001-geographic-information-system-gis-tutorial-january-iap-2022/mitres_str001iap22_level2_arcgispro.docx",
      "content": "GIS Level 2: ArcGIS Pro Workshop Exercises\nExercise 1: Map projections\nMap projections, also called Coordinate Reference Systems (CRS) can be viewed or changed using GIS software.\nExamine the data in GIS_Level2_Data\\workshop_exercise. Is there a projection file for each dataset?\nNote that cambridge_dem is a raster dataset and uses a .tfw file (known as a \"world\" file), which contains the information needed to transform image coordinates to real-world coordinates. Shapefiles use a .prj file, which includes the coordinate system information.\nOpen ArcPro. Click the Map option under Blank Templates and save it to your working folder.\nAdd the following two data layers from GIS_Level2_Data\\workshop_exercise\nMBTAbusroutes\nCambridgePlaygrounds\nRight click on CambridgePlaygrounds and select Zoom to Layer.\nDo the playgrounds and bus routes seem to be in the correct locations?\nThey should be since both layers had a defined projection (.prj) file.\n\nRight click on CambridgePlaygrounds and select Properties.\nSelect the Source tab and expand Spatial Reference.\nWhat is the coordinate reference system?\nThere are two, a projected coordinate system of NAD83 / Massachusetts Mainland (ftUS) and a geographic coordinate system of NAD 1983.\n\nDo the same for the MBTAbusroutes data layer. What is the coordinate reference system?\nClose the Properties box and select the Analysis tab and Tools.\nSearch for Project and open Project (Data Management Tools).\nWe will use the Project tool to change the projection of the playgrounds so that it is the same as that of the bus routes. There is also a tool called Define Projection that is used to assign a projection to a data layer that does not already have one or has one that is incorrect. Our map projections appear to be correct so we do not need to use this tool.\n\nAlthough not always required, your analysis results may be more accurate if your data layers are in the same projection. If you want to calculate the proximity of playgrounds to bus routes, you would first want to make sure the projections of both data layers are the same.\n\nChoose playgrounds as the Input Dataset.\nSave your output dataset in your working folder.\nClick the Output Coordinate System dropdown menu and select MBTAbusroutes. ArcGIS Pro will automatically fill in the coordinate system of NAD_1983_StatePlane_Massachusetts_Mainland_FIPS_2001.\nClick Run.\n\nAdd the data layer to your map if it was not added automatically.\nExercise 2: Access basic analysis tools\nTools can be accessed in a variety of ways in ArcGIS Pro:\nA subset of tools are located on the Analysis tab.\nSome tools are available by right clicking a layer.\nClick (Analysis > Toolbox) or (View > Geoprocessing) to see all available tools. You can search for a tool by name or click the Toolboxes tab and open a specific toolbox. This is a good way to see the different types of tools available to you.\nAdd MBTA_NODE to the map from GIS_Level2_Data\\workshop_exercise.\n\nClick View > Geoprocessing and search for the buffer tool.\nOpen Buffer (Analysis Tools).\nHow do you know what each input and parameter should be or if you need it? Try clicking the question mark to learn more about this tool and its parameters.\nSelect the MBTA_NODE as your Input Features from the dropdown menu. Choose a location to save your buffers in the Output Feature Class box.\nEnter a Distance of 1000 meters and Run the tool.\nTurn off your buffers after you have looked at the layer.\nThe interface for all tools looks similar in ArcGIS Pro, with most requiring input data, an output location, required parameters, and optional parameters.\nExercise 3: Use raster tools\nDifferent tools can be used with raster data versus vector data, although the output could be a vector, raster, or table, depending on the tools. There are also tools that allow you to convert from one data type to another.\nAdd the cambridge_dem.tif to your map. It may take a minute to load.\nWe will start by changing the symbology so it is easier to see, which you may remember from GIS Level 1.\nRight click on the cambridge_dem and select Symbology.\nChange the Primary Symbology dropdown to Stretch.\nClose the Symbology window when you are finished.\nOpen the Geoprocessing window if it is not already. Search for contour. Open Contour (Spatial Analyst Tools).\nSelect the dem as your Input raster and choose an output location.\nType 5 for the Contour interval. What are the units of this interval? How might you figure it out?\nClick Run.\n\nYou will notice that the output is a vector line layer, which could then be exported to other programs or used as input for vector analysis tools.\nExercise 4: Use the spatial statistics toolbox\nAs mentioned above, toolboxes can be a good way to learn about the variety of tools available to you and to also find tools that are similar to others.\nAdd the file median_income_suffolk_ma to the map.\nClick View > Geoprocessing to open the Geoprocessing window.\nClick the Toolboxes tab and expand Spatial Statistics Tools > Mapping Clusters. Open Cluster and Outlier Analysis (Anselin Local Moran's I).\nChoose median_income as the Input Feature Class. Use VALUE0 as the Input Field, which is the median income value. See the text file in the workshop_exercise folder for the attribute field information.\nChoose an output name and location.\nLeave the default values for now. In the future you have the option of changing the parameters to define neighborhoods in different ways. Run the tool.\nAt the bottom of the tool window, a box indicates that the tool ran with warning. Click the View Details link to read more about this. The warning indicates that the tool used a value of 2266 meters to define the neighborhood, which is determined to be optimal for our data based on the inverse distance relationship. Close the Detail window.\nWhere are there clusters of high and low income? The tool has also output a histogram and scatterplot that you can examine by double clicking on them. Turn off the income data layers when you are finished examining them.\nThe Moran scatter plot provides a classification of spatial association into four categories, corresponding to the location of the points in the four quadrants of the plot. These categories are referred to as High-High, Low-Low, Low-High and High-Low, relative to the mean, which is the center of the graph.\nYou can learn more about the statistics used in the Moran's I calculation here:\nhttps://pro.arcgis.com/en/pro-app/tool-reference/spatial-statistics/h-how-cluster-and-outlier-analysis-anselin-local-m.htm\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n\nRES.STR-001 Geographic Information System (GIS) Tutorial\nIAP 2022\n\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms"
    },
    {
      "category": "Resource",
      "title": "GIS Level 2 Instructions (DOCX)",
      "type": "DOCX",
      "source_url": "https://ocw.mit.edu/courses/res-str-001-geographic-information-system-gis-tutorial-january-iap-2022/mitres_str001iap22_level2_instructions.docx",
      "content": "GIS Level 2 Setup Instructions\n\nThank you for registering for GIS Level 2. Before the workshop, please do the following:\nDownload and install either ArcGIS Pro or QGIS & Geoda\nInstall 7-zip if necessary.\nDownload all workshop materials.\nUpdate and setup Zoom. (Your version of Zoom MUST be up-to-date in order to use the breakout rooms effectively.)\nDownload and install ArcGIS Pro or QGIS & Geoda\nQGIS is a free, open source software program that will work on any operating system and doesn't take up much space on your computer. While it has many of the same capabilities as ArcGIS Pro, there are some analyses you can't do in QGIS and it tends to have more bugs. QGIS has limited tools for spatial statistical analysis, so you can use another free, open source program, Geoda, along with it.\nArcGIS Pro is a commercial software from ESRI that we have a subscription for at MIT. It only runs on Windows and requires an account or a connection to the MIT license server to run. It includes a full suite of GIS tools, but may not run well if you have a slower computer.\nIf you are not sure which software to use, this website has a lot of additional information: https://gisgeography.com/qgis-arcgis-differences/\nNote: This workshop will NOT use ArcGIS Desktop/ArcMap, only ArcGIS Pro, the newest GIS software from ESRI.\nArcGIS Pro installation\n1. Create an ArcGIS Online (AGOL) account: https://libguides.mit.edu/gis/webmap#s-lg-box-wrapper-5115587\n2. If you have not already downloaded Pro, log into your AGOL account. From your account page, click your name in the upper right and select My settings > Licenses and click download next to ArcGIS Pro.\n3. After installing Pro, choose the Named User License type and select ArcGIS Online. You'll then see the same login screen that you used to create your account.\nQGIS Installation\nFull instructions and links for installing QGIS for a number of different operating systems can be found here: http://qgis.org/en/site/forusers/download.html\nDownload the most recent version of the software. Windows users should download the Standalone option. If you already have QGIS installed, we have tested the workshop exercises with versions 3.16 and higher so we recommend upgrading if you are using an older version.\nGeoda Installation (install if using QGIS for the workshop)\nDownload links for a variety of operating systems are listed here:\nhttps://geodacenter.github.io/download.html\n7-zip installation\nWorkshop files (and most GIS data) are in zipped folders. Most Windows computers have the option to extract data by right clicking and most Macs will automatically extract data. Occasionally your computer may not have a built-in data extraction tool. In this case we recommend installing 7-zip: https://www.7-zip.org/\nWorkshop materials\nDownload all workshop materials.\nMaterials include the presentation, workshop exercises, take-home exercise, and all required data.\nZoom setup\nMake sure your Zoom app is up-to-date using these instructions: https://support.zoom.us/hc/en-us/articles/201362233-Upgrade-update-to-the-latest-version\nIf you have access to a second monitor (or a second \"smart\" device that can connect to a Zoom session) it may greatly improve your workshop experience and make it easier to follow the instructor and complete the exercises simultaneously. If not, it is still doable, for example, by organizing your screen in this way: https://raw.githubusercontent.com/hbctraining/bioinformatics_online/master/guidelines/img/Screenshot%202020-03-23%2015.21.10.png\nWe encourage participation during the session and kindly ask you to use your video, if possible.\nMute audio except when talking (Tip: you can temporarily unmute yourself by pressing and holding a space bar. When it is released, Zoom goes back to the mute mode).\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n\nRES.STR-001 Geographic Information System (GIS) Tutorial\nIAP 2022\n\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms"
    },
    {
      "category": "Resource",
      "title": "GIS Level 1 Presentation Slides (PDF)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-str-001-geographic-information-system-gis-tutorial-january-iap-2022/mitres_str001iap22_level1_pres.pdf",
      "content": "GIS Level 1: Introduction\nto GIS & Mapping\nCourtesy of US Air Force. Image is in the public domain.\n\nOutline\n- Introduction - What is GIS?\n- Software options\n- Applications\n- Understanding Maps & Data\n- Data Layers\n- Spatial Data Types\n- Characteristics of Spatial Data\n- Metadata\n- Making Great Maps - Data Visualization Principles\n\nINTRODUCTION\n\nGeographic Information System\n\"A system for\ncapturing, storing, checking, integrating,\nmanipulating, analyzing and displaying\nspatial data\"\n\nGeographic Information System\n\"A system for\ncapturing, storing, checking, integrating,\nmanipulating, analyzing and displaying\nspatial data\"\n\nInput: spatial data\nGIS/Mapping Software:\nanalysis and data\nvisualization\nDoes not\ncome with its\nown data\nOutput: new data and maps\n\nas digitized themed data \"layers\"\n(e.g. boundaries, socioeconomic, hydrology,\ninfrastructure, transportation, land use/cover)\nassembled in any combination\nand overlaid for analysis\nTheoretical Overview\nGIS recreates real world spatial data\nImage (c) source unknown. All rights reserved. This content is\nexcluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/\n\nassembled in any combination\nand overlaid for analysis\nTheoretical Overview\nGIS recreates real world spatial data\nas digitized themed data \"layers\"\n(e.g. locations, boundaries, infrastructure,\nsocioeconomic hydrology, land use/cover)\nImage (c) source unknown. All rights reserved. This content is\nexcluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/\n\nand overlaid for analysis\nTheoretical Overview\nGIS recreates real world spatial data\nas digitized themed data \"layers\"\n(e.g. locations, boundaries, infrastructure,\nsocioeconomic hydrology, land use/cover)\nassembled in any combination\nImage (c) source unknown. All rights reserved. This content is\nexcluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/\n\nTheoretical Overview\nGIS recreates real world spatial data\nas digitized themed data \"layers\"\n(e.g. locations, boundaries, infrastructure,\nsocioeconomic hydrology, land use/cover)\nassembled in any combination\nand overlaid for analysis\nImage (c) source unknown. All rights reserved. This content is\nexcluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/\n\nSOFTWARE\n\nTypes of GIS & Mapping Software\nType\nAnalysis Power\nExample(s)\nGeobrowser\nWeak\n(mainly only to display data)\nGoogle Maps, Google Earth,\nApple Maps, Waze, etc.\nWeb-based\nDesktop\nMedium\n(able to upload additional\ndata, customize display, and\nperform basic analyses)\nStrong\n(installed locally, provides full\ncontrol of map creation, and\nperform advanced analyses)\nCarto, ArcGIS Online, Mapbox,\nGoogle MyMaps, etc.\nArcGIS Pro\nQGIS\n\nWhich desktop software should you use today?\nArcGIS Pro (by ESRI)\n-\nCommercial software (expensive\nto purchase)\n-\nOnly runs on Windows\n-\nLarger program - can run slowly\non some computers\n-\nFull set of GIS functions and tools\n-\nIntegration with ArcGIS Online\n-\nFully developed training program\n(online modules, written\ntutorials, MOOCs)\n-\nComprehensive support (direct\nsupport from ESRI,\ndocumentation for every tool)\nQGIS\n-\nFree, open-source tool\n-\nRuns on any operating system\n-\nSmaller program that will not\naffect performance of your\ncomputer\n-\nMany available tools, but lacking\nsome for specific functions, such\nas network analysis (i.e. routing)\nand spatial statistics\n-\nBasic tutorials by QGIS developers\nand users\n-\nTools can be developed by anyone\nso performance and\ndocumentation is inconsistent.\n-\nSupport via forums\n\nGIS APPLICATIONS\n\nView Imagery\nCity of Cambridge Aerial Photograph, April 2010\nCheck out our workshops\non Remote Sensing &\nImagery\nImage (c) source unknown. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nCreate 3D models\nWe have additional\n3D software: AutoCAD,\nRhino, PhotoScan, etc.\n\nCreate Maps\nCourtesy of US Census. Image is in the public domain.\nMaps\ncombine\nart & science\n\nConduct Analyses\nAnalyze values\n(Spatial Statistics)\nCreate data\n(Buffer tool)\nEdit geometry\n(Clip tool)\nLearn these tools and more\nin our GIS Level 2 workshop\nCrime hotspots (c) Scott & Warmerdam. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nUNDERSTANDING MAPS & DATA\nYou may have been looking at geospatial data for a long time\n\nUnderstanding data 'layers'\nWhat individual data layers were used to create this map?\n(c) Google. All rights reserved. This content is excluded from our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/\n\nUnderstanding data 'layers'\nWhat individual data layers were used to create this map?\nStreet network\nParks and other open space\nT stops with label\nBodies of water\nPoints of\ninterest\nGoogle maps is\na 'Geobrowser'\n(c) Google. All rights reserved. This content is excluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/\n\nMAPS & DATA:\nSPATIAL DATA TYPES\n\nGeospatial Data Types\nGeospatial or coordinate data can\nbe represented in two different\ndata formats:\nVector:\ne.g. points, lines, and polygons\nRaster:\ne.g. row and column matrix\nImages (c) University of Washington. All rights reserved.\nThis content is excluded from our Creative Commons\nlicense. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/\n\nData Types: Vector versus Raster\nVectors are composed of\ncoordinates\nRaster's are composed of pixels\nThese are often used for variables with:\ndefined borders, e.g. manmade continuous surface, e.g. environmental\nImage courtesy of Zina Yonten. Used under CC BY-NC.\n\nData Types: Vector examples\nPoints\nLines\nPolygons\n(Combined)\n\nData Types: Vector mapping\nVectors have a frontend geometry\n- In this example the geometry\nrepresents state polygons\n\n- Here each row (stat\nsymbolized by 'NA\n(categorical variabl\nVectors have a backend database,\nnormally called an 'attribute table'\n- rows represent\nunique geometries\n(e.g. state polygons)\n- columns represent\na number of variables\n(theoretically infinite)\ne) is\nME'\ne)\nData Types: Vector mapping\n\nData Types: Vector mapping\n- Here each state is\nbeing symbolized by\n'NAME'\n(qualitative variable)\nVectors have a backend database,\nnormally called an 'attribute table'\n\nVectors have a backend database,\nnormally called an 'attribute table'\nData Types: Vector mapping\n- Here each state is\nbeing symbolized by\n'POP_PER_SQMI'\n(quantitative variable)\n\nData Types: Vector file formats\n- The shapefile is the most common vector file\nformat.\n- \"A\" shapefile is actually a collection of several\ndifferent files with different extensions.\nMake sure to keep all\nfiles together when\nmoving.\nShapefile =\n.shp .shx\n.sbx\n.dbf\n.prj\nWhen adding files to\nArcGIS Pro, you will\nonly see one file, not\nevery extension.\n\nData Types: Raster\nRaster data includes aerial photographs, digital\nelevation models, and scanned maps.\n(Remember these are constructed from pixels)\n\nRaster data have a frontend cell matrix\n- Where each cell has its own value\n- A raster can only symbolize one\nvariable at a time\nData Types: Raster mapping\n\nData Types: Raster mapping\nRaster data have a frontend cell matrix\n- Here each cell/pixel is being\nsymbolized by elevation value\n\nData Types: Raster mapping\nRaster data have a backend database,\nnormally called an 'attribute table'\n- rows represent unique values\n(1m, 2m, 3m, etc.)\n- columns have\nspecific variables\n1) unique 'ROW ID'\n2) unique 'VALUE'\n3) 'COUNT' of pixels\nwith that 'VALUE'\n\nData Types: Raster file formats\nThere are many different raster file extensions,\nincluding common image formats.\n.tiff\n.asc\n.img\n.jpg\nLearn more about raster\nSome formats may include a\nformats in this ArcGIS Pro\ncollection of files with different\ndocumentation. QGIS supports\nextensions, similar to a\nsimilar formats.\nshapefile.\n\nData Types: Tabular\nTabular data can be transformed\ninto spatial data in two ways:\n1. Joining\n- Use a shared unique identifier (GEOID, name, etc.) to\nmatch up tabular data to the spatial data's attribute table.\n2. Geocoding\n- Use lat/lon coordinates in table to plot as points on map\n- Use addresses to plot locations based on a street network\n\nData Types: Tabular file formats\nGIS software can read commonly used tabular formats in\norder to transform them into spatial data.\n.csv\n.xlsx\n.dbf\nShapefiles include a\n.dbf, which is a\ntabular format that\ncan be opened in\nQGIS cannot read Excel file\nother software, like\nformats.\nExcel.\n\nGeodatabases\n- ESRI/ArcGIS storage system\n- a collection of geographic datasets of\nvarious types held in a common file\nsystem folder\n- Advantages: larger files size limits,\nfaster processing time when using\nanalysis tools\n- Disadvantages: can only be opened\nin ESRI software\n- Learn more about using\ngeodatabases in Pro.\n\nOther data formats\nGIS can import and convert data produced in other formats:\n- KML / KMZ files (Google Earth)\n- DXF / DWG (CAD)\n- NetCDF (scientific data)\n- LAS (Lidar)\n- GPX (GPS units)\n- Geojson\nGIS software can export many formats:\n- Adobe Illustrator\n- KML\n- CAD\n- TIF\nmany types of data\nvisualization software.\n- JPG\nThe GIS & Data Lab has\n\nCommon Associated Workflows\nSatellite\nRemote Sensing\n3D Modeling &\nPhotogrammetry\nGIS\n- Processed imagery as rasters or vectors\n(e.g. enhancements, classifications)\n- Raw Imagery for basemaps\n- Processed imagery as rasters or models\n(e.g. orthophotos, DEMS, 3D models)\nStatistical\nAnalysis\n- Attribute tables for running analyses,\n(e.g. regressions, predictions)\nVisual Design\n(e.g. Illustrator)\n- Maps for improved design aesthetics\n\nExercise 1\n- Goals:\n- Become familiar with the GIS interface\n- Learn how to add data\n- Explore data types & attributes\n- Complete either the QGIS or ArcGIS Pro\nexercise from your workshop folder.\n\nMAPS & DATA:\nCHARACTERISTICS OF SPATIAL DATA\n\nGeneralization\n- The most detailed data available - e.g. resolution of coastline data\nis not suitable for all purposes\nfor this map is scale dependent\n(or often a manageable file size)\n- Red: county map\n- Blue: town map\n\nAbstraction\nThe process of reducing data from its complete state to\nwhat is necessary for use and presentation\n\nQuiz: Which data symbology (pictured above)\nwould you select for each of the following maps?\n- Land use study of adjacent property\n- Development map of the airport\n- National map of airports\n\nSpatial Resolution/Scale\nSuitable data geometry is dependent on scale:\ne.g. roads are polygons at local scale but lines at national scale\n(c) Google. All rights reserved. This content is excluded from our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/\n\nTemporal Resolution\n1977 to 2006\nKeep in mind temporal resolution when obtaining data\n(c) Google. All rights reserved. This content is excluded from our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/\n\nback to when starting\na project\nSearching for Spatial Data\n- Look in general GIS data repositories\n- Search the internet\n- Include \"gis\", or \"data\" in the search terms\n- Search by location and/or topic\n- Search for country statistical agencies or open data\nsites (large cities often have their own open data\nportals as well)\n- Contact GIS departments, universities, or researchers\nin your area of interest.\n- Search for articles on your topic and look for the\nsources of the data.\nGreat slide to refer\n\non our website.\nFind many more\nRepositories and Websites\nLibguides.mit.edu/gis\n- Can also find by googling 'MIT GIS', first result\n- Click on Find Data Tab for a list of resources, including\nan assembled links of common data sources per topic.\nGeodata.mit.edu (Geoweb)\n- Includes data licensed freely or restricted to MIT and\nother institutions, plus CDs and DVDs in the GIS lab.\n- MIT instance is mainly historical-local or purchased data.\nOpenStreetMap.org\n- Crowd-sourced maps; content will vary by location\n- Download as a shapefile via http://www.geofabrik.de/\n- Best source to start for rural international data.\n\nMAPS & DATA:\nMETADATA\n\nWhat is Metadata?\nUse metadata to learn\nhow and why the data\nwere created, access\nrestrictions, columns in\nthe attribute table, and\nmuch more!\n\nMetadata Examples\n1. MassGIS:\nhttps://www.mass.gov/info-details/massgis-data\nmarine-beaches\n2. GeoWeb: geodata.mit.edu/catalog/mit\nw37ehgh6nvl4w\n3. City of Boston:\nhttps://data.boston.gov/dataset/traffic\nsignals\n\nMAKING GREAT MAPS:\nDATA VISUALIZATION PRINCIPLES\n\nMaking Great Maps\n- Cartography is the art and science of making maps\n- Maps are always simplifications of reality, which makes\nthem helpful when making decisions or explaining patterns\n- Maps are designed by people (who have intentions),\nso we have to create them responsibly\n\nMaking Great Maps\nFrom: Making Maps: A Visual Guide to Map Design for GIS by John Krygier and Denis Wood\nExample of how a map can be used to prove many different points.\nHowever in the past only those in power had the software and data to do so.\nImages (c) John Krygier and Denis Wood. All rights reserved. This content is excluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/\n\nThree Key Questions\n1. Who wants the map?\n- e.g. experts (detailed), students (contextual), the community (interactive)\n2. Where will it be seen?\n- e.g. 8x11 paper (static small, room for main points)\n- e.g. 30x40 poster board (static large, room for detail)\n- e.g. web map (interactive, users control navigation of map)\n3. What is it's purpose?\n- e.g. to show a variable through time (time series)\n- e.g. to show change over time (change detection)\n- e.g. to combine multiple variable into an index to pick best/worst\n(sustainability/risk/vulnerability mapping, site selection)\nEach question deserves a well-thought answer before mapping\n\nFigure 5.3\nMap Design Process\nStart with assembling the\ndata from multiple sources\nNext choose the data,\nanalyses, & symbolization\nLastly insert the title, legend,\nnorth arrow, scale bar, & labels\n\nVector Symbolization\nFrom: Making Maps: A Visual Guide to Map Design for GIS by John Krygier and Denis Wood - makingmaps.owu.edu\nSee our tutorial for additional\nColorbrewer provides\naccessible color options.\n\"Cartography Tips\".\nImages (c) John Krygier and Denis Wood. All rights reserved. This content is excluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/\n\nRaster Symbolization\n\nChoosing Color Tips\nMatch the type of data to the type of color scheme:\n- Qualitative (categories)\n- Quantitative (numbers)\nImages (c) Morphocode. All rights reserved. This content is excluded from our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/\n\nQualitative Color Example\nDoes this\nmake sense\nfor the data?\n(c) Pennsylvania State University. All rights reserved. This content is excluded from our Creative Commons license. For more information,\nsee https://ocw.mit.edu/help/faq-fair-use/\n\nSequential Color Example\nDoes this\nmake sense\nfor the data?\n(c) Pennsylvania State University. All rights reserved. This content is excluded from our Creative Commons license. For more information,\nsee https://ocw.mit.edu/help/faq-fair-use/\n\nDiverging Color Example\nDoes this\nmake sense\nfor the data?\n(c) Pennsylvania State University. All rights reserved. This content is excluded from our Creative Commons license. For more information,\nsee https://ocw.mit.edu/help/faq-fair-use/\n\nCommonly used map type: Choropleth\nThese use different shading and coloring to display\nthe quantity or value in defined areas.\n(c) Alyson Hurt and Katie Park/NPR.\nAll rights reserved. This content is\nexcluded from our Creative\nCommons license. For more\ninformation, see\nhttps://ocw.mit.edu/help/faq-fair-\nuse/\n\nChoropleth map choices\n1. Number of Classes\n- Aggregates data for display\n- More classes = more variation\n(best to have no more than 7)\n2. Classification Method\n- Data classification is how\ndata is arranged into\nseparate classes.\n- Major types\n- Equal Intervals\n- Quantile (Equal Count)\n- Natural Breaks\n- Defined Intervals\n\nClassification Methods\n- Equal Interval = classes have equal ranges\n- Quantile = classes have equal counts\n- Natural Breaks = optimizes class variation\n- Manual = you define classes\nNote: each has pros/cons to their usage,\nfor \"Choropleth Classification Methods\" use this link:\nhttps://libguides.mit.edu/gis/tutorials#s-lg-box\nwrapper-4119325\n\n2020 % population over 65\nNatural\nbreaks\nQuantile\nEqual\ninterval\n\nExercise 2\n- Goal:\n- Learn how to symbolize different types of data\n- Complete Exercise 2 for either QGIS or ArcGIS\nPro.\n\nMap Layout Design Example\nOverview:\n- Map layout design is about\ndeveloping a balanced arrangement\n- Maps, title, legend, scale bar, labels,\netc. all need relative positioning & sizing\n- Goal is to design the map layout to\nsupport your design questions\n- Who wants the map\n- Where will it be seen\n- What is its purpose\nFrom: Designing Better Maps: A Guide for GIS Users by Cynthia A. Brewer\nImage (c) Cynthia A. Brewer. All rights reserved. This content is excluded from our Creative Commons license. For more information,\nsee https://ocw.mit.edu/help/faq-fair-use/\n\nMap Layout Design Example\nTips:\n- Inset/locator maps are often placed in the\ntop/bottom corners (e.g. continent view\ntop left and zoomed view in bottom\nright).\n- Main map often placed in center (usually\nlargest & most detailed).\n- Legend is tucked into the main map for easy\ncomparison with the data.\n- Scale bars and north arrows shouldn't be a\ndistraction from the main map.\n- Sources should run along the bottom.\nFrom: Designing Better Maps: A Guide for GIS Users by Cynthia A. Brewer\nComplete the take-home\nImage (c) Cynthia A. Brewer. All rights reserved. This content is excluded\nexercise to learn more.\nfrom our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/\n\nTAKE-HOME EXERCISE\n\nExercise Overview\nQuery and use unemployment and transportation\ndata to create a map that helps you decide where\nto build a mixed use facility.\n1. Navigate the software interface\n2. Find and add data, including basemaps\n3. Access and explore attribute information\n4. Symbolize data layers, for vector and raster\n5. Select data by attributes and spatial location\n6. Design a simple map for export\n\nBoburg, S. (2017, May 31). How Jared Kushner built a luxury skyscraper using loans meant for job-starved areas. Washington Post. Retrieved from\n(c) The Washington Post. All rights reserved. This content is excluded from our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nRES.STR-001 Geographic Information System (GIS) Tutorial\nIAP 2022\nFor information about citing these materials or our Terms of Use, visit:\nhttps://ocw.mit.edu/terms"
    },
    {
      "category": "Resource",
      "title": "GIS Level 1 Presentation Slides with Notes (PDF)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-str-001-geographic-information-system-gis-tutorial-january-iap-2022/mitres_str001iap22_level1_presentation_notes.pdf",
      "content": "GIS stands for geographic information system but what does that really mean?\nA GIS system can do a lot of things.\n\nThe most important thing to know is that a GIS is a system works with spatial data.\n\nGIS software works upon the data you provide it.\nJust like other software, such as Excel or Word, you need to input data and can then\nuse the software to display and analyze that data.\n\nGIS software recreates or reproduces the real world as spatial data.\n\nMore specifically, the spatial data is broken down into themed data \"layers\" such as\nlocations, boundaries of various kinds, socioeconomic variables, hydrology, and land\nuse/cover.\n\nThese data layers can be assembled in any combination you want, depending on what\nyou want to highlight.\n\nPower of GIS is in the ability to detect trends and make quantified decisions that would\nhave otherwise been difficult just by hand or eye.\nOnce they have been overlaid in a particular combination, you can then conduct\nanalyses.\n\nThe software you choose depends on what you will be doing with the data (displaying it vs.\ncreating a new map vs. conducting analysis), the size of the data (large datasets require\nstorage), and your audience (is it best to present the map on paper? Online? Do people need to\ninteract with it?).\nThere are three types of software with very different capabilities.\n1. Geobrowsers like Google Maps and Apple Maps are generally only useful for displaying data.\n2. Web based tools like Carto, ArcGIS Online, and Mapbox, allow you to upload data, customize\ndisplays and perform basic analyses. Carto is licensed for MIT use and is free to use while you\nare at MIT but charges a fee otherwise. ArcGIS Online has both a free, public version and a paid\nversion with additional features that MIT affiliates can access.\n-Web-based software is the best way to add interactive elements. If you have programming\nskills you can use tools like Leaflet or OpenLayers to create online maps. Otherwise ArcGIS\nOnline is easy to use and customize. Find out more about getting and account:\nhttps://libguides.mit.edu/gis/webmap\nLearn more about using ArcGIS Online: https://doc.arcgis.com/en/arcgis-online/create-maps/\ncreate-maps-and-apps.htm\n3. Desktop software, which are installed locally, provide the fullest suite of GIS tools for basic\nand advanced analyses and map creation. You will get hands on experience for each type of GIS\nin this presentation series.\n\n- Arcgis Pro is a more complete set of GIS tools but is license software and you may\nnot have access to it beyond MIT. QGIS is free and open source but is a more limited\nset of GIS tools.\n- Along with the comprehensive support from Esri for Arcgis Pro, there is complete\ndocumentation for all ArcGIS Pro tools. In QGIS tools are made by many people with\nvarying resources. Because of this there performance and documentation across\ntools is inconsistent.\n- Arcgis Pro only runs on Windows while Qgis runs on Windows, Apple, and Linux\nmachines.\n- Both interfaces are similar so after you learn one software, it is fairly easy to use the\nother\n- For most uses, either software will work well so you may want to base your decision\non your computer's resources, how frequently you will need to use it, what you want\nto do, and the industry you plan to work in (or are currently working in). ESRI\nproducts are frequently used in educational settings, municipal governments, and\nlarge businesses and organizations. Because of cost considerations, QGIS may be\nused in small businesses and non-profits.\n\nNow let's discuss some applications you can do with a GIS.\n\nMany people use a GIS to look at satellite imagery or have it as a background to their\nmaps.\n-materials from our remote sensing workshops are on our guide: libguides.mit.edu\n\nYou can also make custom visualizations.\nIn this example, buildings in New York City have been color coded by land use and\nextruded vertically to represent height.\nIt is also possible to create animations over time and record videos flying through your\nmap in a GIS.\n\nMaps also are used to share information, where design plays an important (even\npersuasive) role.\nSee how the creator chose green for Irish ancestry, and a darker shade of green for\nhigher percentage\n\nGIS has many tools for acting upon datasets:\nSome tools act on the geometry (clip), create new data (buffer), or analyze the data\nvalues (spatial statistics).\n\nWe will explore maps and data is this section of the presentation.\n\nGoogle Maps is a type of GIS, really a web mapping tool or geobrowser, and its maps\nare created from multiple layers of spatial data. As shown previously, a layer is data\nabout a specific set of similar features, such as the location of schools or bicycle paths.\nQuestion: Take a moment to determine what distinct layers are in this map.\nPresenter should move on after a few responses come in.\n\nAnswers: street networks, parks/open spaces, water, T stops, points of interest, etc.\nNotes: data are organized by theme: infrastructure, hydrology, administrative\nboundaries, etc.\n-When you create your own maps you can choose which data layers to include and how\nto visualize them to create a custom map.\n\nThere are two main approaches to representing real world data, vector and raster.\nVector represents the world in points, lines, and polygons, while raster uses rows and\ncolumns.\n\nIn some cases data can be represented as either a vector or raster, but usually certain\ntypes of data are better suited for a certain method of representation.\nVectors are composed of coordinates and are best suited to manmade features with\ndefined locations and boundaries.\nRasters are composed of pixels and are best suited to variables, usually environmental,\nthat change over surfaces such as temperature, precipitation, or elevation.\nYou are able to switch between vector and raster format to use different tools, which\nyou can see in our GIS Level 2 workshop materials.\n\nHere you see an example of points, lines, polygons, and all three combined\nQuestion: Can anyone guess based on how these vector layers are color coded, also\nknown as symbolized, what these datasets may represent?\nAnswer: MBTA Stops, Lines, and Towns, where the lines have been symbolized by color\n\nGeographic data include both a frontend geometry, meaning what you see on the\nscreen in GIS software and a backend database.\nVector data's frontend geometry is composed of coordinates and displayed as points,\nlines and polygons. Here is a layer with polygon geometry.\n\nThe backend database is called an attribute table. Each row is equivalent to one feature\non the map. In this example each row represents a different state polygon.\nEach column is a different piece of information about that feature. In this example\nthere is information about the state name and the population per square mile.\nVector data can have a large number of columns associated with their geometries, each\nof which can then be symbolized to produce different maps.\n\nThe map can be symbolized based on any column in the attribute table, meaning the\ncolor, size, shape, pattern, etc. of a feature can be changed to correspond to the data in\na particular column.\nHere the map was color coded based on a qualitative (aka categorical) variable, state\nname, where each unique state name was symbolized by a different color.\n\nHere the map was color coded based on a quantitative (aka numerical) variable,\npopulation per square mile, where each class of values was symbolized by a different\ncolor. We will talk about classes in depth later in the presentation.\n\nA shapefile is a open source format for vector data that can be opened in any GIS\nsoftware.\nShapefiles are often in a zipped (.zip) folder because they include several different files.\nThis folder needs to be unzipped to use in ArcGIS Pro, but files can be imported directly\nfrom the .zip folder in QGIS.\nThe .shp includes the actual geometry of the data, the .dbf includes the attribute table,\nand the .prj contains the map projection, which is covered more in GIS Level 2. Other\nfiles include indexes that speed up the loading and display of the data. Keep these files\ntogether when you move or share data in order for them to load properly.\n\nHere you see examples of rasters, such as aeriel photographs, digital elevation models,\nand scanned maps. All of which are constructed from pixels.\nAdditional Notes:\nEarly maps were created from surveys and early digital geospatial data were \"digitized\"\nfrom these maps. Data are now created using GPS. Some data are created from aerial\nphotographs. Data are constantly being updated\n\nRaster data is a continuous cell matrix. Each cell or pixel is the same size and has its\nown value.\nRasters can only symbolize one variable at a time due to how its attribute table\nfunctions.\n\nHere the map is color coded based on a quantitative (aka numerical) variable,\nelevation, where each unique pixel value is symbolized by a shade of grey stretching\nfrom black to white.\n\nRaster data have attribute tables with specific properties: a unique id for each\ncell/pixel, the value of that cell, and the count of other cells with that same value.\nNote: the map is the same elevation data symbolized with a different color ramp.\n\nRaster file formats include common image formats and there are many more raster file\nformats that are not listed here.\nThere are often associated files that tell the GIS software where to place the raster on\nthe map, similar to how a .prj file works in a shapefile.\nIf you import an individual image, such as a .jpg of a scanned map, you will need to do\nwhat is called \"georeferencing\" and tell the software how to align it with the rest of\nyour data.\n\nYou can convert tabular data such as those in spreadsheets so long at the data contains\ncertain geospatial information (i.e. shared unique identifiers, lat/lon, and/or addresses).\nSee our GIS Level 2 workshop materials for hands on experience.\n\nGIS software can read common tabular data formats. If there is geographic information\nincluded in the data table, GIS tools can be used to transform the table into a shapefile.\n\nGeodatabases are a file storage format used in ArcMap and ArcGIS Pro.\nGeodatabases are similar to zipped files in that they can store and compress a variety\nof different data types, including vectors, rasters, and data tables.\nThey are useful for organizing data and speeding up processing time when working with\nlarge files. A disadvantage is that they can only be opened in ESRI software.\n\nGIS software can import and export data in a variety of formats. Some common import\nformats include KML/KMZ from Google Earth and CAD files. Maps can be exported in\nimage formats for reports or presentations, such as CAD or Illustrator for further\ndevelopment.\n\nMany people do not just need GIS software to conduct their research.\nThe ability to import and export data and maps allows you to work in a variety of\nsoftware before or after using GIS.\nCommon workflows include using GIS in conjunction with remote sensing software,\nwhich is used to analyze satellite imagery, with 3D modeling software such as CAD or\nRhino, using attribute tables in statistical analysis software, and creating elaborate\nmaps designs with visual design software.\n\nThere are characteristics of spatial data that make it unique from other types of data.\nYou need to know about these special features in order to find and use spatial data.\nSpatial data is generalized, meaning it is simplified from what you would find in real life.\nThe more detailed your data are, the larger the files sizes, which means more data to\nstore and longer processing times when analyzing it in GIS software.\nDepending on your project, you may need data with more or less detail. In this\nexample, the coastline outlined in red would be suitable for display on a county or state\nmap. It would be difficult to see a lot of the small inlets and islands at that scale so you\nwant something more generalized, with less detail.\nThe coastline outlined in blue would be suitable for a map of the town or something\nsmaller, such as a specific bay or beach. More detail is often useful when mapping or\nanalyzing a small area.\n\nSpatial data are also abstracted, meaning they include only what is necessary for your\nmap and analysis. It would be impossible to include every feature that you see in real\nlife on a map. Not only would it create large files, but the map would be difficult to\nread.\nThis example includes data that have been abstracted in different ways, for different\npurposes.\nExample A is satellite imagery of an airport without any additional symbology.\nExample B uses a symbol of an airplane to represent the airport.\nExample C uses a polygon to represent the border of the airport property.\nExample D uses polygons and lines to represent the airport border and the runways.\nWhich data symbology would you select if you wanted to do a land use study of\nproperties adjacent to the airport?\nC - Because it shows the border, you can easily see what is adjacent. Example D also\nshows the airport border, but includes runway information, which you do not need.\nWhich data symbology would you select if you wanted to create a map of potential new\ndevelop within the airport? (pause)\nD - Because it shows the airport layout. It would be important to know where the\nrunways are when planning future development.\nWhich data symbology would you select if you wanted to create a map of all airports in\na country? (pause)\nB - Because it just shows the airport as one symbol. If you used the symbols pictured in\nC or D, you map would be messy and difficult to read.\n\nThe spatial data you make visible on a map depends on its scale, meaning how small or\nlarge of an area you are showing. You should show enough detail at a particular scale so\nthat your viewer can clearly see all the features you have added.\nQuestion: Can you spot any other features dependent on scale?\nIn the city map on the left, you can see points of interest, street widths, directions and\nnames, and public transportation stops. These are not visible in the regional map on\nthe right because they are not needed at that scale and would make the map\nimpossible to read. The regional map includes points that represent major cities,\nhighways, and larger state and national parks.\n\nSpatial data changes over time. The data pictured on the previous slides are only\naccurate for that particular point in time. Coastlines may erode or be created in a\nstorm. An airport could expand or close. The names of stores or number of streets may\nchange.\nIn this example, you can see from the imagery that Spring Valley had a lot of\ndevelopment from 1977 to 2006. Data for roads or houses will look different at\ndifferent points in time.\nNote: These aerial images are from the Google Earth Historical Imagery Time Slider.\n\nNow that you know what type of spatial data to look for, where can you find it?\nA lot of data is available freely online, especially for the US.\nThese are tips you can use in the future for data searches.\n\nHere we've listed 3 of the data repositories we frequently use when assisting\nresearchers.\nAt the top is the MIT Libraries GIS research guide which you can find by simply Googling\nMIT GIS. If you hover over the Find Data tab, you'll see a breakdown of GIS data sources\nby geography and subject.\nMIT also has a resource called Geoweb which includes freely available data as well as\nlicensed data restricted to MIT and other universities. The data restricted to use by MIT\ncommunity members consists largely of data purchased by the GIS team on specific\ntopics or areas of the world.\nOpenStreet Map is an open repository of crowd sourced maps. The amount of GIS data\nwill vary by location.\n\nNow we will talk about metadata, aka information about our data.\n\nMetadata is a way of describing an information resource so you can better understand\nthe data. It often describes how and why a dataset was created as well as provides\ninformation about any codes used within the dataset.\n\nShown here are some common metadata sources for geospatial repositories around\nBoston. Let's go through each link and see how their metadata are represented\ndifferently.\n\nLet's talk about some data visualization principles for making great maps.\n\nArt & science = design & analysis\nSimplifications of reality = you can't show everything\nDesigned by people = there's a motive behind their creation\n\nIn this example, we see successive maps all using similar symbology but different\nvariables to argue the location a highway connector should be placed. Things to keep in\nmind are:\n-only relevant features (for a particular group) were selected to be in each map.\n-each map is by a different creator and trying to convey a different message\n-each map is good for a different group\nQuestion: which is best, and what they think the solution should be?\nAnswer: (all correct, but all biased)\n\nYou also want to keep in mind some key questions, such as who wants the map and\nwhere it will be seen, both of which will affect the level of detail and whether or not\nthe map should be interactive.\nDepending on the purpose for the map will affect what type you will create, such as\nchange through time vs. space, and/or combining multiple variables for decision\nmaking.\n\nStage 1: collecting your data (we talked about this at the beginning of the workshop)\nStage 2: symbolize your data (we will talk about the next 2 items now)\nStage 3: create a layout (add title, scale bar, legend, north arrow, etc.)\n\nThere are many ways to symbolize vector data as points, lines, and polygons. While\ncolor is one of the more common ways to symbolize data, this chart shows additional\nways to show differences among features on your map by varying size, pattern, shape\nand orientation.\nWhen choosing any type of symbology, it is important to think about accessibility,\nespecially in relation to color blindness. The Colorbrewer website allows you to filter\ncolors based on those that can be viewed by people with color-blindness. ArcGIS Pro\nalso has this option in its symbology menu.\n\nRaster data are symbolized differently from vector data, as you saw in the earlier\nmodules about types of spatial data, because they are continuous surfaces. Raster data\ncan be displayed by showing all data values, grouping values into categories, varying\ncolors across the surface based on the value, or creating a vector field using symbols,\nwhich you might see in a map of wind direction and speed.\n\nWhen it comes to choosing color, you want to be mindful of they type of data you are\nworking with. Qualitative data often uses different colors for each category, while\nquantitative data often uses one color or two if there is a diverging phenomena.\nExamples of each would be:\nExample of qualitative/categorical: land use\nExample of sequential numbers: population\nExample of diverging numbers: weather/political (e.g. red, blue, neutral)\n\nLet's test our knowledge. In this example we have the variable \"Internet Users (per 100\npeople)\".\nQuestion: Can you tell where the highest internet users are?\nAnswer: No, doesn't make sense with quantitative (numerical) data.\n\nQuestion: Can you tell where the highest internet users are?\nAnswer: Yes, this has an ascending trend which is reflected in the darker color\nindicating greater intensity.\n\nQuestion: Can you tell where the highest internet users are?\nAnswer: It depends. Potentially, this would make sense if there was a certain\nphenomena that occurred and you wanted to show above/below this value (white\ncolored area).\n\nOne of the most commonly used types of maps is a choropleth map. Choropleth maps\nuse different shading and colors to display the quantity or value in defined areas.\nChoropleth maps are best used with polygon data so that it's easier to see color\nvariations.\nThis example of a choropleth map uses shades of 2 different colors, orange and teal, to\nshow spending per student by school districts. School district is the defined area and\nspending per student the quantity.\n\nWhen designing a choropleth map, you have to make 2 basic choices:\n-the number of classes you want your quantity value divided into\n-the classification method for arranging the data into those classes\nWhen choosing the number of classes, keep these points in mind:\n-the more classes, the more variation you have . The human eye can't distinguish\nbetween large numbers of variations of the same color. It is best to have no more than\n7 variations.\n-the major types of classification method are Equal Intervals, Quantile, Natural Breaks\nand Defined Intervals.\n\nequal interval classification classes have equal ranges : ranges such as 1-5, 5-10, 10-15\nquantile classification, classes have equal counts.: 5 items in each class\nNatural breaks optimizes class variation: the algorithm figures out where the breaks\nshould be\nmanual classification, the user sets the breaks based on prior knowledge of the data\n\nIt's ok that you can't see the exact numbers where the breaks are. The important thing\nis that these maps all use the same data (see histograms), but look different depending\non the classification method used (see the amount of each color based on breaks in\nhistograms).\nData source: SimplyAnalytics\n\nOnce you have collected and symbolized your data, you are ready to create a layout for\nyour map.\nIn this example, the eye tends to be drawn more to the legend and highlighted area\nthan to the main map.\n\nIn this rearranged map we have a much nicer visual flow, where the main map takes up\nthe majority of the frame, and inset maps are tucked into the top and bottom corners\nfor context.\nNotice how the legend is not far from the main map for easy interpretation and there is\nroom below the map for discussion and source credits.\n\nComplete the take home exercise for either QGIS or ArcGIS Pro.\n\nYour exercise is based on data presented in a Washington Post article. The article was\nabout Jared Kushner's use of maps to get federal funds meant for job starved areas, but\nmany other developers have used maps for persuasion as well. This is a map from the\narticle and it shows where the development was built. Data was left out to justify\nbuilding in this location. Will you choose the same location? Where should the\ndevelopment really be built? If we have time, we'll look at some maps that you have\ncreated at the end of the workshop."
    },
    {
      "category": "Resource",
      "title": "GIS Level 2 Presentation Slides (PDF)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-str-001-geographic-information-system-gis-tutorial-january-iap-2022/mitres_str001iap22_level2_pres.pdf",
      "content": "GIS Level 2:\nIntroduction to Spatial Analysis\nCourtesy of US Air Force. Image is in the public domain.\n\nOUTLINE\n- Introduction to spatial analyses\n- Use map projections & metadata to\nunderstand and transform spatial data\n- Use different types of processing tools in\nsoftware(s) to perform a multi-step analysis\n- Exercise new knowledge with GIS software(s)\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nINTRODUCTION TO SPATIAL\nANALYSIS\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nEdit geometry\n(Clip tool)\nWhat analyses can you do?\nAnalyze values\n(Vectors)\n(Rasters)\nCreate data\n(Buffer tool)\nImages (c) sources unknown. All rights reserved. This content is excluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nSpecialized tools are used to quantify\npatterns & relationships in your data.\nNetwork Analysis\nSpatial Statistics\nSuitability Analysis\nInterpolation\n\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nImages (c) sources unknown. All rights reserved. This content is excluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nMultiple tools are often used together.\nMultiple\ndata inputs\nSingle outputs\n(raster or vector)\n(c) Esri. All rights reserved. This content is excluded\nfrom our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair\nuse/\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nMAP PROJECTIONS:\nWHY DO WE CARE ABOUT THEM?\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nIf a coordinate system is wrong or missing,\ndata will not display in the correct location.\nhttps://ihatecoordinatesystems.com/\n(c) Dan Mahr. All rights reserved. This content is excluded from our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nUsing the same projection for all the datasets in\nyour project will lead to faster processing time.\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\nAnalysis tools that involve shape, area, direction,\nform, or distance calculations require data to be\nin a suitable projected coordinate system.\n(c) source unknown. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\nMAP PROJECTIONS:\nWHAT ARE THEY?\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\nEllipsoid\nRepresentation\nDatum\nSphere\nRepresentation\nDatum\nCourtesy of NOAA. Image is in the public domain.\nA Geographic Coordinate\nSystem (GCS) consists of\n- Datum\n- Prime Meridian\n- Angular Unit\nA Datum is an idealized\nmathematical representation\nof the Earth.\nhttp://desktop.arcgis.com/en/arcmap/latest/map/projections/\nwhat-are-map-projections.htm\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nA projection algorithm is applied to\nthe GCS to create a Projected\nCoordinate System (PCS).\nImagine an orange as the\nEarth, and you want to be\nable to peel it in such a\nway as to lay the peel flat.\nSimilarly,\nprojection is a method\nby which cartographers\ntranslate a 3D globe\n(spheroid or ellipsoid)\nto a 2D map surface.\nOriginal image (c) GIS Geography. All rights reserved. This content\nis excluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/\nDatum\n\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nA Projected Coordinate System consists of\n- Geographic Coordinate\nSystem\n- Projection Algorithm\n- Linear Unit\n- Parameters that center\nthe system on a certain\nlocation\n(c) Jochen Albrecht. All rights reserved. This content is\nexcluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nThere are many different types of projections.\nEach have certain strengths and limitations\nin the following types of distortions:\nshape, area, distance, direction\n(c) source unknown. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see https://ocw.mit.edu/help/faq-fair-use/\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nCoordinate Systems Characteristics\nGeographic\n- 3D spherical/spheroidal\nsurface defines locations\n- Units: degrees (angular)\n- Lengths, angles, and areas\nchange with distance away\nfrom equator\nProjected\n- 2D flat/planar\nsurface defines locations\n- Units: ft, m, miles, etc. (linear)\n- Lengths, angles, and areas\nconstant across the two\ndimensions\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nCoordinate Systems Summary\n1. Data often start in a geographic coordinate system.\n2. They are projected into a projected coordinate system.\n3. The projection depends on the data location and analyses\nImage (c) Michael Minn. All rights reserved. This content is excluded from our Creative Commons license. For\nmore information, see https://ocw.mit.edu/help/faq-fair-use/\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nCommonly Encountered Systems\nGeographic Coordinate System\n- NAD83 (North American Datum) - best fitting ellipsoid for North America\n- WGS1984 (World Geodetic System) - best fitting ellipsoid for the globe/world\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\nCourtesy of NOAA. Image is in the public domain.\n\nCommonly Encountered Systems\nProjected Coordinate System\n- UTM (Universal Transverse Mercator) - often best for large regions\nCourtesy of the National Geospatial-Intelligence Agency.\n(c) Jochen Albrecht. All rights reserved. This content is\nImage is in the public domain.\nexcluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nCommonly Encountered Systems\nProjected Coordinate System\n- USA State Plane Systems - have been optimized per state, see updates here.\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nTips on selecting a\nProjected Coordinate System\n- Based on your project's analyses:\n- Preserve area with equal-area projections\n- Preserve shape with conformal projections\n- Preserve direction with azimuthal projections\n- Preserve distance with equidistant projections\n- Other projections compromise on the distortions\n- (Usually you stick with one, but can re-project)\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nTips on selecting a\nProjected Coordinate System\n- Based on your project's location:\nSize\n- Locally, the US has 'state plane systems'\n- Regionally, UTM is often a good option\n- World, World Mercator (EPSG: 3857)\nRegion\n- To map tropical regions, use a cylindrical projection\n- To map middle latitudes, use a conic projection\n- To map a polar region, use an azimuthal projection\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nMAP PROJECTIONS:\nHOW DO YOU KNOW THE COORDINATE\nSYSTEM OF YOUR DATA?\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nOption 1: Look for a .prj (projection) file within the\nfiles that make up the \"shapefile\" and then...\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nOption 1 continued: Open the file in QGIS or\nArcGIS and examine the data layer information.\nNote: ESRI products (ArcGIS Desktop and ArcGIS Pro) refer to geographic &\nprojected coordinate systems with names while QGIS uses EPSG codes:\nNAD 1983 StatePlane New Jersey FIPS 2900 (US Feet) versus EPSG: 3424\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nOption 2: Consult the metadata\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nExercise 1: Coordinate Systems\nGoals\n- Learn how to transform a coordinate system in\nGIS software\nSteps\n- Open either the QGIS or ArcGIS Pro.\n- You will now choose a breakout rooms and be\nguided through the first exercise.\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nPROCESSING TOOLS: OVERVIEW\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nIntroduction  Maps & Data  Making Maps  Software  Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nUse processing tools to:\n\"capture, store, check, integrate,\nmanipulate, analyze and display\ngeospatial data\"\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nTool considerations\n- Read the tool help resource to\nunderstand how it works and\ndetermine if it is appropriate\nfor your data.\n- The accuracy of the input data\ndetermines the accuracy of\nthe results.\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nBatch tools\nRecord tools, inputs, and parameters used.\nExport this information as python code, if\npossible, so results can be replicated.\nThis is the focus of the\nGIS Level 3 workshop\nQGIS: Graphical Modeler & Python\nArcGIS Pro: Model Builder & Python\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nPROCESSING TOOLS:\nARCGIS PRO VS QGIS\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nAnalysis Tools\nArcGIS Pro (by ESRI)\n- Can easily import all data types\n(raster, vector, tabular)\n- Full set of GIS functions & tools\n(depends on licensing level)\n- Comprehensive support\n(direct support from ESRI,\naccess to online modules and\ntutorials, and documentation\nfor every tool)\nQGIS\n- Can easily import all data types\n(raster, vector, tabular, & more)\n-\nMany available tools, but lacking\nsome advanced analyses:\nnetwork analysis, spatial statistics\n-\nTools can be developed by anyone\nso performance & documentation\ncan be inconsistent.\n- Support via forums, eg StackExchange\nBoth have similar interfaces\nand many of the same analysis tools.\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nPROCESSING TOOLS: ARCGIS PRO\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nArcGIS Pro Analysis Tools\nArcGIS Pro offers a variety of toolboxes that contain tools that\nwork on certain types of data or perform specific types of\nanalysis.\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nArcGIS Pro Extensions\nAdvanced Analysis\n-\n3D Analyst\n-\nBusiness Analyst\n-\nGeostatistical Analyst\n-\nImage Analyst\n-\nNetwork Analyst\n-\nSpatial Analyst\nUsed most\noften\nIndustry Focused\n-\nAviation Airports & Charting\n-\nDefense Mapping\n-\nMaritime\n-\nPipeline Referencing\n-\nProduction Mapping\n-\nRoads and Highways\nData and Workflows\n-\nData Interoperability\n-\nData Reviewer\n-\nIndoors\n-\nLocateXT\n-\nPublisher\n-\nStreetMap Premium\n-\nTerritory Design\n-\nWorkflow Manager\n-\nWorkflow Manager (Classic)\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nPROCESSING TOOLS: QGIS\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nQGIS Analysis Tools\nQGIS offers vector analysis, raster analysis, sampling,\ngeoprocessing, geometry, & database management tools.\nAdditional tools include:\n- Integrated GRASS tools with more than 400 modules.\n- Processing plugin, a powerful geospatial analysis framework to call native\nand third-party algorithms from QGIS, such as GDAL, SAGA, GRASS, R, etc.\n- Extensible plugin architecture, can extend QGIS functionality where\nlibraries can be used to create your own plugins.\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nQGIS Vector Analysis Tools\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nQGIS Raster Analysis Tools\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nQGIS Processing Plugin\nProcessing plugin:\na powerful geospatial analysis\nframework to call native and\nthird-party algorithms from\nQGIS, such as GDAL, GRASS,\nSAGA, GRASS, R, etc.\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nQGIS Plugin Repositories\n- add useful features\nto the software\n- are written by QGIS\ndevelopers & other\nindependent users\n- available through\nthe Plugins menu\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nVECTOR ANALYSIS\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nBuffer\n- Creates a polygon around a\nfeature at given distance(s)\n- Where, the input feature can\nbe a point, line, or polygon\n- Options to dissolve or\ncreate separate features\n- Examples:\n- 50 miles around mines\n- 5 miles around rivers\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nCreate and Edit Features\n- New shapefiles can be\ncreated from scratch\n- Features can be edited or\ncreated using the editor\ntoolbar in Arc or QGIS\n- Example: creating a major\nroad layer (green) for\nHavana, Cuba based\non satellite imagery\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Automation >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nClip (Vectors)\n- Use one layer's extent to\nclip down the features of\nanother layer\n- Input layer can be points,\nlines, or polygons, but the\nclip layer must be a polygon\n- Example:\nEuropean railroad layer\nclipped to France layer\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nExercise 2: Vector Analysis\nGoals\n- Learn how to access, interpret, and\ntroubleshoot analysis tools in GIS software\nSteps\n- You will go back into your breakout room and\nbe guided through the second exercise.\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nSURFACE ANALYSIS\nIntroduction > Projections > Metadata > Processing Tools > Exercise\n\nInterpolation\nCreate a continuous surface from points.\n(c) Esri. All rights reserved. This content is excluded from our Creative Commons license. For\nmore information, see https://ocw.mit.edu/help/faq-fair-use/\n\nExtract by Mask (Pro)/Clip Raster (QGIS)\n- Only cells/pixels within a boundary are retained in output\n- Input must be a raster but the clip feature can be anything:\n- points, lines, polygons, or another raster (anything with area)\nImage (c) Esri. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see https://ocw.mit.edu/help/faq-fair-use/\nIntroduction > Projections > Metadata > Processing Tools > Exercise\n\nContour\n- Creates contour line layer from raster surface.\n- Note: they will not extend past the spatial\nextent of the raster nor in areas with no data\nImage (c) Esri. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see https://ocw.mit.edu/help/faq-fair-use/\nIntroduction > Projections > Metadata > Processing Tools > Exercise\n\nSlope\n- For each cell, the maximum rate of change in value\nfrom that cell to its neighbors is calculated.\n- The output slope raster can be calculated in two\ntypes of units, degrees or percent (percent rise).\nImage (c) Esri. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see https://ocw.mit.edu/help/faq-fair-use/\nIntroduction > Projections > Metadata > Processing Tools > Exercise\n\nZonal Statistics (...as Table)\n- Zonal Statistics - calculates one statistic\n(e.g. mean, max, min, stdev, range)\nfrom an input raster over a zone/area\nand produces a new layer.\n- Zonal Statistics as Table (Pro)/Zonal\nHistogram (QGIS) - calculates multiple\nstatistics but produces a table (which\ncan be joined back to geometry, or\nexported to statistical software)\nImage (c) Esri. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see https://ocw.mit.edu/help/faq-fair-use/\nIntroduction > Projections > Metadata > Processing Tools > Exercise\n\nSurface analysis tools: also are used to...\n- Analyze Patterns\n- Analyze Terrain\n- Generalize\n- Conduct hydrological analysis\n- Manage Data\n- Summarize Data\n- Use Proximity\nIntroduction > Projections > Metadata > Processing Tools > Exercise\n\nExercise 3: Raster tools\nGoals\n- Learn how to access raster tools\nSteps\n- You will go back into your breakout room and\nbe guided through the third exercise.\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nSPATIAL STATISTICS\nIntroduction  Map Projections  Metadata  Processing Tools  Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nWhat are spatial statistics?\n- methods for analyzing spatial distributions,\npatterns, processes, and relationships\n- they incorporate space (proximity, area,\nconnectivity, and/or other spatial\nrelationships) directly into their mathematics\nIntroduction > Projections > Metadata > Processing Tools > Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nSpatial autocorrelation (Moran's I)\n- Measures the patterns of attribute values associated with\nfeatures (ex. median home value, percent female, etc.).\n- Compares the value of the feature to that of its neighbors\nand the entire study area.\n- Indicates clusters of high or low values (positive I value) or\noutliers (negative I value).\nUse Moran's I to\ntest visual\npatterns for\nstatistical\nsignificance.\n(c) sources unknown. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\nIntroduction > Projections > Metadata > Processing Tools > Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nNeighbors: Distance Models\n- Inverse distance: all features\ninfluence all other features,\nbut the closer something is,\nthe more influence it has\n- Distance band: features\noutside a specified distance\ndo not influence the features\nwithin the area\n- Zone of indifference:\ncombines inverse distance\nand distance band\nIntroduction > Projections > Metadata > Processing Tools > Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nNeighbors: Adjacency Models\n- K Nearest Neighbors: a\nspecified number of\nneighboring features are\nincluded in calculations\n- Polygon Contiguity:\npolygons that share an edge\nor node influence each\nother\n- Spatial weights: specified\nby user (ex. Travel times or\ndistances)\nIntroduction > Projections > Metadata > Processing Tools > Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nIntroduction > Projections > Metadata > Processing Tools > Exercise\nSpatial autocorrelation (Moran's I)\n(c) sources unknown. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nOther spatial statistics tools\n- Analyzing patterns\n- Nearest neighbor, Ripley's K\n- Geographic distributions\n- mean, median, directional mean\n- Regression\n- Geographic, Ordinary Least Squares (OLS)\nIntroduction > Projections > Metadata > Processing Tools > Exercise\n\nExercise 4: Spatial Statistics\nGoals\n- Learn how to access specialized analysis tools\n- Understand the results of a basic spatial\nautocorrelation.\nSteps\n- You will go back into your breakout room and\nbe guided through the fourth exercise.\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nDISTANCE & NETWORK ANALYSIS\nIntroduction > Projections > Metadata > Processing Tools > Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nDistance in a GIS\n(c) Google. All rights reserved.\nThis content is excluded from\nour Creative Commons license.\nFor more information, see\nhttps://ocw.mit.edu/help/faq\nfair-use/\nIntroduction > Projections > Metadata > Processing Tools > Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nDistance functions in GIS\nWithout\nregard to any\nnetwork, over\nthe surface of\nthe earth vs\non a road\nnetwork\n(c) Google. All rights reserved.\nThis content is excluded from\nour Creative Commons license.\nFor more information, see\nhttps://ocw.mit.edu/help/faq\nfair-use/\nIntroduction > Projections > Metadata > Processing Tools > Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nNetwork Analysis Tools\n- Routing\n- Service Areas\n- Closest facility\n- OD Cost Matrix\n- Vehicle Routing Problem\n- Location-Allocation\n- (Only for ArcGIS Products)\nIntroduction > Projections > Metadata > Processing Tools > Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nTAKE-HOME EXERCISE\nIntroduction > Projections > Metadata > Processing Tools > Exercise\n\nAnalysis >> Projections >> Metadata >> Processing Tools >> Exercise\nTake-home Exercise overview\n- Continuing with the data from GIS Level 1,\nexplore where you may build a mixed use\nfacility in Jersey City.\n- This exercise will take into account the\nfollowing factors:\n- Clustering of unemployment\n- Distance to transportation\n- Terrain\nIntroduction > Projections > Metadata > Processing Tools > Exercise\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nRES.STR-001 Geographic Information System (GIS) Tutorial\nIAP 2022\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms"
    },
    {
      "category": "Resource",
      "title": "GIS Level 2 Presentation Slides with Notes (PDF)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-str-001-geographic-information-system-gis-tutorial-january-iap-2022/mitres_str001iap22_level2_pres_notes.pdf",
      "content": "This workshop is a sampler of the some tools available in ArcGIS Pro or\nQGIS.\n\nIn this workshop, we will focus on the analysis tools you can use with your data.\nAnalysis tools can be used to edit or subset data (left), analyze data values (top right),\nand create data (bottom right). A tool may do all of these things at once and you may\nuse several tools in conjunction with one another. Our level 2 workshop goes into these\nfurther in this presentation.\n\nGeographic information systems have spatial analysis tools that allow you\nto quantify patterns and relationships in the data and display the results as\nmaps, tables, and charts. Using tools within a GIS you can examine the\nattributes and location of spatial data and reveal relationships that you\nmight not be able to see otherwise.\nThese pictures are examples of some analysis results:\n-\nHot spot analysis of diseases by zip code (spatial stats)\n-\nCreating a continuous surface from points (interpolation)\n-\nThe time it takes to travel from a particular energy source (network\nanalysis)\n-\nWildfire hazard potential (suitability analysis)\n\nYou will often use multiple tools to answer spatial questions about your\ndata. This is an example of a suitability analysis, a common process done\nusing GIS. It is not a particular set of tools, but rather a way to work with\nseveral tools to quantify patters and relationships to determine the best\nplace or site for something.\nSuitability example: This shows a suitability analysis for selecting a new\nschool location using: land use, slope, recommended sites, and other\nschool locations.\nSource: https://desktop.arcgis.com/en/arcmap/latest/extensions/spatial-\nanalyst/solving-problems/using-the-conceptual-model-to-create-\nsuitability.htm\n\nMap projections are especially important when conducting spatial analysis.\n\nWhen data are in different projections, tools will convert them into a similar projection\nduring each step of the analysis, which adds time, especially when using multiple data\nlayers or complex tools.\n\nSome analysis tools requires that your data be in a projection that uses linear units\n(meters, feet, etc.) in order to run the tool.\n\nAs you know, geographic data for any particular area are stored in separate layers. For\nexample, roads are stored in one layer, parks in another, and buildings in a third. To\nenable the data in each layer to integrate when displayed and queried, each layer must\nreference locations on the earth's surface in a common way. Coordinate systems\nprovide a framework for this to happen.\nOne type of coordinate system is the geographic coordinate systems. It consists of\nseveral parts:\n-\nA datum is part of the coordinate system. The earth is not a perfect sphere,\nalthough the analysis tools often assume it is, so datums are used to \"smooth out\"\nthe earth's surface so it can be more easily analyzed. There are different datums\nthat are designed to be more accurate for different parts of the world. The pictures\nabove show how the imperfect shape of the earth is transformed into a perfect\nellipse and then a perfect sphere.\n-\nA coordinate system also includes a prime meridian (which specifies the location of\n0 longitude) and an angular unit (often degrees).\nTo use the analysis tools, you often have to make sure the coordinate system is\nappropriate for your data and the tool you are using.\nSources:\nhttps://www.esri.com/arcgis-blog/products/arcgis-pro/mapping/coordinate-systems-\ndifference/\n\nA projection is the mathematical algorithm that defines how to present the round earth\non a flat map. For example, if we were all to peel an orange and flatten out the peel, we\nwould all do it in different ways. The peel would be different shapes and sizes in\ndifferent areas and these pieces would be spaced in different ways.\nThis algorithm is applied to the geographic coordinate system, which includes the\ndatum, and is part of a Projected Coordinate System, which we will discuss next.\nSource: https://gisgeography.com/map-projections/\n\nA projection is part of a Projected Coordinate System. A projected\ncoordinate system also includes a geographic coordinate system, a linear\nunit, and parameters that can be used to center the coordinate system on\ndifferent parts of the world. A projected coordinate system is more\naccurate when it is centered over a location and thousands of systems\nhave been developed for different parts of the world. For example, each\nstate has several projected coordinate systems that are idealized for that\nstate.\n\nRepresenting the earth's surface in two dimensions causes distortion in\nthe shape, area, distance, or direction of the data. (as shown in the\nprevious orange example)\nWhen creating a map, you will want to think about which of the distortions\nyou want to minimize and choose an appropriate projection.\n\nTo summarize, a datum is a representation of the earth's surface and is part of a\ngeographic coordinate system. A projection algorithm can be applied to that system to\ncreate a projected coordinate system for a specific location.\n\nIn the picture above the larger turquoise ellipse fits well for the entire earth/geoid, but\nnot for a smaller region. The red ellipse is a better fit in this case.\nTwo commonly used geographic coordinate systems are NAD83, which is the best fit\n(has the least distortion) for North American, and WGS84, which is the best fit for the\nentire world.\nSource: https://slideplayer.com/slide/220638/\nAlternative (very informative source):\nhttps://www.ngs.noaa.gov/web/science_edu/presentations_library/files/spcs2022_njs\npls_2019.pdf\n\nAs mentioned previously, geographic coordinate systems can be \"projected\" (aka\n\"flattened\") so that they appear less distorted on the screen and use a linear unit of\nmeasurement (meters, feet vs. decimal degrees). UTM is a common projected\ncoordinate system for the world. It divides the earth into vertical zones. You would\nchoose the zone that is appropriate for the location of your data in order to minimize\ndistortions.\n\nThere are specific projected coordinate systems for each state (and sometimes parts of\na state) that minimize distortion in that area. The state plane system is used in the\nUnited States.\n\nIf you are transforming data from a geographic coordinate system into a projected\none, you will need to choose the appropriate projected coordinate system. First, think\nabout the analyses you will be doing. Which types of distortion would you want to\nminimize? For example, if you will be calculating the area of building you would want to\nchoose a projected coordinate system that preserves area.\nAdditional Sources:\nhttps://eipd.dcs.wisc.edu/for-credit/GIS-cert/summer2017/geog370_m1/lesson_4.html\nhttps://ihatecoordinatesystems.com/\n\nNext consider the region in which you are working and the size of your area of analysis.\nSome projected coordinate systems are designed for very small areas and some for\nlarge ones. There are systems for every part of the world.\n\nWhen you download data from the web or are given it from a colleague, how do you\nknow if it has a coordinate system? For shapefiles, look for a .prj file.\n\nOnce you have confirmed there is a .prj file, how do you know what the projection is?\nYou can view coordinate system information for each data layer in GIS software.\nWhen using QGIS, you will always see an EPSG code for each coordinate reference\nsystem. This is a unique number that is assigned to each system.\nIt's useful to use the EPSG code when searching for a projection to make sure you are\nselecting the one you want. Often projections have similar names and it's easy to select\none the incorrect one if you are just looking by name.\n\nIf you downloaded data from a website, you can often find metadata that lists the map\nprojection.\nYou can find metadata:\n-Downloaded with your data layers\n-On the website where you got your data\n-Sometimes you may need to contact the data provider to get metadata\nMost commonly used metadata formats are html/xml, text files, or in a table format,\nsuch as excel or csv.\n\nGIS software includes hundreds of tools you can use to perform different processes on\nyour data.\n\nBoth QGIS and ArcGIS Pro tools include links to help documentation. Read this to\ndetermine how the tool works, the required input fields, and any other considerations.\nCertain tools may required data in certain formats or projections. There may also be\nother assumptions about the input data.\n\nYou will often use several tools in a row to process your data. Make sure to keep a\nrecord of the tools you use, their inputs, parameters, and the names of the output files.\nYou can do this manually or use the Graphical Modeler in QGIS or the Model Builder in\nArcGIS Pro. Drag and drop tools and inputs into these programs to visually see your\nworkflow. You can also run all the tools multiple times using these programs and export\nyour process a python code to share with others. If you are familiar with python you\ncan use it to write code for your GIS analysis. Our GIS Level 3 workshop, which will\nlikely be offered in January, covers using python with ArcGIS Pro.\n\nNow we will discuss the general way tools are set-up and run in both QGIS and ArcGIS\nPro.\n\nFor most uses, either software will work well so you may want to base your decision on\nyour computer's resources, how frequently you will need to use it, what you want to\ndo, and the industry you plan to work in (or are currently working in).\nBoth softwares have many of the same tools, but you may find a tool in QGIS that is not\nin ArcGIS Pro and vice versa.\n\nArcGIS Pro organizes tools into toolboxes.\n\nSome of the more specialized tools require an extra license or an additional installation.\nAll are available while you are at MIT and the most commonly used one are built into\nArcGIS Pro.\nIf you run into a licensing error when trying to use these tools, email us and we can\nmake sure the license is activated on your account.\n\nQGIS has a similar set of tools, but they are organized in a different way. Additionally\nthere are tools created by users.\nQGIS tools are often built on other languages, such as GRASS or GDAL. While we aren't\nfamiliar enough with these languages to provide help, it's possible to run analysis\ndirectly through the, outside of QGIS, or use them to build your own QGIS tools.\n\nQGIS comes with a variety of tools that are grouped into those that work on Vector\ndata and those that work on Raster data. Similar to ArcGIS Pro, you can see here that\nthe vector tools are grouped into several categories.\n\nThe Raster tools are organized in a similar way.\n\nIn addition to what you find at the top menu, QGIS includes additional tools in the\nProcessing Toolbox (again, similar to the toolbox in ArcGIS Pro).\n\nAdditionally there is a QGIS plugin repository where you can find additional tools\ncreated by users. Adding these to your QGIS may add additional toolbar menus or\nadditional options under the existing menus.\nTo summarize:\nArcGIS Pro tools can be found in the toolbox, with some requiring an additional license.\nSome of the more popular tools display at the top menu ribbon. These tools are\ncreated by developers at ESRI, which created the software.\nQGIS tools can be found in the toolbar menu, the processing toolbox, or as an\nadditional plugin. These tools are created by a variety of QGIS users.\nGoogling is a great way to find out if a tool exists and where it is located in the\nsoftware.\n\nThe buffer tool creates a polygon surrounding a feature at a distance you\nchoose.\n\nEditing tools are used to create new data, often times from satellite\nimagery or a scanned map. For example you can extract features or trace\ndata from an image.\n\nThe clip tool is like a cookie cutter and can be used to subset data. You\noften don't need all the data in a file you have downloaded and extracting\nonly what you need will speed up processing and loading time.\n\nThere separate tools to be used with vectors vs. rasters because the file formats are\ndifferent.\n\nInterpolation tools create a continuous raster surface from individual points on a map.\nIn these examples, the elevation surface is interpolated from individual elevation point\nvalues and the ozone level for California is interpolated from values at individual\nmonitoring stations.\nThere are a variety of algorithms to choose from in order to create this surface.\n\nExtract by Mask is what you would use to clip a raster. Again, extracting only what you\nneed decreases file sizes.\n\nContour lines can be produced from elevation rasters called DEMs (digital elevation\nmodel).\n\nSlope can also be calculated from elevation rasters, and used as inputs in other tools.\n\nZonal statistics can be used to summarize a raster by different zones/cookie cutter\nareas. For example, if you have a raster where each pixel is a different land use, you\ncould overlay town boundaries to find the predominant land use in each town.\n\nThere are a lot of additional tools that fall under the following categories.\n\nIf you see what appear to be clusters of similar data or outliers in your choropleth map,\nyou can use spatial statistics tools to analyze the values of the data to see if there is a\nstatistically significant pattern.\nSpatial autocorrelation analyzes the values in your attribute table, comparing the value\nof each feature (i.e. each row) to that of neighboring features and the entire study area\nto find clusters of low or high values.\n\nThe results of spatial autocorrelation are dependent on how the neighborhood is\ndefined. In GIS software you create what is called a \"weights\" file to define your\nneighborhoods. This is used as input when running a spatial statistics tool.\nHere are some examples of how you may define a neighborhood based on distance.\n\nYou can also define neighbors based on adjacency or by creating your own weights file.\n\nOne method use to determine clusters of similar values is called Moran's I.\nIt can be used with points (you would want to choose distance neighborhood model) or\npolygons, although it tends to be more widely used with polygon data.\nIn both examples the output of this tools are additional data layers indicating where\nthere are clusters of high values or low values and where there are places with outliers\n(a low value surrounded by high values or a high value surrounded by low values).\n\nThere are other tools that look at the patterns created by the location of features\n(rather than the value of the attributes) and the location of points. You can also do\nregression.\nQGIS has a more limited set of spatial statistics tools. There is another free, open-\nsource program called Geoda, which can be used to supplement the tools found in\nQGIS. This will be used in the final exercise.\n\nHere we can see that Google maps a route from Back Bay in Boston to the GIS and Data\nLab at 77 Massachusetts Avenue in Cambridge.\nGoogle appropriately picks roads that likely have sidewalks and routes you along those\nroads. It doesn't assume that you have a boat to cross the river on.\n\nThere are two main types of distance functions that exist in GIS: tools that use a line\nnetwork (roads, trains, etc.) and those that use a straight-line distance.\nIn the former, your paths have to remain on part of the network. You can see in the\nexample above the point in Back Bay. Using the road network, the distance from the\npoint to any areas 1 mile away is shown in brown. Red shows 1 mile from the point not\nusing the road network. It's clear that the distance traveled over road networks limits\nyour actual distance from the point, especially when there are significant barriers to\ntravel, like the Charles River.\nThe distance without regard to networks was calculated using the Buffer tool. The\nbuffer tool requires only a point to calculate distance.\nThe distance with regard to networks was calculated with the Network Analysis\nextension tool called Service Area. The Service Area tool requires a road network to\nfind distances. There are some basic network analysis tools in QGIS, but more extensive\nones in ArcGIS Pro.\n\nNetwork analyst tools are often used to vehicle routing or anytime you want to\ncalculate something using a road (or other transportation) network.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nRES.STR-001 Geographic Information System (GIS) Tutorial\nIAP 2022\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms"
    }
  ]
}