{
  "course_name": "7.InT: Inclusive Teaching Module",
  "course_description": "The Inclusive Teaching Module is both a standalone online resource for those looking to explore materials related to inclusive teaching as well as an integral part of a blended workshop available to use at your own institution. If you are looking to facilitate a blended workshop using this material, please download the Facilitation Guide and Appendix files to get started! \nAs part of the Open Learning Library (OLL), this course is free to use. You have the option to sign up and enroll if you want to track your progress, or you can view and use all the materials without enrolling. Resources on OLL allow learners to learn at their own pace while receiving immediate feedback through interactive content and exercises.",
  "topics": [
    "Teaching and Education",
    "Curriculum and Teaching",
    "Teaching and Education",
    "Curriculum and Teaching"
  ],
  "syllabus_content": "",
  "files": [
    {
      "category": "Resource",
      "title": "Blended Inclusive Teaching Workshop Facilitation Guide",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-7-009-7-int-inclusive-teaching-module-fall-2022/mitres_7_009_f22_facilitation_guide_incl_teach.pdf",
      "content": "Blended Inclusive Teaching Workshop Facilitation Guide\nCreated by: Darcy G. Gordon, PhD\nOverview\nWhat this Workshop is About\nHow to Use the Materials\nLearning Goals and Objectives\nExpectations\nPlanning the Workshop\nPeople Power\nMaterials and Resources\nFormat and Timing Suggestions\nPreparing for the Workshop\nFacilitating the Workshop\nOverview and Introductions\nIntersectional Identity Activity\nConnecting Identity to Education\nReflective Teaching\nWrap Up Part 1/Homework Instructions\nOverview and Review of Inclusive Themes\nDiscussion of Homework/Online Scenario Group Work\nVideo Critiques\nGallery Showcase\nAction Plan\nAfterwards, Evaluation, and Additional Information\nWorkshop Feedback\nPost-Workshop Communication and Certification\nPotential Analyses\n\nOverview\nWhat this Workshop is About\nWe are so glad you are interested in facilitating a blended inclusive teaching workshop!\nThe intended audience for this workshop is anyone interested in inclusive education,\nincluding faculty, teaching staff, graduate teaching assistants, and postdoctoral fellows,\nespecially those in active teaching roles. This workshop uses a combination of in-person\nand online (i.e., blended) activities. These activities leverage the best that online and\nin-person active learning has to offer and encourage participant's ability to empathize\nwith students, evaluate instructional choices, and reflect on what inclusivity means in\ntheir teaching contexts. As a reflective, process-oriented workshop, facilitators and\nparticipants will spend time thinking about their own identities and experiences, how this\ninforms their teaching practices, as well as critically examine common pedagogical\npractices. This workshop is appropriate for folks just starting out in their inclusive\nteaching journey as well as for seasoned teachers. We designed activities so that\neveryone can benefit from the workshop materials and hope you enjoy it as much as we\ndo. Remember, have fun and learn a lot!\nHow to Use the Materials\nAside from this guide, which outlines the logistical and practical considerations for\nfacilitation, the Inclusive Teaching Module contains reflection opportunities,\napplication-based questions, and supporting materials to help guide participants through\nthe learning experience. In the blended workshop, some of the online activities found in\nthe Module will be used as is and others will be modified into an in-person activity or\nused in a different way than presented in the Module. In addition to fully reviewing this\nguide, we suggest going through the entire Module to familiarize yourself with the\ncontent and format of the sections before facilitating.\nLearning Goals and Objectives\nGoals\nThe learning goals for this workshop are:\n1. foster a reflective teaching style with a growth mindset toward improvement,\n2. empathize with how intersectional identities can inform experiences in education,\nand\n3. develop tools and strategies for inclusive practices.\n\nObjectives\nBy the end of this workshop, participants should be able to:\n1. articulate the intersectional identities you hold,\n2. identify how different teaching practices can be received by diverse audiences,\n3. assess strategies that promote inclusivity, and\n4. create an action plan to address inclusivity in your teaching environment.\nExpectations\nFor the Workshop\nAlthough educators vary in the degree of familiarity and comfort with discussions of\ndiversity, equity, and inclusion (DEI), we designed this workshop with the intention that\nthere is something for everyone. Even as the designers and facilitators of this workshop,\nwe learn something new each time it is offered. Because this is a dynamic field that\nconstantly is growing, this guide and the companion Inclusive Teaching Module are not\ntotally static resources. We have, and will continue to, edit and add to these materials as\nmore research and best practices are shared. Despite the significant shifts in\nself-reported attitudes and skills we measure as a result of offering this workshop, it is\nnot a cure-all. This workshop functions best when embedded into a larger institutional\neffort to increase DEI in your organization.\nFor Facilitators\nIt is vital that facilitators of this workshop model the inclusive practices and mindsets that\nwe encourage of our participants. Chief among them is humility. We all have something\nto learn and cannot expect that we will perfectly facilitate every time. Staying open with a\ngrowth mindset helps us navigate challenging situations and learn from those moments.\nAlong with modeling humility, we also want to model transparency. Be sure to describe to\nparticipants what is expected of them, how the activities are structured, and why they are\ndesigned that way (i.e., their alignment to specific learning outcomes).\nFor Participants\nWe know that talking about identity and teaching experiences can be emotional. That is\nwhy we strongly advocate for using ground rules/group agreements/community\nguidelines. These tenets not only set the tone for the workshop, but they clarify\nexpectations for participants and create a system for accountability. These are fairly\nnon-negotiable, we have had participants add to and clarify them, but we cannot abide\n\nby removing list items. This is in service of creating a space where folks feel welcome to\nparticipate. We introduce these ground rules after introductions, but before moving on to\nthe workshop content (Overview and Introduction section of this guide).\n1. Listen and speak with intention - You will get the most out of this workshop if you\nare present and attentive when listening, and mindful and deliberate when\nspeaking. Take a moment to relate your thoughts to today's objectives.\n2. Share time - Create space for others to be heard and take part in the\nconversation. Notice how much you are talking, and who else is participating.\nInvite others to share their thoughts.\n3. Ask questions - Test your assumptions by asking clarifying questions and\nrestating what you hear. Approach asking and answering questions with openness\nand the intention to increase understanding of all participants.\n4. Give the benefit of the doubt - We're all doing the best we can in the moment.\nStart from a place of positivity and give the benefit of the doubt to your\ncolleagues. We want to foster an environment where it is safe to be vulnerable\nand make mistakes.\n5. Hold yourself and others accountable - If you misstep, that is okay! Apologize,\nand correct the mistake if possible. We are all here to learn.\n6. Take the learning, but leave the stories- We want to create a space where folks\nfeel comfortable sharing their experiences. In that spirit, we want to take away\nideas and skills we build here, but leave specifics from others' stories.\nPlanning the Workshop\nPeople Power\nCo-Facilitation\nWe advocate that co-facilitation (at least 2 facilitators) is a best practice, but acknowledge\nthat is not always feasible. We typically offer this workshop with 2 facilitators. The\nbenefits of co-facilitation include representing diverse perspectives, demonstrating\ncollaboration, reducing reliance on a single person, and increasing capacity for workshop\nmanagement. The downside to co-facilitation is that it requires the coordination of more\npeople's schedules.\nParticipants\nWe typically will not facilitate this workshop with more than 25 people. It is an interactive,\nhighly participatory curriculum, so we want everyone to have a chance to be heard. More\n\npeople means there are fewer opportunities for folks to share out with the whole group\nand other time constraints. We find that the minimum number of participants required for\nthe activities and robust discussion is 8 people. Factor in some attrition into your\nrecruitment efforts to make sure you have 8-25 participants.\nMaterials and Resources\nIn each section of Facilitating the Workshop, we will note which of the supplies listed\nhere if any are needed. The physical space, technology, and files referenced in this\nsection are needed in each part of the workshop, whereas the supplies are only\nmentioned in the applicable activities.\nPhysical Space\n● Room for 25 participants maximum (room should hold ~30 people)\n● Enough tables with 5 chairs at each to accommodate all participants during small\ngroup work\n● AV equipment (see Technology)\n● Available walls for hanging at least 8 poster-sized sticky notes (see Supplies)\nTechnology\n● Facilitators:\n○ Laptop connected to internet, a projection screen, and speaker\n○ Audio and visual projection options for the room\n○ Inclusive Teaching Module\n● Participants:\n○ Laptop or tablet connected to internet with access to the Inclusive Teaching\nModule\nFiles\nWorkshop files are found in the Facilitation Guide and Appendix section of the Module.\n● Participants: Digital link sheet\n● Facilitators: All other files\nSupplies\n● Poster-sized sticky notes (~15 sheets)\n● 4 different shape and color combination sticky notes or stickers\n○ Each participant needs 2 of each shape/color combination\n\n● Large sticky notes\n○ Each participant should have 3-5\n● Name tags for each participant and facilitator\n● Large markers\n● Sign-in sheet\n● Table number signs\nFormat and Timing Suggestions\nOne All-Day Session\nThis workshop can be facilitated as a one-day intensive retreat. We suggest if you pursue\nthis option to provide meals/snacks as well as several breaks (noted).\n● Morning 1: Identity - (75 minutes total)\n○ Overview and introductions (in-person) - 30 minutes\n○ What is Inclusive Teaching? (in-person) - 5 minutes\n○ Intersectional identity activity (in-person) - 35 minutes\n○ Introduce Gallery Walk activity (in-person) - 5 minutes\n● Break (10 minutes)\n● Morning 2: Reflective Teaching (70 minutes total)\n○ Supporting under-represented students (in-person) - 5 minutes\n○ Connecting identity to education reflections (online) - 10 minutes\n○ Reflective teaching guided inquiry (online and in-person) - 40 minutes\n○ Wrap up and preview for next session (in-person) - 15 minutes\n● Lunch break (1 hour)\n● Afternoon 1: Distinguishing Inclusive Teaching Practices (60 minutes total)\n○ Overview, recap, review of inclusive themes (in-person)- 5 minutes\n○ Online work in small groups (online and in-person)- 30 minutes\n○ Scenario small group discussion (in-person) - 25 minutes\n● Break (10 min)\n● Afternoon 2- Critiquing Teaching Practices- (65 minutes total)\n○ Video critiques (online and in-person) - 60 minutes\n○ Debrief (in-person) - 5 minutes\n● Break (10 minutes)\n● Afternoon 3- Gallery Showcase and Action Plan- (80 minutes total)\n○ Gallery Showcase (in-person)- 30 minutes\n○ Action plan (online and in-person) - 50 minutes\n\nTwo-Session Format\nWe often run this workshop as two 2 hour sessions one week apart.\nSession 1: Identity and Reflective Teaching (2 hours total)\n○ Overview and introductions (in-person) - 25 minutes\n○ What is Inclusive Teaching? (in-person) - 5 minutes\n○ Intersectional identity activity (in-person) - 30 minutes\n○ Supporting under-represented students (in-person) - 5 minutes\n○ Connecting identity to education reflections (online) - 10 minutes\n○ Reflective teaching guided inquiry (online and in-person) - 30 minutes\n○ Wrap up and preview for next session (in-person)- 15 minutes\n● Homework (online in between sessions) (30 minutes)\n● Session 2: Distinguishing Inclusive Teaching Practices (2 hours total)\n○ Overview, recap, review of inclusive themes (in-person)- 15 minutes\n○ Scenario small group and large group discussions (in-person) - 20 minutes\n○ Video critiques (online and in-person) - 35 minutes\n○ Action plan (online and in person) - 45 minutes\nOther Possibilities\nOne of the intentions behind the design of this curriculum is that the activities build off\none another and are somewhat modular. Depending on time and interest, there are more\nformat variations possible. We have on occasion assigned the online version of the\nIntersectional Identity Activity as pre-work when time is limited. In those cases, we focus\nthe remaining synchronous activities on reflective teaching and/or discussions and\ncritiques of scenarios.\nPreparing for the Workshop\nTarget Audience\nWe offer this workshop to graduate students, postdoctoral fellows, teaching staff, and\nfaculty. We recommend extending invitations to graduate students and junior\npostdoctoral fellows together, or faculty, teaching staff, and senior postdoctoral fellows\ntogether. We believe a mixed group of graduate students and faculty has too many\ncomplicated power dynamics. Postdoctoral fellows pose a unique challenge as their\nexperience is typically the most variable, which is why we include them in both graduate\nstudent and faculty targeted workshops. If including postdoctoral fellows and faculty\ntogether, be mindful of potential conflicts (see Assign seating section).\n\nCommunications\nThis workshop is extremely participatory and we acknowledge folks have very busy\nschedules. That is why it is important to get an accurate headcount for the event. Our\nstrategy is to send out an interest form (see Appendix) 6-8 weeks ahead of the event and\nthen follow-up with folks who expressed interest to confirm registration (see Appendix)\nabout 1 month before the event. We find that this two-part interest/registration method\nminimizes attrition as it reinforces commitment. If it is an especially busy time of year and\nyou have some flexibility, we also have success including a rank choice date/time option\nin the interest form. That way you can find the date/time that works for both the\nfacilitators and prospective participants.\nAssign Seating\nWe find that assigning small groups for some activities works well. Based on the\nregistration information provided by participants, we like to compose groups with a mix\nof teaching experience, gender identities, and racial identities (if known). We typically\nassign 5-6 groups of 4-5 people. It is wise to try to have at least 2 people of a shared\ngender or racial identity (if known and if possible) in each small group, as the experience\nof being the only representative of a specific identity can trigger stereotype threat. If\nincluding folks of different roles (e.g., postdoctoral fellows and faculty), it is ideal to also\nhave 2 people of a similar role/work experience in each group. However, just make sure\nnot to assign a faculty member to the same group as the postdoctoral fellows in their lab.\nPrint out a sign-in sheet for the participants to initial (to indicate attendance at event) and\nfind their table as they enter the space (see Appendix). Due to some attrition on the day\nof the event, you may need to combine tables or rearrange the seating chart. We advise\ndoing this to maintain 3-5 people per group.\nReview All Materials\nThe most important thing you can do as a facilitator is be prepared! Be sure to review this\nguide, the online Inclusive Teaching Module, and all other materials thoroughly. Comfort\nwith the materials will help the workshop go smoothly and on schedule. Remember to\narrive at the workshop space at least 20 minutes before the workshop begins, as some\nset up is required.\n\nFacilitating the Workshop\nOverview and Introductions\nSynopsis\nIn-person and online. Introducing yourselves and the material can help set the tone for a\ntransparent, candid, and inviting workshop.\nSupplies\n● Name tags for each participant and facilitator\n● Large markers\n● Sign-in sheet (see Appendix)\n● Table number signs\nTiming: 25 minutes\nDetailed Guide\nAs folks enter the room, encourage them to:\n● sign in on the registration sheet\n● find their assigned table and fill out a name tag,\n● and complete Survey 1 as a pretest (for a hard copy see Appendix).\nThen introduce yourselves. We typically introduce ourselves by using our first names,\npronouns, role at the institute, and connection to the material. Sometimes, our workshop\nsessions are too large to have sufficient time for all participants to introduce themselves,\nin that case, we ask that participants introduce themselves before they speak for the first\ntime and in their small groups. However, you may want to include introductions as this\nhelps get participants comfortable.\nAfter introductions we move to outlining the Learning Goals and Objectives and the\nGround Rules (both described in detail in the Overview section of this guide).\nOnce these housekeeping tasks are completed we like to ask participants: what is\ninclusive teaching? We use PollEverywhere to compile anonymous open-ended short\ntext-based responses. However, you can set up a poll in whatever format you desire. We\nreview responses as they appear in real-time. After folks have responded, we define\n\ninclusive teaching as a collection of approaches that both invites and enables people\nthat embody diverse identities to successfully learn together.\nFacilitation Tips\nAssess agreement: Get an indication if folks agree to the ground rules. Ask participants\nto show a sign (thumbs up/down) of agreement. If someone does not agree, take a few\nminutes to discuss their concerns or suggested amendments (while keeping the existing\nrules in place).\nIntersectional Identity Activity\nSynopsis\nIn-person group activity. Participants indicate which categories of identity they feel are\nmost salient, less salient, powerful or privileged, and stigmatized or oppressed for\nthemselves and discuss in small and large groups. This activity aligns to:\n● Goal 2: empathize with how intersectional identities can inform experiences in\neducation\n● Objective 1: articulate the intersectional identities you hold\nSupplies\n● Poster-sized sticky notes (~8 sheets)\n● Large markers\n● 4 unique combinations of color and shape sticky notes or stickers (to ensure\nparticipants with impaired color vision can distinguish the different options)\n○ 2 of each shape/color combination per participant\nTiming: 35 minutes\n● Instructions overview: 5 minutes\n● Activity: 15 minutes\n● Discussion: 15 minutes\nDetailed Guide\nBefore the session starts, hang 8 poster-sized sticky notes (they should be spaced out)\naround the room with the following labels written on them:\n● Gender\n● Health and Ableness\n● Race and Ethnicity\n● Sexual Orientation\n\n● Socioeconomic Status\n● Immigration Status\n● Religion and Spirituality\n● Specify (a catchall for categories not\nalready mentioned)\nEach participant should have 2 of each of the 4 different color and shape combinations\nbefore the activity begins. We recommend placing these at each seat in the room when\nsetting up. We have found that unique color and shape combinations work best for\naccessibility.\nGive a brief overview of the whole process: We will go through 4 rounds of questions\ncorresponding to each of the different colors/shapes. In each round, place your 2 stickers\nin 2 categories that answer the question for you and then find a partner to discuss briefly.\nThen walk participants through the activity step by step. First, ask participants to place a\nsticker on the two identity categories in which they relate to most closely (are most\nsalient). After this placement, they should find someone at the same identity board to\nhave a short discussion. Repeat this process for identities that: do not relate to closely\n(less salient), feel the most oppressed or stigmatized, and have the most power or\nprivilege. Again, be sure to pause between each round for a brief partner discussion.\nAfter the 4 rounds of placement and partner discussion, engage in a large group\ndiscussion. You do not need to ask all of these questions, but we recommend some\ncombination of:\n● Which color/shape was the most challenging and which color/shape was the\neasiest for you to categorize? Why do you think this is the case?\n● Did you place multiple colors/shapes in the same category?\n● How do the different categories you identified in each round influence each\nother?\n● As a group, where are the different colors/shapes placed? How does this compare\nto your own categorization?\n● What patterns do you notice? What information is missing from these visuals?\nWe like to end with a final question: Why did we do this activity?\nWith the goal of helping participants make the following connections:\n● We all have multifaceted identities, many of which are not visible.\n● Educational settings are diverse places. Even if 2 people share an identity, it does\nnot mean their feelings about them are similar.\n\n● Awareness of our own identities, and how they relate to the identities of others, is\nthe first step to building empathy and an inclusive learning environment. This will\nultimately make it easier for us to communicate with, teach, and mentor others.\nFacilitation Tips\nBuild trust: this activity can be vulnerable and uncomfortable, so it might help to\nacknowledge this fact, remind folks of the ground rules, and provide your own examples\nduring the instructions for each round (especially of the Specify category). Also, be sure\nto mention that folks are welcome to participate at the level they feel safe doing so and\nto remember the difference between safety (required for learning) and comfort (not\nalways necessary to learn).\nConnecting Identity to Education\nSynopsis\nIndividual online reflection activity. In this section we will be bridging the\nidentity-focused work in the Intersectional Identity Activity with the upcoming activity\nexamining teaching practices. Briefly describe some strategies for supporting\nunderrepresented learners and then have participants reflect on their own experiences\nin education. This activity aligns to:\n● Goal 2: empathize with how intersectional identities can inform experiences in\neducation\n● Objective 1: articulate the intersectional identities you hold\n● Objective 2: identify how different teaching practices can be received by diverse\naudiences\nTiming: 15 minutes\n● Description of some supports for underrepresented learners: 5 minutes\n● Online reflection Connecting Identity and Education: 10 minutes\nDetailed Guide\nDescribe some broad strategies that are helpful for underrepresented learners. These\nare general practices that particularly help students feel supported in environments that\nmight otherwise feel unwelcoming.\n● Prepare ahead of time- know your resources and what you can provide to\nlearners. Are there resources at your institution that you can provide? This can be\n\nincluded in your syllabus. Examples include accessibility office, office for\nunderrepresented students, counseling services, etc.\n● Check in regularly- be willing to check in with students who might be struggling.\nTry to notice when someone seems like something is bothering them or if\nsomething is off.\n● Validate concerns- when someone comes to you, try to validate them instead of\ngiving excuses or explaining why they might be wrong\n● Provide community- if you cannot provide shared community and support to the\nlearner, can you connect them with people who can support them? Try not to\ndirectly connect them with a mentor/support based solely on shared background,\nbut instead provide them a menu of options to choose from so they can select the\nperson that is right for them.\n● Create psychological safety- create an environment where learners feel safe. This\ncan include providing options to step out, pass in group discussions, and\nrespecting pronouns.\nNext, invite participants to select 1 of the 3 questions found in the Connecting Identity\nand Education section to answer for their own reflective purposes. Remind participants\nthis will not be shared out. The three question options address themes of identity\naffirmation in education, identity as an asset to learning, and identity in teaching.\nFacilitation Tips\nParticipant signals: We like to ask participants to partially close their laptop/tablet when\nthey are done with the reflection to help us keep track of where participants are in the\nactivity.\nReflective Teaching\nSynopsis\nIn-person large group discussion and individual online reflection activity. The\nReflective Teaching cycle is introduced by the facilitators. Through a worked example,\nparticipants as a group answer a set of questions to demonstrate how to examine a focal\nteaching practice. After the worked example, participants are encouraged to try it out\nindividually. The purpose of this activity is to get participants in the habit of reflecting\nupon their teaching style, rather than following a prescriptive checklist. This activity aligns\nto:\n\n● Goal 1: foster a reflective teaching style with a growth mindset toward\nimprovement\n● Goal 2: empathize with how intersectional identities can inform experiences in\neducation\n● Objective 2: identify how different teaching practices can be received by diverse\naudiences\n● Objective 3: identify strategies that promote inclusivity\nSupplies\n● Poster board sticky notes (~2 sheets)\n● Large markers\nTiming: 30 minutes\n● Introduction and worked example: 10 minutes\n● Applying a Reflective Approach to a Teaching Practice online: 10 minutes\n● Debrief: 10 minutes\nDetailed Guide\nDescribe the process of reflective teaching: Being a reflective teacher means that you\nsystematically use self-reflection to critically examine your pedagogical choices, their\nimpact on students, and potential solutions to classroom challenges. Similar to the\nscientific method, a reflective teaching practice starts with a question and requires you to\ngather data from multiple sources, evaluate that information, and draw conclusions to\nrevise your teaching practices accordingly. Reflective teaching is an iterative approach to\ninstruction that is always in process.\nProvide an example of what this might look like:\n● Question: Am I grading assessments fairly?\n● Data: Look at student performance on assignments across time, feedback from\nstudents, invite a peer to talk about your grading scheme, and other observations\nyou or your colleagues make.\n● Evaluation: Is there a consistent pattern that emerges through the\ndata/observations? Are some of these sources more reliable or important than\nothers?\n● Conclusions: Does my current method produce results consistent with an\ninclusive teaching and learning environment?\n\n● Next Steps: Revise and iterate your practice. For example, add more detail to\nrubrics, modify exam formats, or institute more flexible deadlines.\nWe provide a set of questions that guide the process of examining focal teaching\npractices. If we examine the ways we teach, we can find areas for making our teaching\npractices more inclusive. When facilitating, we typically select the process of cold-calling\n(asking a student to contribute to class without them volunteering) as our worked\nexample. Some potential responses are indicated below.\nCold-calling\n● Why might I use this practice?\n○ The instructor wants to encourage participation or is uncomfortable with\nsilence.\n● What is implied about my values and expectations for students?\n○ The instructor values quick-thinking and frequent verbal contributions.\n○ Students are expected to answer quickly and correctly when called upon.\n● Which student behaviors are encouraged and which are discouraged by using this\npractice?\n○ Some students may be stressed or anxious, which could negatively\ninfluence their reception of material, reducing motivation to participate.\n○ Some students may find this motivating, or appreciate the opportunity to\nparticipate.\n○ This practice may encourage quick-thinking or second-guessing.\n○ This practice could discourage thoughtful responses.\n● Who is left out and who is welcomed to learn as a result of this practice?\n○ Socially anxious students may not feel comfortable in this classroom.\n○ Shy students may feel like they are given a dedicated opportunity to\nparticipate.\n● Is this practice more or less inclusive? What could be done to modify this practice\nto ensure inclusivity?\n○ Less inclusive. Bias in who the facilitator calls on can marginalize some\nparticipants. This practice takes away a sense of autonomy in participation.\nTo improve it, we could: randomize roll call using a roster/random number\ngenerator/etc., ask students ahead of time to indicate if they are willing to\nbe called upon, establish that this is an expectation of class from the first\nday, normalize \"passing\", and create a culture of respect and value for all\ncontributions.\n\nParticipants then have time to repeat this process by themselves by selecting a different\nfocal teaching practice of their own and working through Applying a Reflective Approach\nto a Teaching Practice. After that, try a \"go-around\" where each participant can share\nwhat focal practice they analyzed, an insight from that analysis, or pass.\nFacilitation Tips\nKeep it moving: Brainstorming responses to the guiding questions for the worked\nexample should go fairly quickly. We want participants to offer ideas, with one facilitator\nnavigating discussion, and the other taking notes on a poster-sized sticky note.\nWrap Up Part 1/Homework Instructions\nSynopsis\nIn-person and online. The content of this section will look slightly different depending on\nthe format of your workshop. The purpose of this activity is to transition out of the Identity\nand Reflective Teaching sections and into application of these principles.\nTiming: 15 minutes\n● Both formats- Complete Survey 1 as a post-test (for a hard copy see Appendix): 5\nminutes\n● If one all-day session- Share an insight or question from this session: 10 minutes\n● If two-session format- Preview of homework with instructions and demonstration:\n10 minutes\nDetailed Guide\nAfter the reflective teaching practice go-around, invite participants to fill out the Survey 1\nas a post-test from this part of the workshop (for a hard copy see Appendix)\nIf one all-day session: Share an insight or question you have from this session.\nIf you have time after the post-survey, you can do another go-around in the opposite\ndirection with every participant having an opportunity to share, or if time is tight, ask for a\nfew participants to offer questions and insights.\nIf two-session format: Review homework instructions and demonstrate course\nnavigation.\n\nInstruct participants to complete Survey 2 as a pre-test before starting the homework (for\na hard copy see Appendix). Demonstrate how to navigate the Scenario-Based Learning\nApplications section. Tell participants to use the link sheet to navigate to 3 different\nsections (Preparing Inclusive Materials, Designing Equitable Instructional Activities and\nAssessments, and Interacting with Diverse Students) of thematically-related scenarios\nthat will help guide them in distinguishing more inclusive practices from less inclusive\nones. For the homework, participants are invited to explore:\n● 1 scenario question from Preparing Inclusive Materials,\n● 2 scenario questions from Designing Equitable Instructional Activities and\nAssessments,\n● and 3 scenario questions from Interacting with Diverse Students.\nParticipants should not explore the video critiques as we will involve those in another\nactivity.\nFacilitation Tips\nElaborated explanations: Whether as part of homework or in small groups (see\nDiscussion of Homework/Online Scenario Group Work), it is very important to remind\nparticipants to click the Show Answer button after submitting an answer to learn more in\nthe online Module. There are incredibly detailed explanations that explain the logic and\nprovide references and resources for each assessment in the course.\nOverview and Review of Inclusive Themes\nSynopsis\nIn-person review. The purpose of introducing inclusive teaching themes is to provide a\nheuristic for identifying more inclusive practices by comparing these broad themes to\nspecific applications.\nTiming: 5-15 minutes\n● If two session format- Review of learning goals and objectives and ground rules:\n10 minutes\n● Both formats- Introduction of inclusive learning themes: 5 minutes\nDetailed Guide\nIn a two-session format, we encourage facilitators to take time to review the ground rules\nand learning goals and objectives before discussing the themes of inclusive teaching. In\n\none all-day session, you can skip the ground rules, learning goals, and objectives and go\nstraight into the discussion of inclusive teaching themes.\nIntroduction of inclusive learning themes:\n● Demonstrating respect and empathy for the whole student: Mutual respect and\nunderstanding is vital to interpersonal educational dynamics. If you extend\nkindness, understanding, and appreciation to your students you will see it return.\n● Encouraging autonomy and self-efficacy: By helping our students make\neducational decisions that are consistent with their values and instilling in them a\nbelief that they can succeed, they can become empowered in their educational\njourney.\n● Valuing open communication and transparent policies: By communicating with\nour students clearly and effectively, we can share a mutual understanding of not\nonly what is expected when and how, but why. By engaging in open, transparent\ncommunication, we also demonstrate respect and encourage autonomy.\n● Fostering belonging and personal connections: When we feel like we truly\nbelong to a group, like as scientists, researchers, academics, or artists- we are\nmore likely to persist in that group and make meaning out of our experiences. This\nprocess helps grow the network of our student's into a community where they feel\nat home.\n● Centering growth, accessibility, and flexibility: We all have something to learn, so\nremaining amenable to change both big and small is important to adapt and adjust\nto the unpredictability of life. To help with that uncertainty, we must also tirelessly\nwork to ensure that access - to educational content, instructor empathy,\nresources, and more - is preserved.\nFacilitation Tips\nWhat questions can I answer? Is an inviting way to normalize and encourage\nquestion-asking. Remember to pause for questions throughout the workshop, especially\nduring the more exposition-heavy sections.\nDiscussion of Homework/Online Scenario Group Work\nSynopsis\nSmall group work in person and/or online. The timing of this section will look slightly\ndifferent depending on the format of your workshop. The shared purpose of these\nactivities is to encourage participants to explore different teaching scenarios and\n\ndetermine more inclusive responses using the online Module and compare ideas in small\ngroups before sharing out more broadly. These activities align with:\n● Goal 1: foster a reflective teaching style with a growth mindset toward\nimprovement\n● Goal 3: develop tools and strategies for inclusive practices\n● Objective 2: identify how different teaching practices can be received by diverse\naudiences\n● Objective 3: identify strategies that promote inclusivity\nTiming: 50 minutes\n● If one all-day session- small group work of scenarios: 30 minutes\n● If two-session format- homework (described in Wrap Up Session 1/ Homework\nInstructions): 30 minutes\n○ Both formats include Survey 2 as a pre-test (for a hard copy see Appendix)\n● Both formats- Small group discussion of scenarios: 10 minutes\n● Both formats- Takeaways: 10 minutes\nDetailed Guide\nIf one all-day session: small group work\nFirst, instruct individuals to complete Survey 2 as a pre-test (for a hard copy see\nAppendix).\nThen, in groups of 3-5 (depending on final enrollment) instruct participants to complete\nthe Scenario-Based Learning Applications together. Each group should complete at least:\n● 1 scenario question from Preparing Inclusive Materials,\n● 2 scenario questions from Designing Equitable Instructional Activities and\nAssessments,\n● and 3 scenario questions from Interacting with Diverse Students.\nRemind participants to click Show Answer after submitting an answer for more\ninformation. After the end of this activity, instruct small groups to disassemble and reform\nwith different people.\nIf two-session format: individual computer work\nParticipants are expected to complete the Survey 2 as a pre-test (for a hard copy see\nAppendix) and homework (described in Wrap Up Session 1/ Homework Instructions) on\ntheir own before the start of the second session. You may want to open the workshop\nspace for 30 minutes before the workshop is scheduled to begin and let participants\nknow they can come early to finish the homework during that time.\n\nBoth formats: small and large group discussion of scenarios\nWhether one session or two, in the (new) small groups, encourage participants to discuss\nthe following:\n● Which scenarios did you explore previously?\n● Which theme(s) of inclusive teaching did each of these scenarios address?\n● Did anything surprise you? What did you learn?\n● How do you think your students will respond to the practices encouraged by\nthese scenarios?\n● What might be barriers to implementation? How could you resolve them?\nAfter small groups have time to discuss, invite a representative from each small group to\nsummarize what was discussed and any takeaways that emerged from their discussions.\nFacilitation Tips\nMonitor discussion: It helps to move around from small group to small group to listen in\non discussion to have a sense for how it is going and if you need to redirect any\nconversation.\nVideo Critiques\nSynopsis\nLarge group discussion with online resources. In this activity, participants watch short\npairs of video scenarios. There are 4 scenarios, each with 2 scenes. Scene A is a less\ninclusive way and Scene B is a more inclusive way of navigating the same situation. A\nlarge group discussion follows after each scene. This activity aligns to:\n● Goal 1: foster a reflective teaching style with a growth mindset toward\nimprovement\n● Goal 3: develop tools and strategies for inclusive practices\n● Objective 2: identify how different teaching practices can be received by diverse\naudiences\n● Objective 3: identify strategies that promote inclusivity\nTiming: 35-65 minutes\nVideos are found in the Video Critiques section of the Module\n● If one all-day session- watch all 4 scenarios and discuss: 60 minutes\n\n● If a two-session format- have participants vote on 2 scenarios they want to explore\nand discuss: 30 minutes\n● Both formats: Survey 2 as a post-test (for a hard copy see Appendix): 5 minutes\nDetailed Guide\nBefore you start watching videos it can help to provide some context for the activity:\nResponding in the moment is one of the most challenging parts of instruction. Our\nintentions to be supportive and mindful educators are a great place to start, but\nsometimes our intentions are not translated effectively into action or become muddled in\nmissteps and mistakes. Perfection is not a realistic expectation; we simply must try our\nbest, be thoughtful, and confront the impacts of our actions with humility, no matter our\nintention. The following video scenarios contain paired scenes grounded in real\nexperiences that are meant for you to practice critiquing responses based on what you\nhave learned about inclusive teaching so far. Each video contains two versions of the\nsame scenario, one scene that is less inclusive (Scene A), followed by another that is an\nimproved response (Scene B). We will critique and discuss each scene.\nIf you have limited time and cannot watch all 4 scenarios, have participants vote by a\nshow of hands which 2 scenarios they prefer. Regardless of whether or not you can\nexplore all scenarios, the following discussion questions can help guide the group\nconversation.\nAfter Scene A\n● What are some possible good intentions behind Scene A?\n● What are some criticisms you can make of Scene A? What are the potential\nnegative impacts?\nAfter Scene B\n● How does Scene B avoid or correct the criticisms and impacts from Scene A?\n● How else could you respond to this or a similar situation in your own teaching\ncontext?\nAfter discussion has ended, invite participants to complete Survey 2 as a post-test (for a\nhard copy see Appendix) before moving onto the next activity.\n\nFacilitation Tips\nVideo player: You may play the videos through the Video Critiques section of the online\nModule or download them locally and embed them into your slides for ease of\nfacilitation.\nGallery Showcase\nSynopsis\nIn-person small and large group activity. We typically only implement this activity during\nan all-day workshop when we have more time for participants to continually think and\nadd more ideas throughout the session. Participants brainstorm useful inclusive teaching\npractices in specific learning contexts and discuss implementation, including sharing their\nown inclusive teaching triumphs. This activity aligns to:\n● Goal 3: develop tools and strategies for inclusive practices\n● Objective 4: create an action plan to address inclusivity in your classroom.\nSupplies\n● Poster-sized sticky notes (with ~4 sheets)\n● Large sticky notes\n○ Each participant should have 3-5\nTiming: 30 minutes\n● Gallery debut: 10 minutes\n● Form small groups discussion: 10 minutes\n● Report out to large group: 10 minutes\nDetailed Guide\nSet up poster-sized sticky notes with four different types of teaching contexts around the\nroom (e.g., labs, large enrollment lecture, discussion-based, virtual) after the\nIntersectional Identity Activity. These can be any teaching contexts that are most relevant\nto your participants. Invite participants to add examples of inclusive strategies that fit\neach context throughout the day.\nWhen it comes time for the gallery debut portion, ask participants to move around the\nroom, take notes, and continue to add to the different boards. Then invite participants to\nassemble around a board that they want to explore in more depth (you may have to\n\nbreak groups up or ask to redistribute if too big). Remind participants this does not have\nto be a board that they personally added to. Encourage participants to discuss what\nimplementation of the strategies on the board would look like in that context. Finally,\nhave a representative of each board summarize what was discussed to the whole group.\nFacilitation Tips\nTime to think: This activity should be introduced early in the workshop, but will not\nactually take place until the end of the day. This gives participants time to add to the\nboards as they become more familiar with different inclusive teaching practices.\nAction Plan\nSynopsis\nIndividual online activity and partner discussion. In the final activity of the workshop,\ninvite participants to create a personal action plan to take the next step in their inclusive\nteaching journey and discuss it with a partner. This activity aligns to:\n● Goal 3: develop tools and strategies for inclusive practices\n● Objective 4: create an action plan to address inclusivity in your classroom.\nTiming: 45-50 minutes\n● Create a detailed plan for 1-3 inclusive practices with the Action Plan section of the\nModule: 20 minutes\n● Pair with a neighbor and share ideas: 10 minutes\n● Go around - share action plans/reflections: 15-20 minutes\nDetailed Guide\nParticipants have the opportunity to apply what they have learned throughout the\nworkshop and craft their next steps in implementing inclusive teaching practices.\nParticipants use the Action Plan section of the Module to identify 1-3 practices they want\nto try and answer questions that are designed to have them think through the\nimplementation considerations for each practice.\nAfter participants have the opportunity to answer this series of questions, they are asked\nto pair up and describe their plans. The workshop concludes with another go-around,\nwhere participants are invited to share 1 teaching practice they want to implement.\n\nFacilitation Tips\nRemind pairs to share: During the paired portion of the action plan, give a 5 minute\nwarning so that both members of the pair have ample time to share their ideas with each\nother. Typically the group share-out can go long, so be sure to leave plenty of time for\nthat final part of the activity.\nAfterwards, Evaluation, and Additional Information\nWorkshop Feedback\nWe want to continue to learn from our work as facilitators and offer the best possible\nlearning experience to participants. To that end, we ask participants to complete a simple\ndigital workshop evaluation form (see Appendix) at the very end of the workshop. This\nfeedback helps us determine how we may tweak our facilitation practices, materials, or\nworkshop format. It is very important to us that participants share honest feedback, so we\nlike to use an online form to collect responses anonymously.\nPost-Workshop Communication and Certification\nAfter our workshops, we distribute the slides as pdfs (see Appendix). This meets the\nneeds of participants for physical notes they can reference with our need as facilitators to\nkeep folks focused and attentive during the workshop activities. In addition to slides, we\nalso send out certificates (see Appendix) to the participants that complete all the\nworkshop activities. In our post-workshop email, we also thank participants and remind\nthem to complete the workshop evaluation form if they have not done so, yet. This is also\na good opportunity to follow up on any questions or requests for resources that you\ncould not attend to or answer during the workshop.\nPotential Analyses\nThere are built-in pre/post tests embedded in the course site, but we understand if it is\nimportant to your institution if you measure your own outcomes. We strongly suggest\nusing the same 8 questions on a seven-point Likert-like scale (1= Strongly Disagree, 4=\nNeutral, 7= Strongly Agree) we developed (see Appendix) that align to the learning goals\nand objectives, at the times stated in this guide. You can number each of your pre and\npost surveys with a de-identifying code to keep them anonymous, but also paired. After\ndata collection, we illustrate our results using histograms of pre/post responses and\nanalyze these data further (sample size permitting) using a paired Wilcoxon signed rank\ntest for each of the 8 questions with a Bonferroni correction for multiple tests.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\nResource: Inclusive Teaching Module\nDarcy G. Gordon, Catherine Drennan\nThe following may not correspond to a particular course on MIT OpenCourseWare, but has been\nprovided by the author as an individual learning resource.\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}