{
  "course_name": "Biology Teaching Assistant (TA) Training",
  "course_description": "The MIT Biology Department supports TAs’ teaching by providing a specialized Teaching Assistant (TA) training program in Biology Pedagogy, for which TAs can earn a training certificate. This program has been developed in response to the feedback of previous TAs, and is designed to actively meet each TA’s needs as they are teaching. It provides practical knowledge that directly relates to their teaching responsibilities each week, and provides them with the opportunity to practice different skills and techniques in a supportive environment.",
  "topics": [
    "Teaching and Education",
    "Curriculum and Teaching",
    "Teaching and Education",
    "Curriculum and Teaching"
  ],
  "syllabus_content": "Biology Pedagogy Program Overview\n\nThis semester we will be supporting your teaching by providing a specialized Teaching Assistant (TA) training program in Biology Pedagogy, for which you can earn a training certificate. This program has been developed in response to the feedback of previous TAs, and is designed to actively meet your needs as you are teaching. It will provide practical knowledge that directly relates to your teaching responsibilities each week, and you will have the opportunity to practice different skills and techniques in a supportive environment.\n\nThere are six core sessions for the training program (1hr each):\n\nOrganizing a recitation section to promote student learning\n\nKeeping students engaged\n\nCreating an inclusive classroom\n\nProviding constructive, equitable feedback\n\nHow students learn\n\nSupporting our students\n\nFor the remaining sessions, you will have the option to choose your own adventure, and must choose at least one of the following special sessions to attend:\n\nWriting effective questions\n\nMaking material relevant to motivate students\n\nTeaching students how to learn\n\nHelping students to learn the language of Biology\n\nLeveraging your teaching experience for the future\n\nThose who attend all 6 core training sessions, participate in a teaching observation session, and attend at least one \"choose your own adventure\" session, will receive a Biology Pedagogy Program Certificate from the department to acknowledge your accomplishment in completing the training program and pursuing professional development in teaching. For Biology graduate students, each pedagogy session you attend can also count toward your Professional Development requirement for the Biology graduate program.\n\nGoals & Intended Learning Outcomes\n\nGoals for TAs\n\nCommunicate\nclearly with a broad audience on a variety of topics in biology, and thoughtfully address questions which may arise in this setting.\n\nPresent\nin a way that effectively aids communication, taking into account organization of materials, use of classroom space, and physical presence (i.e. body language, facial expression, tone, etc.).\n\nCreate a respectful learning environment\nwhere students feel comfortable participating in the classroom, and teaching staff can work as a team to best serve students.\n\nFraming Discussion Slides (PDF)\n\nInstructor-TA agreement Form (PDF)\n\nIntended Learning Outcomes (ILO)\n\nILO1: Articulate strategies for recitation organization that promote student learning\n\nILO2: Describe the features of feedback that is effective and encourages a growth mindset\n\nILO3: Describe active learning strategies and explain their importance\n\nILO4: Identify how different teaching practices can be received by diverse audiences, and assess strategies that promote inclusivity\n\nILO5: Identify ways of communicating with students that promote a growth mindset and minimize stereotype threat.\n\nProgram requirements\n\nPre-semester statement of teaching goals\nYour Goals for Teaching worksheet (PDF)\n\nCompletion of 6 core pedagogy sessions\n\nCompletion of 1 special session\n\nAn instructor-led teaching observation and debrief\nBiology TA Feedback Form (PDF)\n\nCore sessions\n\nSession 1 (pre-semester) - Organizing a recitation section to promote student learning\n\nSession 2 (pre-semester) - Keeping students engaged\n\nSession 3 - Creating an inclusive classroom\n\nSession 4 - Providing constructive, equitable feedback\n\nSession 5 - How students learn\n\nSession 6 - Supporting our students\n\nSpecial sessions\n\nSession 7- Writing effective questions\n\nSession 8 - Making material relevant to motivate students\n\nSession 9 - Teaching students how to learn\n\nSession 10 - Leveraging your teaching experience for the future\n\nAcknowledgements\n\nThe course instructor would like to acknowledge the contributions of Dr. Darcy Gordon, Instructor of Blended and Online Initiatives in the MIT Biology Department, who created materials and activities used in sessions 3 & 4. In addition, the instructor would like to acknowledge the contributions of the TA Training Team, Dr. Mary Ellen Wiltrout, Director of Online & Blended Learning Initiatives in the MIT Biology Department, and MIT Biology Graduate students Alice Lydia Herneisen, Nima Jaberi-Lashkari, and Byron Lee, who created the Instructor-TA Agreement Form and the TA Feedback Form.",
  "files": [
    {
      "category": "Resource",
      "title": "RES.7-005 Biology TA Training, Session 1: Lesson Planning Worksheet",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-7-005-biology-teaching-assistant-ta-training-fall-2021/lesson-planning-worksheet_.pdf",
      "content": "Lesson Planning Worksheet\nIncorporating Active Learning and Inclusivity into your Recitations\nCheck-in &\nOutline\n● How will you check in with your students at\nthe beginning of recitation?\n● How will you communicate your goals for the\nday? Are there any announcements to share?\n\nKnowledge\npractice\n● What difficult or important concepts from the\nlecture(s) do you want to prioritize?\n● How will you review these topics in a way that\nengages your students?\n\nSkills\npractice\n● What do students need to know how to do\nwith the material from the lecture(s)? How can\nyou give them practice with these skills?\n● Will you work on questions as a class?\nIndividually? In small groups?\n● How will you ensure everyone has a chance\nto engage with each question?\n● How will you make sure everyone is\nunderstanding?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n\nRES.7-005 Biology Teaching Assistant (TA) Training\nSummer 2020\n\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "RES.7-005 Biology TA Training, Session 2: Active Learning Activities Breakout Groups",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-7-005-biology-teaching-assistant-ta-training-fall-2021/session-2_-active-learning-activities-breakout-groups.pdf",
      "content": "Techniques from: \"Interactive Techniques\" by Kevin Yee Creative Commons BY-NC-SA.\n\nGroup 1: Intentional mistakes\nGive students a worked problem that contains some mistakes. Have students, as a class or in\nsmall groups, find mistakes and then make the corrections.\n\nPurpose (Why is this a helpful technique? What will students gain from it?):\n\nFollow-up (How will you wrap-up your conversation and make sure everyone is on board?):\n\nExample (For what types of problems/concepts would this be useful?):\n\nTechniques from: \"Interactive Techniques\" by Kevin Yee Creative Commons BY-NC-SA.\n\nGroup 2: Pro/Con Grid or Ranking alternatives\nFor a given scenario, everyone thinks up as many alternative courses of action (or explanations\nof the situation) as possible. Students list out the pros and cons for each approach, and/or rank\nthem by preference.\n\nPurpose (Why is this a helpful technique? What will students gain from it?):\n\nFollow-up (How will you wrap-up your conversation and make sure everyone is on board?):\n\nExample (For what types of problems/concepts would this be useful?):\n\nTechniques from: \"Interactive Techniques\" by Kevin Yee Creative Commons BY-NC-SA.\n\nGroup 3: Picture Prompt\nShow students a complex image with no explanation, and ask them to identify/explain it, or to\nname the processes and concepts shown. Let students explore all options before intervening.\n\nPurpose (Why is this a helpful technique? What will students gain from it?):\n\nFollow-up (How will you wrap-up your conversation and make sure everyone is on board?):\n\nExample (For what types of problems/concepts would this be useful?):\n\nTechniques from: \"Interactive Techniques\" by Kevin Yee Creative Commons BY-NC-SA.\n\nGroup 4: Blank-page review\nInstruct students to write as much as they can remember about a topic or section of the lecture\nwithin a defined period of time (3-5 min). Do this at the beginning of class, with notes away,\nencouraging students to write the whole time.\n\nPurpose (Why is this a helpful technique? What will students gain from it?):\n\nFollow-up (How will you wrap-up your conversation and make sure everyone is on board?):\n\nExample (For what types of problems/concepts would this be useful?):\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n\nRES.7-005 Biology Teaching Assistant (TA) Training\nSummer 2020\n\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "RES.7-005 Biology TA Training, Session 3: Inclusive Classroom Shared Document",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-7-005-biology-teaching-assistant-ta-training-fall-2021/session-3_-inclusive-classroom-shared-document.pdf",
      "content": "Group activity\nAs a group, choose one common teaching practice and examine it by answering the reflection\nquestions on your group's page.\n\nExample teaching practices (may or may not be inclusive!):\n1. Leaving time for questions at the end class\n2. Asking a question that has many possible answers and have every student share a brief\nanswer\n3. Waiting for at least 5 students to raise their hands before you call on anyone after asking\na question\n4. Assign reporters for small groups discussion\n5. Learning students' names\n6. Giving students time to write\n7. Using think-pair-share (students have time to think about a question, then discuss it with\na partner, and finally report out on their discussion)\n8. Responding to correct answers with \"excellent job\" and \"great answer\"\n\nGroup 1 Reflection\nGroup Members:\nTeaching practice examined:\n\nWhy might I use this practice?\n\nWhat is implied about my values and expectations for students?\n\nWhich student behaviors are encouraged and which are discouraged by using this practice?\nWhich students are affected?\n\nDo you think this practice is more or less inclusive? What could be done to modify this practice\nto ensure inclusivity?\n\nGroup 2 Reflection\nGroup Members:\nTeaching practice examined:\n\nWhy might I use this practice?\n\nWhat is implied about my values and expectations for students?\n\nWhich student behaviors are encouraged and which are discouraged by using this practice?\nWhich students are affected?\n\nDo you think this practice is more or less inclusive? What could be done to modify this practice\nto ensure inclusivity?\n\nGroup 3 Reflection\nGroup Members:\nTeaching practice examined:\n\nWhy might I use this practice?\n\nWhat is implied about my values and expectations for students?\n\nWhich student behaviors are encouraged and which are discouraged by using this practice?\nWhich students are affected?\n\nDo you think this practice is more or less inclusive? What could be done to modify this practice\nto ensure inclusivity?\n\nGroup 4 Reflection\nGroup Members:\nTeaching practice examined:\n\nWhy might I use this practice?\n\nWhat is implied about my values and expectations for students?\n\nWhich student behaviors are encouraged and which are discouraged by using this practice?\nWhich students are affected?\n\nDo you think this practice is more or less inclusive? What could be done to modify this practice\nto ensure inclusivity?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n\nRES.7-005 Biology Teaching Assistant (TA) Training\nSummer 2020\n\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "RES.7-005 Biology TA Training, Session 6: Supporting Our Students Scenarios",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-7-005-biology-teaching-assistant-ta-training-fall-2021/session-6_-supporting-our-students-scenarios.pdf",
      "content": "Student scenarios:\n1. A student that does poorly on the first assignment. There is a student in your recitation\nwho fails the first major assignment. This student is an active participant in the\nclassroom, and has shown significant improvement on subsequent assignments. They\nare worried about how this first failed assignment will affect their grade.\n2. A student that does poorly on multiple assignments. A student in your recitation fails\nseveral major assignments in the course. The student tells you they are struggling in\ntheir other courses too and are having a hard time keeping up with their extracurricular\nactivities. They want to know whether they should continue in the course.\n3. A student who says that \"Biology just isn't their thing\". A student in your recitation is\nstruggling in the course but tells you they are doing well in all of their other classes. They\nare frustrated and don't understand why they are doing poorly, especially since they did\nwell in Biology in high school.\n4. A student whose behavior changes suddenly. A student who regularly attends your\nrecitation, and is typically thoughtful and engaged, appears to be disconnected during\nclass and has struggled to complete recent assignments. The assignments that they do\nturn in are only partially completed and show significant gaps in understanding.\n5. A student with repeated missing assignments. It is about half way through the semester\nand you have a student that has stopped turning in their assignments altogether. This\nstudent has never attended your recitation, and only attends class about half of the time.\n6. A student that asks tangential questions. You have a student that frequently asks\nquestions during recitation that are beyond the scope of the course. These questions\ndemonstrate that the student has an advanced understanding of the material, but it often\nconfuses other students in your section and you are finding it disruptive to the flow of\nrecitation.\n7. A student who is disrespectful of their peers. During discussion, a student asks a\nquestion that you already answered and another student chimes in with, \"And here I\nthought there was no such thing as a dumb question!\" which is met with snickering and\nrolled eyes from the rest of the class.\n8. A student who calls you in. You are going through a problem related to genetic\ninheritance and pedigrees and have been referring to the genetic donors as \"mom and\ndad\". A student approaches you after class and reveals that this language feels a bit\nexclusionary for transgender and non-binary folks, and for those with non-traditional\nfamily structures.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n\nRES.7-005 Biology Teaching Assistant (TA) Training\nSummer 2020\n\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "RES.7-005 Biology TA Training, Session 7: Tips for Assessment Construction",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-7-005-biology-teaching-assistant-ta-training-fall-2021/session-7_tips-for-assessment-construction.pdf",
      "content": "Tips for constructing assessments\nAdapted from: Teaching at Its Best: A Research-Based Resource for College Instructors by Linda B. Nilson\nMultiple choice/Select all\nAdvantages\nDisadvantages\n● Easy and quick to grade\n● Can efficiently assess remembering,\nunderstanding, application, analysis,\nevaluation, and creating\n● Useful as a diagnostic tool (wrong\nchoices can indicate misconceptions)\n● Familiar to students\n● Sometimes difficult and time-\nconsuming to construct\n● Encourages students to find the\ncorrect answer by process of\nelimination\n\n-\nWrite the correct response first, then the distractors (incorrect responses)\n-\nJuggle the elements or variables of a correct response, or substitute a correct variable\nfor one that students confuse it with to create distractors\n-\nMake all responses grammatically parallel and about the same length\n-\nMake all responses equally plausible and attractive\n-\nAddress one concept per question\n-\nStrive for clarity and conciseness\n-\nPresent the options in some logical order to resist cuing student into a pattern\n-\nUse 3-5 responses per question\n-\nIncorporate graphics where appropriate\n-\nIf you use \"all of the above\" or \"none of the above,\" use it liberally (not just when that\nanswer is correct)\n-\nInclude in the stem any words that may repeat in the response alternatives\n-\nUse familiar language but avoid lifting phrases directly from lecture (this reduces thinking\nto simple recall)\n-\nMake no, not, never, none, and except stand out by bolding or underlining\nTrue or False\nAdvantages\nDisadvantages\n● Usually easy to prepare and grade\n● Can test a lot of material in a short\ntime\n● Can tap higher levels of cognition by\nhaving students correct false\nstatements\n● Useful as a diagnostic tool if students\nhave to explain\n● High guessing factor\n● May be difficult to think of\nunequivocally true or false statements\n● Encourages instructors to test trivial\nfactual knowledge\n● Truly knowledgeable students may\nsee too many nuances, multiple\nmeanings, or conceive of exceptions\n● May contain verbal clues (never,\nalways, and every indicate false)\n\n-\nFocus each statement on a single idea\n-\nWrite positive statements (avoid negative or double negative)\n-\nAvoid verbal cues (usually, seldom, often, never, always, every)\n-\nUse only statements that are entirely true or entirely false\n-\nAvoid making true statements long and false statements short (or vice versa)\n-\nAvoid direct quotes (requiring memorization)\n-\nAdd higher level cognition by having students justify or rewrite false statements to make\nthem true\nShort Answer\nAdvantages\nDisadvantages\n● Easy to construct\n● Can assess remembering,\nunderstanding, application, analysis,\nevaluation, creating\n● Requires a command of vocabulary or\nproblem-solving skills\n● Very useful as a diagnostic tool\n● Encourages instructors to give\nstudents individual feedback\n● Time-consuming to grade\n● Difficult to standardize grading due to\nvariability across answers\n\n-\nBe very specific and concise in identifying the task that students are to perform\n-\nIdentify all the key points students should address\n-\nInstead of using what, why, or how, choose a descriptive verb that reflects what\nyou want students to do\n-\nUse familiar language from lecture, but new examples are great!\n-\nSpecify that students should show their work/thinking for full credit on problems, or if an\nillustration is required.\n-\nLeave an appropriate amount of space for the answers. In some cases you may even\nwant to specify the length of answers you are looking for.\nFill in the Blank\nAdvantages\nDisadvantages\n● Easy to prepare and grade\n● Can test a lot of material in a short\ntime\n● Assesses student's ability to\nremember (recall & vocabulary)\n● Eliminates guessing\n● Cannot assess higher levels of\ncognition\n● Highly structured and inflexible\n● Not useful as a diagnostic tool\n● May include grammatical clues\n● Difficult to construct so that the\ndesired response is unambiguous\n\n-\nUse clear wording to elicit a unique response\n-\nAvoid grammatical cues (use as/an and is/are)\n-\nOmit words from the middle or end of a statement, not the beginning\n-\nMake all fill lines the same length\n-\nUse familiar language (similar to lecture)\nAdditional tips\n-\nConsider the background of your students, and eliminate any unnecessary jargon\n-\nIf several questions on an assignment are based on a single scenario or set of\ninformation:\n-\nMinimize interlocking items (i.e. getting the first part of the question wrong leads\nto getting all later parts of the question wrong)\n-\nA longer or more complex set-up should be accompanied by a longer series of\nquestions\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n\nRES.7-005 Biology Teaching Assistant (TA) Training\nSummer 2020\n\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "RES.7-005 Framing Discussion Slides",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-7-005-biology-teaching-assistant-ta-training-fall-2021/framing-discussion_edited_processed.pdf",
      "content": "Goals for TAS - Why are we here?\n\nIntroduce yourself and share something you are excited to learn about!\nIntroductions - Who are we?\n\nTA training structure - What will this look like?\nFlexible training and support. Attend trainings that are most helpful for you, and get\nin touch when you feel stuck, confused, overwhelmed, or excited!\nTake things one step at a time. Our trainings are spaced out throughout the first half\nof the semester, so that you can learn new things as you need them.\nFocused trainings that save time and stress. We will focus on practical ideas and\nactivities that you can take with you each week.\nEveryone's teaching style is different. We will provide many different ideas related to\nteaching best practices - find what works for you and your students.\n\nLet's talk about:\n●\nWhat do you want this space to look like?\n●\nWhat expectations do you have for yourself\nand your colleagues?\n●\nWhat expectations do you have for us?\nIdentifying expectations - How will we do it?\nImage (c) Katerina Limpitsouni, unDraw. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nI hope that you will....\n●\nAsk questions!\n●\nEngage with activities - they are designed to help give you a leg up on\nyour TA responsibilities each week\n●\nBe respectful of fellow TAs, and thoughtful in your answers\nIdentifying expectations - How will we do it?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\nRES.7-005 Biology Teaching Assistant (TA) Training\nSummer 2020\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "RES.7-005 Session 1 Slides: Organizing a Recitation to Promote Student Learning",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-7-005-biology-teaching-assistant-ta-training-fall-2021/session-1_-organizing-a-recitation-section-to-promote-student-learning_edited_processed.pdf",
      "content": "Organizing a recitation section to promote\nstudent learning\nCreating a plan for recitation\n\nGoals for today:\nAfter this session, TAs should be able to...\n1. Articulate and implement strategies for recitation organization that\npromote student learning\n\nFramework for recitation organization\n●What is the goal of recitation?\n●What material should you cover?\n●How should the material be covered?\nImage (c) Katerina Limpitsouni, unDraw. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nWhat is the goal of recitation?\n\"teaching as dialogue\npresumes that teachers\nlisten and respond to their\nstudents' perspectives...\nrather than talking at\nstudents\"\nQuote from: \"Teaching as Dialogue: An Emerging Model\nof Culturally Responsive Online Pedagogy\" -APRIL\nLAWRENCE Journal of Online Learning Research\nVolume 6, Number 1, May 2020.\n(c) Association for the Advancement of Computing in\nEducation (AACE). All rights reserved. This content is\nexcluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/.\nFigure by Alexander Braile, used with permission.\n\nWhat does it look like for us to create a dialogue with\nour students?\n\nTeaching as dialogue - \"we do\"\nAsk open-ended questions\nConsider asking broad questions that have several possible responses\nPrompt deeper\nexplanations\n\"Why do you think that?\"\n\"Would you be willing to share how you got there?\"\nBring more folks into the\ndiscussion\n\"What else do folks think might be going on?\"\n\"What are some other ways of approaching this question?\"\nAcknowledge contributions\nIndicate student contribution holds value without asserting correctness.\n-\nrepeat student contributions to emphasize part of a response\n-\nask for clarification\n-\nsummarize\n-\nconnect student ideas to specific concepts from class\n\nWhat material should be covered?\nTake home message: Think about what students will need to be able to do\nto succeed in their assignments, and plan recitation to give them practice!\nIdentify difficult or\nimportant concepts\nPrepare condensed review\nand relevant problems\nIllustrations by Alexander Braile, used with permission.\n\nHow should the material be covered?\ncheck-in\nand\noutline\nprovide\nsummary\nKnowledge practice\nSkills practice\ntime\nTopic A\nTopic B\nTopic C\n\nKnowledge practice\nKnowledge\nKnowledge\nvs.\nKnowledge practice focuses on fact-based questions that...\n●\nexplore terminology\n●\nencourage recall\n●\ncheck comprehension\nIllustrations by Alexander Braile, used with permission.\n\nApplying\nand\nAnalyzing\nConcepts\nExplore\nconnections\nto other\ntopics\nCompare\nand\ncontrast\nideas\nExplore\nunfamiliar\ncontexts\nMake\npredictions\n& design\nexperiments\nEvaluate and\nmake a\njudgement\nLook at\nmultiple\nperspectives\nSkills practice\n\nBreakout groups\nINTRO\nCORE/UPPER\nLAB\n●\nSlide 1 provides some example approaches to\nrunning your recitation or laboratory section.\nThink about which approach(es) appeal to you\npersonally based on the context of your course.\n●\nSlide 2 presents you with a scenario or question\nrelevant to your recitation experience.\nTake a few minutes to brainstorm ideas individually\nand then discuss as a group. Use slide 1 as a\nresource.\n\n-\nBreak the question or problem down into parts\n-\nAsk students how they interpret the question\n-\nAsk students to describe how they would approach the question\n-\nModel the skill or approach\n-\nProvide an opportunity to reflect on the solution\nExample approaches to guiding skills practice\n(when you have a set of problems to work from)\nINTRO\n\nLet's practice!\nINTRO\nDiscuss what you can do to promote both knowledge and skills practice for\nstudents going through a question from your first recitation handout.\n[Provide an example of a problem from an Introductory Course]\n\nExample approaches for skills practice\n(when you're designing your own problems)\nCORE/UPPER\nYou don't need to design complex, exam-level questions to help students learn the skills\nneeded to succeed on their assignments! Consider the following ideas:\n●\nStudents identify several possible approaches for a particular scenario or experimental question .\nStudents can list the pros and cons for each, and/or rank them by preference.\n●\nAsk what would happen if a particular component broke, or a step was skipped in a particular process.\n●\nCreate a table where students decide if a feature is PRESENT or ABSENT in a series of scenarios\n(applies or does not apply, does or does not occur, etc.).\n●\nPractice using resources provided in class (tables, flow charts, etc.).\n●\nUse graphs or other images from the literature to test the concepts that students need to learn.\n●\nPartner with students in going through a past problem set or exam question (with faculty permission),\nfocusing on the process of problem solving & breaking it down into parts.\n\nLet's practice!\nOften, in a core or upper level course covering more advanced topics, it is our\ninclination to focus only on knowledge practice in recitation. The topics are\ncomplicated after all, and there is a lot to go over in each recitation! But if we want\nstudents to solve problems on a problem set or exam, we have to practice this\ntype of problem-based thinking with them.\nChoose one specific topic covered in your course.\n1. What are the skills needed to understand or master this topic?\n2. Write down a few ideas of how you could support skills practice for this topic.\nShare ideas as a group.\nCORE/UPPER\n\nExample approaches to a laboratory section\nLAB\nNote: Depending on the set of experiments to be performed (and the amount of down time), you may find that it is better to\ncondense the review at the beginning. You should do whatever works best for the set up of the lab, with guidance of instructors.\nKnowledge practice can help folks feel prepared to tackle the lab. To promote this TAs can:\n●\nReview important concepts and sticking points in the lab\n●\nHighlight key terminology\nSkills practice is what labs are all about! To best facilitate lab skills TAs should:\n●\nMonitor progress of laboratory experiments by walking around and asking questions\n●\nPromote independence by providing guidance and feedback (not giving away answers!)\n\nLaboratory Scenarios\nLAB\nYou are walking around the lab and...\n●\na student approaches you saying they made a mistake in the protocol and\nthey wonder how/if they can fix it.\n●\na student approaches you asking what step they should do next.\n●\na student approaches you asking if they got the correct result for a particular\nquestion in the lab assignment.\nFor each scenario, consider:\n1. What skills are needed, or can be reinforced, in each scenario?\n2. How can you help them practice these skills?\n\nTeaching tool: Lesson planning worksheet\n\n1. How will you introduce yourself to your students?\n2. How will you get to know your students?\n3. How will you share your own expectations/guidelines for recitation?\nWhat to do on the first day of teaching?\n\nExit Ticket:\nReflect on today's meeting\n+\nSomething you're taking away from today's topic on\norganizing a recitation\nΔΔ\nSomething you still have questions about\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\nRES.7-005 Biology Teaching Assistant (TA) Training\nSummer 2020\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "RES.7-005 Session 10 Slides: Leveraging Your Teaching Experience For The Future",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-7-005-biology-teaching-assistant-ta-training-fall-2021/session-10_-leveraging-your-teaching-experience-for-the-future_edited_processed.pdf",
      "content": "Leveraging your teaching experience for the\nfuture\nHow to market your skills as a TA across a variety of different contexts\n\nLearning Goals:\nAfter today's session you should be able to...\n1) Identify transferable skills learned in teaching\n2) Illustrate the value of these skills by describing action and impact\nImage (c) Katerina Limpitsouni, unDraw. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nWhat transferable skills do TAs have?\n\nWhat transferable skills do TAs have?\n1. Communication skills\n2. Presentation and facilitation skills\n3. Organizational skills\n4. Feedback and evaluation skills\n5. Critical thinking skills\n6. Leadership and mentoring skills\n7. Management and supervision skills\n8. Creativity and innovation skills\n9. Listening and reflection skills\n10. Learning skills\n\nBrainstorming concrete examples\nBrainstorm at least two ideas related to the common interview prompts below that\ndemonstrate some of the skills you have learned as a TA. Describe the moment as\nclearly as you can and reflect on which of your strengths contributed to your success.\nShare an example of...\n-\na challenge you faced. How did you resolve it?\n-\na mistake you made. How did you handle it?\n-\na goal you set. How did you achieve it?\n-\nhow you worked on a team.\n-\nhow you were able to motivate the people you work with.\n-\nhow you worked effectively under pressure.\nImage (c) Katerina Limpitsouni, unDraw. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nInterview and storytelling exercise\nStep 1: The interviewer invites the speaker to respond to the question,\ntaking note of any particular strengths and skills that the story highlights.\nThe interviewer may ask additional questions to help draw these out.\nStep 2: After the speaker has finished, the interviewer reflects the stories\nback to the speaker, noting particular words or phrases that helped identify\nthe speaker's strengths and skills.\nPick one prompt and share your story with a partner. Each person will have the\nopportunity to act as both speaker and interviewer.\n\nWhat themes or skills did you identify?\n\nInterview technique: STAR stories\nSituation\nAn event, project or\nchallenge you faced\nTask\nYour responsibilities\nand assignments for\nthe situation\nAction\nSteps taken to\nrelieve or rectify the\nsituation\nResult\nImpact of actions\ntaken\nIllustrations by Alexander Braile, used with permission.\n\nTell me about a time you handled a challenge. How did you\nresolve it? Skills = leadership, learning, innovation\nSituation: Students who were sick or in quarantine during the semester did not have a way\nto attend weekly problem-solving sessions (recitations) for the class.\nTask: I was asked by the course instructor to teach a hybrid recitation that would allow\nstudents to attend online and in person.\nAction: I sought out the appropriate technology and training, including learning how to use\na tablet to teach. I tested out the equipment ahead of time, and sought feedback from the\nstudents in my section to make sure they felt comfortable participating in the hybrid format.\nResult: My students appreciated my efforts to include them in the course even though they\ncould not attend in person, and I received very good evaluations from my students (Overall\nscore 6.8/7). My actions promoted both inclusion and accessibility of resources for students\nwho would otherwise have been excluded.\n\nWrite your own STAR story\nCreating a more comprehensive picture of your skills\nSituation\nAn event, project or\nchallenge you faced\nTask\nYour responsibilities\nand assignments for\nthe situation\nAction\nSteps taken to\nrelieve or rectify the\nsituation\nResult\nImpact of actions\ntaken\nIllustrations by Alexander Braile, used with permission.\n\nTurn your STAR story into a resume bullet\nResumes bullets aren't just about what you did!\nThey should communicate both action and impact.\n●\nTell your STAR story, emphasizing the result\n●\nStart with an action verb\n●\nExamples:\n○\nDeveloped comprehensive review sessions and moderated an online discussion forum to offer\nmore opportunities for questions and review.\n○\nCollaborated with a team of faculty and teaching assistants in an advanced undergraduate biology\ncourse to create a series of assessments that gauge student learning.\n\nExit Ticket:\n+ What is one thing you are taking away today's discussion?\n∆ Is there anything you still have questions about?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\nRES.7-005 Biology Teaching Assistant (TA) Training\nSummer 2020\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "RES.7-005 Session 2 Slides: Keeping Students Engaged",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-7-005-biology-teaching-assistant-ta-training-fall-2021/session-2_-keeping-students-engaged_edited_processed.pdf",
      "content": "Keeping students engaged\nEngaging students in class through active learning strategies\n\nLearning Goals:\nAfter today's meeting, TAs should be able to...\n1) Describe active learning strategies and explain their importance\n2) Implement frequent and varied active learning strategies in recitation\n\nEngagement: What makes you feel engaged in a\nclassroom?\n\nHow do we promote student engagement?\nActive learning is a cognitive process\nwhich promotes analysis, synthesis,\nand evaluation of course material.\nSTUDENT-DRIVEN\nBrame, C. (2016). Active learning. Vanderbilt University Center for Teaching.\nRetrieved 11/16/2022 from https://cft.vanderbilt.edu/active-learning/. License CC-BY-\nNC.\n\nActive learning improves student outcomes by\npromoting engagement\nCarl E. Wieman (2014) Large-scale comparison of science teaching methods sends clear message. PNAS 111(23):8319-8320.\nFreeman et. al. (2014) Active learning increases student performance in science, engineering, and mathematics. PNAS 111(23):8410-8415.\nFigures (c) National Academy of Sciences. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nActive learning promotes inclusivity\nStudent outcomes are disproportionately affected among:\n●\nwomen\n●\nunderrepresented minorities\n●\nlower income students\n●\nfirst generation students\nCBE--Life Sciences Education 2014\n13:3, 478-492.\nhttps://doi.org/10.1187/cbe.13-10-0204\nLicense BY-NC-SA\n\nWhat strategies can we use to promote active\nlearning?\nActive learning strategies should be both consistent and varied\nConsistent active learning techniques can be integrated into your\neveryday teaching (frequent, in-the-moment)\nAn array of different structured active learning activities can be\nintroduced to augment student learning (periodic, planned)\n\nActive learning techniques to implement regularly\n(frequent, in-the-moment)\n●\nThink Break - Allow 30-60 seconds for students to think about the problem before you\ngo on to explain; ask them to write it down\n●\nThink-pair-share - Students (1) think individually about a topic or answer to a question,\n(2) share ideas with a partner, and (3) partners share out with the class.\n●\n\"Why do you think that?\" - Follow up all student responses (not just the incorrect\nones) with a challenge to explain their thinking\n●\nPolling - Ask all students to respond, using informal polling (thumbs up/thumbs down,\ncolored notecards) or student response system (PollEverywhere)\n\nIncorporating Active Learning techniques in your\nclassroom\nFree Write: Identify one active learning technique have used or would you like to\nuse in your class regularly. How and when would you use it?\n\nActive learning activities to add variety\n(periodic, planned)\nIn groups of 2-3, explore one new active learning activity. Discuss the following:\n●\nPurpose (Why is this a helpful technique? What will students gain from it?):\n●\nFollow-up (How will you wrap-up your conversation and make sure everyone\nis on board?):\n●\nExample (For what types of problems/concepts would this be useful?):\nRecord your thoughts and nominate a group member to share out.\n\nActive Learning Activity: Intentional Mistakes\nGive students a worked problem that contains some mistakes. Have students, as\na class or in small groups, find mistakes and then make the corrections.\nPurpose:\nFollow up:\nExample:\n\nActive Learning Activity: Pro/Con Grid or Ranking\nAlternatives\nFor a given scenario, everyone thinks up as many alternative courses of action (or\nexplanations of the situation) as possible. Students list out the pros and cons for\neach approach, and/or rank them by preference.\nPurpose:\nFollow up:\nExample:\n\nActive Learning Activity: Picture prompt\nShow students a complex image with no explanation, and ask them to\nidentify/explain it, or to name the processes and concepts shown. Let students\nexplore all options before intervening.\nPurpose:\nFollow up:\nExample:\n\nActive Learning Activity: Blank Page Review\nInstruct students to write as much as they can remember about a topic or section\nof the lecture within a defined period of time (3-5 min) . Do this at the beginning of\nclass, with notes away, encouraging students to write the whole time.\nPurpose:\nFollow up:\nExample:\n\nActive Learning in your classroom\nCreate a rough outline of a focused active learning activity based on a topic you\nwill teach during your first week.\n●\nWhat skill do you want students to have in completing this activity (learning goal)?\n●\nExplain how your activity specifically gets at this.\n●\nHow will you assess whether students have achieved your goal?\n\nExit Ticket:\n+ What are you taking away from today's session on active learning?\n∆ Is there anything you still have questions about?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\nRES.7-005 Biology Teaching Assistant (TA) Training\nSummer 2020\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "RES.7-005 Session 3 Slides: Creating an Inclusive Classroom",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-7-005-biology-teaching-assistant-ta-training-fall-2021/session-3_-creating-an-inclusive-classroom_edited_processed.pdf",
      "content": "Creating an Inclusive Classroom\nUsing reflective teaching practices to foster inclusivity\n\nLearning Goals:\nAfter today's meeting, TAs should be able to...\n1) Identify how different teaching practices can be received by diverse\naudiences\n2) Assess strategies that promote inclusivity by engaging in self-\nreflection\n\nWhat does it mean to promote inclusivity in our\nclassrooms?\n\nWhat does it mean to promote inclusivity in our\nclassrooms?\nProviding equitable access to opportunities and resources for\npeople who might otherwise be excluded or marginalized\n\nIs it enough to \"treat all students equally\"?\nImages (c) USC Center for Urban Education. All rights reserved. This content is excluded from our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/.\n\nWhat barriers exist to educational access?\nImage (c) USC Center for Urban\nEducation. All rights reserved. This\ncontent is excluded from our Creative\nCommons license. For more\ninformation, see\nhttps://ocw.mit.edu/help/faq-fair-use/.\n\nWhat does equity in education look like?\nImage (c) USC Center for Urban\nEducation. All rights reserved. This\ncontent is excluded from our\nCreative Commons license. For\nmore information, see\nhttps://ocw.mit.edu/help/faq-fair-use/.\n\nGuided Reflection:\n●\nWhy might I use this practice?\n●\nWhat is implied about my values and expectations for students?\n●\nWhich student behaviors are encouraged and which are discouraged by using\nthis practice? Which students are affected?\n●\nWhat could be done to modify this practice to ensure inclusivity?\nChoose one teaching practice that you use (or plan to use) in a specific class\ncontext and examine it by answering the reflection questions.\n(Guided Reflection process from \"Inclusive Classrooms: How to leverage identity to improve your teaching\npractice\" a workshop developed by Dr. Darcy Gordon and Dr. David Bergsman)\n\nExample Teaching Practices (may be more or less inclusive!)\n1. Leaving time for questions at the end class\n2. Asking a question that has many possible answers and have every student share\na brief answer\n3. Waiting for at least 5 students to raise their hands before you call on anyone after\nasking a question\n4. Assign reporters for small groups discussion\n5. Learning students' names\n6. Giving students time to write\n7. Using think-pair-share (students have time to think about a question, then discuss\nit with a partner, and finally report out on their discussion)\n8. Responding to correct answers with \"excellent job\" and \"great answer\"\n\nAdditional Considerations\nEvery class, every teacher, and every group of students is different. In your own\nreflection, consider how the following features may change the inclusivity of a given\nteaching strategy:\n-\nformat of the class\n-\nvirtual vs. in-person environment\n-\ngroup membership(s) of your students\n-\nyour own identity\n-\nthe scope of the course\n\nExamining inclusivity in our classrooms\nby Darcy Gordon,\nMIT Open Learning\n\nTeaching Tool: STRATEGIES FOR INCLUSIVE PARTICIPATION\nAsk Open-ended Questions: instead of asking verbal questions with only one possible answer (closed-ended questions), ask\nquestions with multiple possible answers (open-ended questions).\nThink-Pair-Share: providing an opportunity for students to first think quietly and then share their ideas with a partner can help\nstudents rehearse and build confidence to share with the whole class, increasing participation.\nTime to Write: an opportunity to write down their ideas on paper helps many students revisit what they know, formulate questions,\nand rehearse what they may want to share, increasing participation.\nWait Time: pause for 3 to 5 seconds (longer than you think!) after you ask a question before you call on anyone to speak or\nanswer the question yourself. Longer wait times will allow more students thinking time.\nMultiple Hands, Multiple Voices: after you ask a question, say that you'll wait for at least 5 students to raise their hands before\nyou call on anyone, and then really wait for 5 hands. Promote more participation this way.\nWhip: ask a question that has many possible answers and have every student share a brief answer.\nWork in Stations/Small Groups: to decrease effective class size and provide more opportunity for interaction and discussion,\nconsider organizing multiple activities as stations that small groups rotate through. (Assign Reporters for Small Groups)\nKimberly D. Tanner (2017) Structure Matters: Twenty-One Teaching Strategies to Promote Student Engagement and Cultivate Classroom Equity.\nCBE--Life Sciences Education 12(3). License BY-NC-SA\n\nExit Ticket:\n+ What are you taking away from our discussion of inclusive teaching\npractices?\n∆ Is there anything you still have questions about?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\nRES.7-005 Biology Teaching Assistant (TA) Training\nSummer 2020\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "RES.7-005 Session 4 Slides: Providing Effective Equitable Feedback",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-7-005-biology-teaching-assistant-ta-training-fall-2021/session-4_-providing-effective-_-equitable-feedback_edited_processed.pdf",
      "content": "Providing effective & equitable feedback\nTools and techniques for grading\n\nLearning Goals:\nAfter today's meeting, TAs should be able to...\n1) Describe the features of feedback that is both effective and equitable\n2) Use grading tools for effective and equitable grading\n\nWhat is the point of giving students feedback?\n\nFeedback is effective when it...\n●\nis aligned to the learning goals of the assignment.\n●\nencourages students to adopt a growth mindset.\n●\ncreates a dialogue between student and teacher.\n\nFeedback is equitable when it...\n●\nuses objective criteria consistently across all submissions\n●\nis free of implicit or unconscious bias\n\nWritten by Darcy Gordon\nKey Grading Practices: Rubrics and feedback\n\nAn example\nQuestion: (2 points) Explain what a positive control is and why they are used, then\ngive an example of one you might design if you were to conduct an \"experiment\" at\nhome.\nStudent response: Positive controls help you decide if an experimental result is an\nartifact of the experimental design. Suppose you were testing if adding baking soda\nto houseplant soil increases flowering. A positive control would be a set of\nhouseplants that were given a commercial fertilizer that is demonstrated to increase\nthe number of blooms.\nAdapted from material by Darcy Gordon\n\nStudent Response: Positive controls help you decide if an experimental result is an\nartifact of the experimental design. Suppose you were testing if adding baking soda to\nhouseplant soil increases flowering. A positive control would be a set of houseplants that\nwere given a commercial fertilizer that is demonstrated to increase the number of\nblooms.\nPoint value\n(per part)\nExplanation of positive control (1pt)\nExample given (1pt)\nmissing entirely\nmissing entirely\n+0.5\na positive control is correctly defined\nthe home experiment is described\n+0.5\nwhy positive controls are used is explained\nthe positive control identified is correct\nAdapted from material by Darcy Gordon\n\nStudent Response: Positive controls help you decide if an experimental result is an\nartifact of the experimental design. Suppose you were testing if adding baking soda to\nhouseplant soil increases flowering. A positive control would be a set of houseplants that\nwere given a commercial fertilizer that is demonstrated to increase the number of\nblooms.\nExample feedback:\nA. Not quite- a positive control receives a treatment that is known to produce a result\ncomparable to what is proposed by your hypothesis.\nB. You gave an explanation of why positive controls are used and not what they are.\nC. 1.5/2 pts\nD. This is a good example of one application of a positive control, but your response is\nmissing a full explanation of what positive controls are. Remember positive controls\nprovide a comparison to a known outcome similar to that predicted by your hypothesis\n(1.5/2 pts).\nAdapted from material by Darcy Gordon\n\nWhat do you like and what is challenging about this\nprocess?\n\nWritten by Darcy Gordon\nRemedies to Grading Challenges\n\nIn your own words, provide this\nstudent with feedback on their\nresponse.\n[Student response]\n[Open-ended question prompt]\nCreating your own rubric and feedback\nWhat would your rubric look\nlike for this question?\n\nPractical tips for giving feedback more efficiently\n-\nLook only at what was said, don't try to interpret what might have\nbeen meant.\n-\nMake and stick to a rubric that aligns with the assignment goals\n- Don't focus on correcting every single little thing!\n-\nKeep track of the most common pieces of feedback and copy/paste.\n\"Piled Higher and Deeper\"\nby Jorge Cham\nwww.phdcomics.com\nUsed with permission\n\nGrading fatigue is normal!\n-\nShuffle the order of grading between questions.\n-\nTry to stay consistent in your comments throughout.\n-\nTake breaks to walk/stretch.\n-\nBe kind to yourself!\n\"Piled Higher and Deeper\"\nby Jorge Cham\nwww.phdcomics.com\nUsed with permission\n\nExit Ticket:\n+\nWhat are you taking away from today's discussion of effective\nand equitable grading?\nΔΔ\nIs there anything you still have questions about?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n\nRES.7-005 Biology Teaching Assistant (TA) Training\nSummer 2020\n\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "RES.7-005 Session 5 Slides: How Students Learn",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-7-005-biology-teaching-assistant-ta-training-fall-2021/session-5_-how-students-learn_edited_processed.pdf",
      "content": "How students learn\nUsing research in cognitive science and classroom practices to\ninform our teaching\n\nLearning Goals:\nAfter today's meeting, TAs should be able to...\n1) Connect research-based strategies for teaching to key principles of\nstudent learning\n\nWhat promotes student learning?\n\nHow do we know how students learn?\nCognitive research: how our brains acquire and use information\nResearch on the classroom practices: how teaching practice relate to student\nachievement\n\n-\nRead through the\nresearch-based strategy\nassigned to you\n-\nPresent your strategy (2-\n3 minutes) to the rest of\nthe group\nYour presentation should\naddress:\n-\nWhat does this\nstrategy teach you\nabout how students\nlearn?\n-\nAn example of how\nyou could implement\nthis strategy in your\nteaching.\nTitle and image (c) American Federation of Teachers. In: Rosenshine, B. (2012) Principles of instruction: Research-based strategies that all teachers should know. American\nEducator 36(1):12-19. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.005\n\nStrategies from: Rosenshine, B. (2012) Principles of instruction: Research-based strategies that all teachers should know. American Educator 36(1):12-19. (c) American\nFederation of Teachers. In: All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.006\n\nExit Ticket:\n+ What stuck out to you about how students learn, or the strategies we can\nuse to meet these needs?\n∆ Is there anything you still have questions about?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\nRES.7-005 Biology Teaching Assistant (TA) Training\nSummer 2020\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "RES.7-005 Session 5 Slides: Shared Presentation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-7-005-biology-teaching-assistant-ta-training-fall-2021/session-5_-shared-presentation_edited_processed.pdf",
      "content": "-\nRead through the\nresearch-based strategy\nassigned to you\n-\nPresent your strategy (2-\n3 minutes) to the rest of\nthe group\nYour presentation should\naddress:\n-\nWhat does this\nstrategy teach you\nabout how students\nlearn?\n-\nAn example of how\nyou could implement\nthis strategy in your\nteaching.\nTitle and image (c) American Federation of Teachers. In: Rosenshine, B. (2012) Principles of instruction: Research-based strategies that all teachers should know. American\nEducator 36(1):12-19. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\n1. Begin a lesson with a short review of previous learning\n\n2. Present new material in small steps, with student\npractice after each step\n\n3. Ask a large number of questions, checking the response\nof all students\n\n4. Provide models\n\n5. Guide student practice\n\n6. Check for student understanding\n\n7. Obtain a high success\n\n8. Provide scaffolds for difficult tasks\n\n9. Require and monitor independent practice\n\n10. Engage students in weekly and monthly review\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\nRES.7-005 Biology Teaching Assistant (TA) Training\nSummer 2020\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "RES.7-005 Session 6 Slides: Supporting Our Students",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-7-005-biology-teaching-assistant-ta-training-fall-2021/session-6_-supporting-our-students_edited_processed.pdf",
      "content": "Supporting our students\nShowing empathy and promoting a growth mindset when students are\nstruggling\n\nLearning Goals:\nAfter today's meeting, TAs should be able to...\n1) Identify ways of communicating with students that promote a growth\nmindset and minimize stereotype threat.\n2) Describe the elements of active listening and use active listening to\nsupport students.\n\nHow have you felt most supported by a teacher\nwhen you were struggling?\n\nWhat's really going on with our students?\nApparent\nChallenges\nSelf-perception and\nInternal Pressure\nPhysical, emotional,\nand social needs\nExternal Pressures\nPast experiences\nImage by Alexander Braile, used with permission.\n\nActive listening as a way of showing empathy\n2. Listen\n3. Respond\n1. Ask\nActive\nListening\n\nWhat makes a good question?\n2. Listen\n3. Respond\n1. Ask\nActive\nListening\n\nWhat makes a good question?\nGood questions are short, open-ended, non-judgmental, and future-focused (drive\nthe student to talk about what they want moving forward).\nImage (c) unDraw. All rights reserved. This\ncontent is excluded from our Creative\nCommons license. For more information,\nsee https://ocw.mit.edu/help/faq-fair-use/.\n\nActivity: What makes a good question?\nLet's say a student says to you \"I'm worried I'm not doing well in this class. Maybe I\nshould drop it.\" What question could you ask to start off the conversation?\n\nWhat does it look like to listen?\n2. Listen\n3. Respond\n1. Ask\nActive\nListening\n\nActivity: What does listening look like?\n1. Partner A should listen to Partner B speak for 60 seconds on a topic of their\nchoosing.\n2. Partner A should not respond in any way (no sounds, movements, or facial\nexpressions) to what Partner B is saying, but should maintain eye contact as\nthey are comfortable.\n3. Partner B should speak continuously for the entire period.\n4. Switch roles.\n\nActivity: What does listening look like?\nReflect on this activity:\nSpeakers - What was it like to talk to someone who did not respond physically or\nverbally? What cues would have been comforting to see from the listener to know\nthat they were paying attention?\nListeners - How did you find yourself wanting to respond? Did you notice that you\ndid some things automatically?\n\nListening well\nSignaling your attention and receptiveness as you listen can look like...\n●\nGentle eye contact\n●\nNeutral or relaxed facial expression\n●\nOpen and inviting body language\n●\nSmall affirmations, like nodding\nImage (c) unDraw. All rights reserved. This\ncontent is excluded from our Creative\nCommons license. For more information,\nsee https://ocw.mit.edu/help/faq-fair-use/.\n\nWhat does it mean to respond?\n2. Listen\n3. Respond\n1. Ask\nActive\nListening\n\nWhat does it mean to respond?\nAcknowledge you have heard what the person has said:\n●\nRestate (\"Let me make sure I've got this right ...\")\n●\nAffirm (\"I'm sorry. That sounds really frustrating.\")\n●\nReflect (\"What I'm hearing is ...\")\n●\nInterpret (\"I've noticed that ... \")\nImage (c) unDraw. All rights reserved. This\ncontent is excluded from our Creative\nCommons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/.\n\nScenarios: Responding supportively to our students\nIn groups of 2-3, pick at least one scenario that you want to discuss in depth.\nAnswer the following questions about each scenario you discuss.\n●\nHow would you respond to this student directly?\n●\nHow could you promote a growth mindset in your interactions with this\nstudent?\n●\nWhat additional resources could you refer the student to, or what resources\ncould you turn to for more information?\nPrepare to share out about at least one of the scenarios you discuss.\n\nExit Ticket:\n+ What are you taking away from today's discussion on supporting students?\n∆ Is there anything you still have questions about?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\nRES.7-005 Biology Teaching Assistant (TA) Training\nSummer 2020\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "RES.7-005 Session 7 Slides: Writing Effective Questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-7-005-biology-teaching-assistant-ta-training-fall-2021/session-7_-writing-effective-questions_edited_processed.pdf",
      "content": "Writing effective questions for assessment\nThe art (and science) of question writing\n\nLearning Goals:\nAfter today's meeting, TAs should be able to...\n1) Understand the advantages and disadvantages of different types of\nassessment questions\n2) Create assessment questions that are clear and concise, and engage\ndifferent levels of student cognition\n\nWhat is the purpose of assessment?\n\nWhat is the purpose of assessment?\nFormative assessment\nmonitors student learning\nto provide ongoing\nfeedback\nSummative assessment\nevaluates student learning\nat the end of an\ninstructional unit\n\nDefining what do you want the student to do\nBloom's\nTaxonomy\nLevels of\ncognition\n\nEngaging different levels of cognition\nCreating\nEvaluating\nAnalyzing\nApplying\nUnderstanding\nA virus has the following components [ ______ ]. Explain what type of\nvirus this is likely to be.\nRemembering\nList components of the flu virus.\n\nEngaging different levels of cognition\nCreating\nUsing your knowledge of the influenza virus, design a test to distinguish\nbetween two variants of influenza.\nEvaluating\n[Example of process to test for the flu]. Justify why this is the best\nprocess to test for the influenza virus.\nAnalyzing\nHow would you distinguish whether the patient is infected with the\ninfluenza virus vs. another common virus?\nApplying\nWhat tests could you implement to determine if a patient is infected\nwith the influenza virus?\nUnderstanding\nA virus has the following components [ ______ ]. Explain what type of\nvirus this is likely to be.\nRemembering\nList components of the influenza virus.\n\nTypes of Questions\nWhat you want the student to do will determine the type of question you should\nask. Some common question types are:\n-\nMultiple Choice (or Select All)\n-\nTrue/False\n-\nShort Answer\n→How easy is it to prepare and grade this type of question?\n→Will it allow me to diagnose student misconceptions?\n→What level of cognition will it engage students in?\n→Are there any structural limitations/pitfalls?\n\nMultiple choice/Select all\nAdvantages\n-\nEasy and quick to grade\n-\nCan assess all levels of cognition\n-\nUseful as a diagnostic tool\n(wrong choices can indicate\nmisconceptions)\n-\nFamiliar to students\nDisadvantages\n-\nSometimes difficult and time-\nconsuming to construct\n-\nEncourages students to find the\ncorrect answer by process of\nelimination\n(c) John Wiley and Sons. From: Nilson, Linda B. 2016. Teaching at Its Best : A Research-Based\nResource for College Instructors. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nRevise the multiple choice question\nVanderbilt University, Center for Teaching Writing good multiple choice questions\nby Cynthia J. Brame. License: Creative Commons BY-NC.\n\nMultiple choice pitfalls\nVanderbilt University, Center for Teaching Writing good multiple choice questions\nby Cynthia J. Brame. License: Creative Commons BY-NC.\n\nA few tips for construction\nMultiple Choice\n-\nWrite the correct response first, then the distractors (incorrect responses)\n-\nJuggle the elements or variables of a correct response, or substitute a\ncorrect variable for one that students confuse it with to create distractors\n-\nMake all responses grammatically parallel and about the same length\n(c) John Wiley and Sons. From: Nilson, Linda B. 2016. Teaching at Its Best : A Research-Based\nResource for College Instructors. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nTrue or False\nAdvantages\n-\nUsually easy to prepare and grade\n-\nCan test a lot of material in a short\ntime\n-\nCan tap higher levels of cognition\nby having students correct false\nstatements\n-\nUseful as a diagnostic tool if\nstudents have to explain\nDisadvantages\n-\nHigh guessing factor\n-\nMay be difficult to think of\nunequivocally true or false statements\n-\nEncourages instructors to test trivial\nfactual knowledge\n-\nTruly knowledgeable students may\nsee too many nuances, multiple\nmeanings, or conceive of exceptions\n(c) John Wiley and Sons. From: Nilson, Linda B. 2016. Teaching at Its Best : A Research-Based\nResource for College Instructors. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nRevise the True/False question\nWhen an enzyme is added to a reaction, the reaction is always spontaneous. (True/False)\nThe diagram at right shows the free energy changes that occur\nduring a chemical reaction. When a specific enzyme that\ncatalyzes this reaction is added, the reaction goes from being\nnon-spontaneous to spontaneous. (True/False)\nThe diagram at right shows the free energy changes that occur during a chemical reaction.\nWhen a specific enzyme is added that catalyzes this reaction, which of the following\nstatements are true about the reaction? Select all that apply.\nThe transition state energy level will decrease\nThe energy level of the reactants will increase\nThe energy level of the products will decrease\nThe reaction will go from being non-spontaneous to spontaneous\n\nA few tips for construction\nTrue or False\n-\nFocus each statement on a single idea\n-\nWrite positive statements (avoid negative or double negative)\n-\nAvoid verbal cues (usually, seldom, often, never, always, every)\n(c) John Wiley and Sons. From: Nilson, Linda B. 2016. Teaching at Its Best : A Research-Based\nResource for College Instructors. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nShort Answer\nAdvantages\n-\nEasier to construct\n-\nCan assess all levels of cognition\n-\nRequires a command of vocab\nand problem-solving skills\n-\nVery useful as a diagnostic tool\n-\nEncourages instructors to give\nstudents individual feedback\nDisadvantages\n-\nTime-consuming to grade\n-\nDifficult to standardize grading due\nto variability across answers\n(c) John Wiley and Sons. From: Nilson, Linda B. 2016. Teaching at Its Best : A Research-Based\nResource for College Instructors. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nAn example of a short answer question\nPrior knowledge:\n[Example from course that teaching assistants teach]\n\nA few tips for construction\nShort Answer\nBe very specific and concise in identifying the task that students are to perform\n-\nIdentify all the key points students should address\n-\nInstead of using what, why, or how, choose a descriptive verb that\nreflects what you want students to do\n(c) John Wiley and Sons. From: Nilson, Linda B. 2016. Teaching at Its Best : A Research-Based\nResource for College Instructors. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nCreate your own question\nPick a current or upcoming topic from your course and identify a broad question\nrelated to the material (e.g. \"How do you purify a protein?\")\nOn your own, revise this question to provide more focus (5 min)\n-\nWrite a statement answering the question - \"what do I want my students to do?\"\n(Bloom's taxonomy)\n-\nUse the Tips for construction to build your question\nShare your question with a partner, and provide each other feedback. (5 min)\n-\nIs the question clear and concise?\n-\nWhat level of Bloom's taxonomy does it ask students to engage with?\n-\nAre there any ambiguities?\n\nAdditional Tips\nConsider the background of your students, and eliminate any unnecessary jargon\nPapers, news articles, images, or every day observations can prompt a good\nquestion. Some common frameworks include:\n●\nDescribe setup, interpret data, predict results, etc. of an experiment\n●\nWhat if a component broke, a step was skipped, or a mistake was made in a particular\nprocess?\nIf several questions on an assignment are based on a single scenario or set of\ninformation\n●\nMinimize interlocking items\n●\nA longer or more complex set-up = a longer series of questions (while still avoiding\nunnecessary information!)\n\nExit Ticket:\n+ What are you taking away from today's discussion of writing effective\nquestions for assessment?\n∆ Is there anything you still have questions about?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\nRES.7-005 Biology Teaching Assistant (TA) Training\nSummer 2020\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}