{
  "course_name": "Collaborative Design and Creative Expression with Arduino Microcontrollers",
  "course_description": "This is a 9-day hands-on workshop about collaboration, design, and electronics prototyping. No previous experience with computer programming or electronics is required. Beginning students will be taught everything they need to know and advanced students will be challenged to learn new skills. Participants will learn about microcontroller programming using Arduino, collaborative software development using GitHub, solderless electronics prototyping, electronic sensors, rapid prototyping, and small team management.\nThis course is offered during the Independent Activities Period (IAP), which is a special 4-week term at MIT that runs from the first week of January until the end of the month.",
  "topics": [
    "Engineering",
    "Computer Science",
    "Electrical Engineering",
    "Robotics and Control Systems",
    "Engineering",
    "Computer Science",
    "Electrical Engineering",
    "Robotics and Control Systems"
  ],
  "syllabus_content": "Workshop Meeting Times\n\nLectures and Open Lab: 9 sessions in total, 3 hours/session\n\nOverview\n\nThis short course takes place at MIT during the 2017 IAP (Independent Activities Period).\n\nDescription\n\nThis is a 9-day hands-on workshop about collaboration, design, and electronics prototyping. No previous experience with computer programming or electronics is required. Beginning students will be taught everything they need to know and advanced students will be challenged to learn new skills. Participants will work in small teams to design and build electronics projects using open-source microprocessors. Team projects are completely open-ended and designed by participants, past projects have included: An internet-connected weather simulation station, a giant LED billboard, and a CNC drawing machine. Participants will complete three guided projects in order to learn the fundamentals and will then break into small teams to complete a one-day short project of their choosing. After the short project, participants will break into new teams that will each get $250 and four days to design, plan, and build a custom project of their choice. On the last day of the course, students will present their projects in public exhibition and have the chance to win a prize for crowd favorite. Participants will learn about microcontroller programming using Arduino, collaborative software development using GitHub, solderless electronics prototyping, electronic sensors, rapid prototyping, and small team management.\n\nGrading\n\nThere are no grades for this course.\n\nLogistics\n\nThe class size is 30 students from varying backgrounds, and the class takes place in a classroom with movable desks or tables so students can form teams.\n\nSchedule\n\nSES #\n\nTOPICS / CLASS ACTIVITIES\n\nSurvey of GitHub, Arduino, and the basics of software collaboration:\n\nAn overview of GitHub collaboration\n\nCreating and contributing to repositories\n\nAn overview of Arduino microcontrollers\n\nRecreating a guided project (roll-a-ball)\n\nThe basics of design and ideation:\n\nUsing the motors\n\nExpand, explore, and personalize the roll-a-ball example\n\nOverview of collaborative design process\n\nShort project: Form team for short project\n\nStart short project\n\nProject design and execution for short projects:\n\nCrash course in prototyping and documenting ideas\n\nShort project\n\nIdeation, pitches, team formation, and project selection for short projects:\n\nReflections from yesterday\n\nOverview of plan, team structure and expected outcomes\n\nProject ideation\n\nTeam formation\n\nGet started or refine idea\n\nPresentation of short projects\n\nProject time for long projects: Meet and create with guidance\n\nProject time for long projects: Meet and create with guidance\n\nProject time for long projects: Meet and create with guidance\n\nPresentation of long projects",
  "files": []
}