{
  "course_name": "Introduction to Computational Neuroscience with Neuroblox",
  "course_description": "In this course, you will learn the basics of computational neuroscience via hands-on model building in Neuroblox and Julia. You will simulate models from the literature, from single neurons to large circuits with synaptic plasticity, and fit them to neural data. By the end of the course, you will be able to model your data, build your own custom circuit “blox” that may be incorporated into the Neuroblox library, and explore how interventions such as drugs and stimulation probes affect neural circuits.\nComputational neuroscience aims to simulate the brain in silico, from single synapses to brain-wide networks. The field has matured in tandem with experimental neuroscience, to the point where computational modeling has become an indispensable tool for understanding neuroscience data and motivating future experiments. However, building such models can involve a painstaking process of translating concepts from the literature into working code, then optimizing it to run in a reasonable timeframe.\nNeuroblox is a new software platform for computational neuroscience that aims to break down these barriers. It is based on the Julia programming language, built with simplicity, modularity, and performance in mind. It consists of a library of modular computational building blocks (“blox”) that can be easily assembled to simulate brain dynamics in code or via an easy-to-use graphical interface. Our tools bridge scales from spiking neurons to brain waves and fMRI, and have applications to neurology and psychiatry. Moreover, the behavior of multiple model variants can be compared to discriminate between competing hypotheses.\nTo learn more about computational neuroscience and the team’s research, visit the Laboratory for Computational Neurodiagnostics website.\nCourse Audience: Anyone interested in exploring how the brain works, including how it leads to cognition. \nCourse Prerequisites: Prior coding experience is beneficial but not necessary.\nCourse Structure: Brief presentation of background material, followed by hands-on exercises and open-ended challenges.",
  "topics": [
    "Engineering",
    "Computer Science",
    "Health and Medicine",
    "Biomedical Signal and Image Processing",
    "Science",
    "Cognitive Science",
    "Engineering",
    "Computer Science",
    "Health and Medicine",
    "Biomedical Signal and Image Processing",
    "Science",
    "Cognitive Science"
  ],
  "syllabus_content": "",
  "files": []
}